; ModuleID = '/home/gleison/tf/Benchmarks/bots/serial/alignment/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@amino_acid_codes = external global i8*, align 8
@gap_pos2 = external global i32, align 4
@names = external global i8**, align 8
@seq_array = external global i8**, align 8
@seqlen_array = external global i32*, align 8
@get_seq.line = internal global [513 x i8] zeroinitializer, align 16
@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1
@bots_verbose_mode = external global i32, align 4
@stdout = external global %struct._IO_FILE*, align 8
@.str.1 = private unnamed_addr constant [35 x i8] c"Could not open sequence file (%s)\0A\00", align 1
@.str.2 = private unnamed_addr constant [26 x i8] c"Number of sequences is %d\00", align 1
@.str.3 = private unnamed_addr constant [29 x i8] c"Sequence file is bogus (%s)\0A\00", align 1
@.str.4 = private unnamed_addr constant [28 x i8] c"Sequence format is Pearson\0A\00", align 1

; Function Attrs: nounwind uwtable
define i64 @strlcpy(i8* %dst, i8* %src, i64 %siz) #0 {
entry:
  %dst.addr = alloca i8*, align 8
  %src.addr = alloca i8*, align 8
  %siz.addr = alloca i64, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !16, globals: !98)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/bots/serial/alignment")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 76, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./bots.h", directory: "/home/gleison/tf/Benchmarks/bots/serial/alignment")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "BOTS_VERBOSE_NONE", value: 0)
!7 = !DIEnumerator(name: "BOTS_VERBOSE_DEFAULT", value: 1)
!8 = !DIEnumerator(name: "BOTS_VERBOSE_DEBUG", value: 2)
!9 = !{!10, !11, !12, !14, !13, !15}
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!16 = !{!17, !27, !30, !33, !36, !95}
!17 = !DISubprogram(name: "strlcpy", scope: !18, file: !18, line: 36, type: !19, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, function: i64 (i8*, i8*, i64)* @strlcpy, variables: !26)
!18 = !DIFile(filename: "/home/gleison/tf/Benchmarks/bots/serial/alignment/tmp.c", directory: "/home/gleison/tf/Benchmarks/bots/serial/alignment")
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !13, !22, !24}
!21 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !25, line: 62, baseType: !21)
!25 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/tf/Benchmarks/bots/serial/alignment")
!26 = !{}
!27 = !DISubprogram(name: "fill_chartab", scope: !18, file: !18, line: 63, type: !28, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, function: void (i8*)* @fill_chartab, variables: !26)
!28 = !DISubroutineType(types: !29)
!29 = !{null, !13}
!30 = !DISubprogram(name: "encode", scope: !18, file: !18, line: 78, type: !31, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false, function: void (i8*, i8*, i32)* @encode, variables: !26)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !13, !13, !10}
!33 = !DISubprogram(name: "alloc_aln", scope: !18, file: !18, line: 105, type: !34, isLocal: false, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: false, function: void (i32)* @alloc_aln, variables: !26)
!34 = !DISubroutineType(types: !35)
!35 = !{null, !10}
!36 = !DISubprogram(name: "get_seq", scope: !18, file: !18, line: 121, type: !37, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false, function: i8* (i8*, i32*, i8*, %struct._IO_FILE*)* @get_seq, variables: !26)
!37 = !DISubroutineType(types: !38)
!38 = !{!13, !13, !14, !13, !39}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !41, line: 48, baseType: !42)
!41 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/tf/Benchmarks/bots/serial/alignment")
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !43, line: 241, size: 1728, align: 64, elements: !44)
!43 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/tf/Benchmarks/bots/serial/alignment")
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !65, !66, !67, !68, !72, !74, !76, !80, !83, !85, !86, !87, !88, !89, !90, !91}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !42, file: !43, line: 242, baseType: !10, size: 32, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !42, file: !43, line: 247, baseType: !13, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !42, file: !43, line: 248, baseType: !13, size: 64, align: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !42, file: !43, line: 249, baseType: !13, size: 64, align: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !42, file: !43, line: 250, baseType: !13, size: 64, align: 64, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !42, file: !43, line: 251, baseType: !13, size: 64, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !42, file: !43, line: 252, baseType: !13, size: 64, align: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !42, file: !43, line: 253, baseType: !13, size: 64, align: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !42, file: !43, line: 254, baseType: !13, size: 64, align: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !42, file: !43, line: 256, baseType: !13, size: 64, align: 64, offset: 576)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !42, file: !43, line: 257, baseType: !13, size: 64, align: 64, offset: 640)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !42, file: !43, line: 258, baseType: !13, size: 64, align: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !42, file: !43, line: 260, baseType: !58, size: 64, align: 64, offset: 768)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !43, line: 156, size: 192, align: 64, elements: !60)
!60 = !{!61, !62, !64}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !59, file: !43, line: 157, baseType: !58, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !59, file: !43, line: 158, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !59, file: !43, line: 162, baseType: !10, size: 32, align: 32, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !42, file: !43, line: 262, baseType: !63, size: 64, align: 64, offset: 832)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !42, file: !43, line: 264, baseType: !10, size: 32, align: 32, offset: 896)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !42, file: !43, line: 268, baseType: !10, size: 32, align: 32, offset: 928)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !42, file: !43, line: 270, baseType: !69, size: 64, align: 64, offset: 960)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !70, line: 131, baseType: !71)
!70 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/tf/Benchmarks/bots/serial/alignment")
!71 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !42, file: !43, line: 274, baseType: !73, size: 16, align: 16, offset: 1024)
!73 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !42, file: !43, line: 275, baseType: !75, size: 8, align: 8, offset: 1040)
!75 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !42, file: !43, line: 276, baseType: !77, size: 8, align: 8, offset: 1048)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, align: 8, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 1)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !42, file: !43, line: 280, baseType: !81, size: 64, align: 64, offset: 1088)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !43, line: 150, baseType: null)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !42, file: !43, line: 289, baseType: !84, size: 64, align: 64, offset: 1152)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !70, line: 132, baseType: !71)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !42, file: !43, line: 297, baseType: !15, size: 64, align: 64, offset: 1216)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !42, file: !43, line: 298, baseType: !15, size: 64, align: 64, offset: 1280)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !42, file: !43, line: 299, baseType: !15, size: 64, align: 64, offset: 1344)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !42, file: !43, line: 300, baseType: !15, size: 64, align: 64, offset: 1408)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !42, file: !43, line: 302, baseType: !24, size: 64, align: 64, offset: 1472)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !42, file: !43, line: 303, baseType: !10, size: 32, align: 32, offset: 1536)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !42, file: !43, line: 305, baseType: !92, size: 160, align: 8, offset: 1568)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, align: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 20)
!95 = !DISubprogram(name: "readseqs", scope: !18, file: !18, line: 164, type: !96, isLocal: false, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i8*)* @readseqs, variables: !26)
!96 = !DISubroutineType(types: !97)
!97 = !{!10, !13}
!98 = !{!99}
!99 = !DIGlobalVariable(name: "line", scope: !36, file: !18, line: 124, type: !100, isLocal: true, isDefinition: true, variable: [513 x i8]* @get_seq.line)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 4104, align: 8, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 513)
!103 = !{i32 2, !"Dwarf Version", i32 4}
!104 = !{i32 2, !"Debug Info Version", i32 3}
!105 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dst", arg: 1, scope: !17, file: !18, line: 36, type: !13)
!107 = !DIExpression()
!108 = !DILocation(line: 36, column: 22, scope: !17)
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !17, file: !18, line: 36, type: !22)
!110 = !DILocation(line: 36, column: 39, scope: !17)
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "siz", arg: 3, scope: !17, file: !18, line: 36, type: !24)
!112 = !DILocation(line: 36, column: 51, scope: !17)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !17, file: !18, line: 37, type: !13)
!114 = !DILocation(line: 37, column: 9, scope: !17)
!115 = !DILocation(line: 37, column: 13, scope: !17)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !17, file: !18, line: 38, type: !22)
!117 = !DILocation(line: 38, column: 15, scope: !17)
!118 = !DILocation(line: 38, column: 19, scope: !17)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !17, file: !18, line: 39, type: !24)
!120 = !DILocation(line: 39, column: 10, scope: !17)
!121 = !DILocation(line: 39, column: 14, scope: !17)
!122 = !DILocation(line: 42, column: 7, scope: !123)
!123 = distinct !DILexicalBlock(scope: !17, file: !18, line: 42, column: 7)
!124 = !DILocation(line: 42, column: 9, scope: !123)
!125 = !DILocation(line: 42, column: 7, scope: !17)
!126 = !DILocation(line: 43, column: 5, scope: !127)
!127 = distinct !DILexicalBlock(scope: !123, file: !18, line: 42, column: 15)
!128 = !DILocation(line: 43, column: 12, scope: !129)
!129 = !DILexicalBlockFile(scope: !130, file: !18, discriminator: 2)
!130 = !DILexicalBlockFile(scope: !127, file: !18, discriminator: 1)
!131 = !DILocation(line: 43, column: 16, scope: !127)
!132 = !DILocation(line: 44, column: 21, scope: !133)
!133 = distinct !DILexicalBlock(scope: !134, file: !18, line: 44, column: 11)
!134 = distinct !DILexicalBlock(scope: !127, file: !18, line: 43, column: 22)
!135 = !DILocation(line: 44, column: 19, scope: !133)
!136 = !DILocation(line: 44, column: 14, scope: !133)
!137 = !DILocation(line: 44, column: 17, scope: !133)
!138 = !DILocation(line: 44, column: 11, scope: !133)
!139 = !DILocation(line: 44, column: 25, scope: !133)
!140 = !DILocation(line: 44, column: 11, scope: !134)
!141 = !DILocation(line: 45, column: 9, scope: !133)
!142 = !DILocation(line: 47, column: 3, scope: !127)
!143 = !DILocation(line: 50, column: 7, scope: !144)
!144 = distinct !DILexicalBlock(scope: !17, file: !18, line: 50, column: 7)
!145 = !DILocation(line: 50, column: 9, scope: !144)
!146 = !DILocation(line: 50, column: 7, scope: !17)
!147 = !DILocation(line: 51, column: 9, scope: !148)
!148 = distinct !DILexicalBlock(scope: !149, file: !18, line: 51, column: 9)
!149 = distinct !DILexicalBlock(scope: !144, file: !18, line: 50, column: 15)
!150 = !DILocation(line: 51, column: 13, scope: !148)
!151 = !DILocation(line: 51, column: 9, scope: !149)
