; ModuleID = '/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/Pathfinder/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.NodeStruct = type { i32, i32, i8*, i32, i32, %struct.NodeStruct*, %struct.NodeListStruct*, %struct.EdgeListStruct*, i32, i32 }
%struct.NodeListStruct = type { %struct.NodeStruct*, %struct.NodeListStruct* }
%struct.EdgeListStruct = type { i32, %struct.NodeStruct*, %struct.EdgeListStruct* }

; Function Attrs: nounwind uwtable
define %struct.NodeStruct* @Node_new(i32 %id, i32 %nodeCount) #0 {
entry:
  %retval = alloca %struct.NodeStruct*, align 8
  %id.addr = alloca i32, align 4
  %nodeCount.addr = alloca i32, align 4
  %node = alloca %struct.NodeStruct*, align 8
  store i32 %id, i32* %id.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %id.addr, metadata !84, metadata !85), !dbg !86
  store i32 %nodeCount, i32* %nodeCount.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %nodeCount.addr, metadata !87, metadata !85), !dbg !88
  call void @llvm.dbg.declare(metadata %struct.NodeStruct** %node, metadata !89, metadata !85), !dbg !90
  %call = call noalias i8* @malloc(i64 56) #3, !dbg !91
  %0 = bitcast i8* %call to %struct.NodeStruct*, !dbg !91
  store %struct.NodeStruct* %0, %struct.NodeStruct** %node, align 8, !dbg !90
  %1 = load %struct.NodeStruct*, %struct.NodeStruct** %node, align 8, !dbg !92
  %tobool = icmp ne %struct.NodeStruct* %1, null, !dbg !92

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !11)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/Pathfinder")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 55, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./node.h", directory: "/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/Pathfinder")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "exteriorNode", value: 0)
!7 = !DIEnumerator(name: "interiorNode", value: 1)
!8 = !DIEnumerator(name: "entranceNode", value: 2)
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!11 = !{!12, !48, !51, !54, !57, !58, !62, !65, !68, !71, !72, !75, !78}
!12 = !DISubprogram(name: "Node_new", scope: !13, file: !13, line: 59, type: !14, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, function: %struct.NodeStruct* (i32, i32)* @Node_new, variables: !47)
!13 = !DIFile(filename: "/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/Pathfinder/tmp.c", directory: "/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/Pathfinder")
!14 = !DISubroutineType(types: !15)
!15 = !{!16, !21, !21}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "Node", file: !4, line: 70, baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "NodeStruct", file: !4, line: 78, size: 448, align: 64, elements: !19)
!19 = !{!20, !22, !23, !26, !27, !29, !30, !37, !45, !46}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !18, file: !4, line: 80, baseType: !21, size: 32, align: 32)
!21 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "nodeCount", scope: !18, file: !4, line: 81, baseType: !21, size: 32, align: 32, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !18, file: !4, line: 82, baseType: !24, size: 64, align: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "labelIdx", scope: !18, file: !4, line: 83, baseType: !21, size: 32, align: 32, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !18, file: !4, line: 84, baseType: !28, size: 32, align: 32, offset: 160)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeType", file: !4, line: 60, baseType: !3)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !18, file: !4, line: 85, baseType: !16, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "interiorNodes", scope: !18, file: !4, line: 86, baseType: !31, size: 64, align: 64, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeList", file: !4, line: 71, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "NodeListStruct", file: !4, line: 108, size: 128, align: 64, elements: !34)
!34 = !{!35, !36}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !33, file: !4, line: 110, baseType: !16, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "nextNode", scope: !33, file: !4, line: 111, baseType: !31, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "edges", scope: !18, file: !4, line: 87, baseType: !38, size: 64, align: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "EdgeList", file: !4, line: 72, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "EdgeListStruct", file: !4, line: 148, size: 192, align: 64, elements: !41)
!41 = !{!42, !43, !44}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "targetNodeId", scope: !40, file: !4, line: 150, baseType: !21, size: 32, align: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "targetNode", scope: !40, file: !4, line: 151, baseType: !16, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "nextEdge", scope: !40, file: !4, line: 152, baseType: !38, size: 64, align: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "edgeCount", scope: !18, file: !4, line: 89, baseType: !21, size: 32, align: 32, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "entranceCount", scope: !18, file: !4, line: 90, baseType: !21, size: 32, align: 32, offset: 416)
!47 = !{}
!48 = !DISubprogram(name: "Node_delete", scope: !13, file: !13, line: 81, type: !49, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.NodeStruct*)* @Node_delete, variables: !47)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !16}
!51 = !DISubprogram(name: "Node_duplicate", scope: !13, file: !13, line: 96, type: !52, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false, function: %struct.NodeStruct* (%struct.NodeStruct*, i32)* @Node_duplicate, variables: !47)
!52 = !DISubroutineType(types: !53)
!53 = !{!16, !16, !21}
!54 = !DISubprogram(name: "Node_setParent", scope: !13, file: !13, line: 118, type: !55, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.NodeStruct*, %struct.NodeStruct*)* @Node_setParent, variables: !47)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !16, !16}
!57 = !DISubprogram(name: "Node_addInteriorNode", scope: !13, file: !13, line: 128, type: !55, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.NodeStruct*, %struct.NodeStruct*)* @Node_addInteriorNode, variables: !47)
!58 = !DISubprogram(name: "Node_addEdgeToNode", scope: !13, file: !13, line: 149, type: !59, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false, function: i1 (%struct.NodeStruct*, %struct.NodeStruct*)* @Node_addEdgeToNode, variables: !47)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !16, !16}
!61 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!62 = !DISubprogram(name: "NodeList_new", scope: !13, file: !13, line: 179, type: !63, isLocal: false, isDefinition: true, scopeLine: 179, isOptimized: false, function: %struct.NodeListStruct* ()* @NodeList_new, variables: !47)
!63 = !DISubroutineType(types: !64)
!64 = !{!31}
!65 = !DISubprogram(name: "NodeList_clear", scope: !13, file: !13, line: 194, type: !66, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.NodeListStruct*, i1)* @NodeList_clear, variables: !47)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !31, !61}
!68 = !DISubprogram(name: "NodeList_insertFront", scope: !13, file: !13, line: 214, type: !69, isLocal: false, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: false, function: i1 (%struct.NodeListStruct*, %struct.NodeStruct*)* @NodeList_insertFront, variables: !47)
!69 = !DISubroutineType(types: !70)
!70 = !{!61, !31, !16}
!71 = !DISubprogram(name: "NodeList_insertBack", scope: !13, file: !13, line: 238, type: !69, isLocal: false, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: false, function: i1 (%struct.NodeListStruct*, %struct.NodeStruct*)* @NodeList_insertBack, variables: !47)
!72 = !DISubprogram(name: "EdgeList_new", scope: !13, file: !13, line: 275, type: !73, isLocal: false, isDefinition: true, scopeLine: 275, isOptimized: false, function: %struct.EdgeListStruct* ()* @EdgeList_new, variables: !47)
!73 = !DISubroutineType(types: !74)
!74 = !{!38}
!75 = !DISubprogram(name: "EdgeList_clear", scope: !13, file: !13, line: 286, type: !76, isLocal: false, isDefinition: true, scopeLine: 286, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.EdgeListStruct*)* @EdgeList_clear, variables: !47)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !38}
!78 = !DISubprogram(name: "EdgeList_insertNodeId", scope: !13, file: !13, line: 302, type: !79, isLocal: false, isDefinition: true, scopeLine: 302, flags: DIFlagPrototyped, isOptimized: false, function: i1 (%struct.EdgeListStruct*, i32)* @EdgeList_insertNodeId, variables: !47)
!79 = !DISubroutineType(types: !80)
!80 = !{!61, !38, !21}
