; ModuleID = 'result.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.root = type { %struct.demand, double, double, %struct.demand, double, double, [11 x %struct.lateral*] }
%struct.demand = type { double, double }
%struct.lateral = type { %struct.demand, double, double, double, double, %struct.lateral*, %struct.branch* }
%struct.branch = type { %struct.demand, double, double, double, double, %struct.branch*, [12 x %struct.leaf*] }
%struct.leaf = type { %struct.demand, double, double }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !13)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/Olden/power")
!2 = !{}
!3 = !{!4}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !{!6}
!6 = !DISubprogram(name: "main", scope: !7, file: !7, line: 55, type: !8, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !2)
!7 = !DIFile(filename: "/home/gleison/tf/Benchmarks/Olden/power/tmp.c", directory: "/home/gleison/tf/Benchmarks/Olden/power")
!8 = !DISubroutineType(types: !9)
!9 = !{!4, !4, !10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!13 = !{!14, !19}
!14 = !DIGlobalVariable(name: "map_P", scope: !0, file: !7, line: 18, type: !15, isLocal: false, isDefinition: true, variable: [36 x double]* @map_P)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 2304, align: 64, elements: !17)
!16 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!17 = !{!18}
!18 = !DISubrange(count: 36)
!19 = !DIGlobalVariable(name: "map_Q", scope: !0, file: !7, line: 37, type: !15, isLocal: false, isDefinition: true, variable: [36 x double]* @map_Q)
!20 = !{i32 2, !"Dwarf Version", i32 4}
!21 = !{i32 2, !"Debug Info Version", i32 3}
!22 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!23 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !6, file: !7, line: 55, type: !4)
!24 = !DIExpression()
!25 = !DILocation(line: 55, column: 14, scope: !6)
!26 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !6, file: !7, line: 55, type: !10)
!27 = !DILocation(line: 55, column: 26, scope: !6)
!28 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "finished", scope: !6, file: !7, line: 57, type: !4)
!29 = !DILocation(line: 57, column: 10, scope: !6)
!30 = !DILocation(line: 60, column: 3, scope: !6)
!31 = !DILocation(line: 63, column: 7, scope: !6)
!32 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !6, file: !7, line: 56, type: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "Root", file: !34, line: 58, baseType: !35)
!34 = !DIFile(filename: "./power.h", directory: "/home/gleison/tf/Benchmarks/Olden/power")
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "root", file: !34, line: 50, size: 1216, align: 64, elements: !37)
!37 = !{!38, !44, !45, !46, !47, !48, !49}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !36, file: !34, line: 51, baseType: !39, size: 128, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "Demand", file: !34, line: 20, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "demand", file: !34, line: 17, size: 128, align: 64, elements: !41)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !40, file: !34, line: 18, baseType: !16, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !40, file: !34, line: 19, baseType: !16, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "theta_R", scope: !36, file: !34, line: 52, baseType: !16, size: 64, align: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "theta_I", scope: !36, file: !34, line: 53, baseType: !16, size: 64, align: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !36, file: !34, line: 54, baseType: !39, size: 128, align: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "last_theta_R", scope: !36, file: !34, line: 55, baseType: !16, size: 64, align: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "last_theta_I", scope: !36, file: !34, line: 56, baseType: !16, size: 64, align: 64, offset: 448)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "feeders", scope: !36, file: !34, line: 57, baseType: !50, size: 704, align: 64, offset: 512)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 704, align: 64, elements: !80)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "lateral", file: !34, line: 60, size: 512, align: 64, elements: !53)
!53 = !{!54, !55, !56, !57, !58, !59, !60}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !52, file: !34, line: 61, baseType: !39, size: 128, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !52, file: !34, line: 62, baseType: !16, size: 64, align: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !52, file: !34, line: 63, baseType: !16, size: 64, align: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !52, file: !34, line: 64, baseType: !16, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !52, file: !34, line: 65, baseType: !16, size: 64, align: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "next_lateral", scope: !52, file: !34, line: 66, baseType: !51, size: 64, align: 64, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "branch", scope: !52, file: !34, line: 67, baseType: !61, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "branch", file: !34, line: 70, size: 1216, align: 64, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69, !70}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !62, file: !34, line: 71, baseType: !39, size: 128, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !62, file: !34, line: 72, baseType: !16, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !62, file: !34, line: 73, baseType: !16, size: 64, align: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !62, file: !34, line: 74, baseType: !16, size: 64, align: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !62, file: !34, line: 75, baseType: !16, size: 64, align: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "next_branch", scope: !62, file: !34, line: 76, baseType: !61, size: 64, align: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "leaves", scope: !62, file: !34, line: 77, baseType: !71, size: 768, align: 64, offset: 448)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 768, align: 64, elements: !78)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "leaf", file: !34, line: 80, size: 256, align: 64, elements: !74)
!74 = !{!75, !76, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !73, file: !34, line: 81, baseType: !39, size: 128, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pi_R", scope: !73, file: !34, line: 82, baseType: !16, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "pi_I", scope: !73, file: !34, line: 83, baseType: !16, size: 64, align: 64, offset: 192)
!78 = !{!79}
!79 = !DISubrange(count: 12)
!80 = !{!81}
!81 = !DISubrange(count: 11)
!82 = !DILocation(line: 56, column: 8, scope: !6)
!83 = !DILocation(line: 64, column: 3, scope: !6)
!84 = !DILocation(line: 65, column: 3, scope: !6)
!85 = !DILocation(line: 66, column: 3, scope: !6)
!86 = !DILocation(line: 67, column: 18, scope: !6)
!87 = !DILocation(line: 67, column: 20, scope: !6)
!88 = !DILocation(line: 67, column: 6, scope: !6)
!89 = !DILocation(line: 67, column: 11, scope: !6)
!90 = !DILocation(line: 67, column: 13, scope: !6)
!91 = !DILocation(line: 68, column: 18, scope: !6)
!92 = !DILocation(line: 68, column: 20, scope: !6)
!93 = !DILocation(line: 68, column: 6, scope: !6)
!94 = !DILocation(line: 68, column: 11, scope: !6)
!95 = !DILocation(line: 68, column: 13, scope: !6)
!96 = !DILocation(line: 69, column: 24, scope: !6)
!97 = !DILocation(line: 69, column: 6, scope: !6)
!98 = !DILocation(line: 69, column: 19, scope: !6)
!99 = !DILocation(line: 70, column: 24, scope: !6)
!100 = !DILocation(line: 70, column: 6, scope: !6)
!101 = !DILocation(line: 70, column: 19, scope: !6)
!102 = !DILocation(line: 71, column: 6, scope: !6)
!103 = !DILocation(line: 71, column: 14, scope: !6)
!104 = !DILocation(line: 72, column: 6, scope: !6)
!105 = !DILocation(line: 72, column: 14, scope: !6)
!106 = !DILocation(line: 74, column: 3, scope: !6)
!107 = !DILocation(line: 74, column: 10, scope: !6)
!108 = !DILocation(line: 75, column: 5, scope: !109)
!109 = distinct !DILexicalBlock(scope: !6, file: !7, line: 74, column: 21)
!110 = !DILocation(line: 77, column: 15, scope: !109)
!111 = !DILocation(line: 77, column: 27, scope: !109)
!112 = !DILocation(line: 77, column: 39, scope: !109)
!113 = !DILocation(line: 77, column: 41, scope: !109)
!114 = !DILocation(line: 77, column: 47, scope: !109)
!115 = !DILocation(line: 77, column: 49, scope: !109)
!116 = !DILocation(line: 76, column: 5, scope: !109)
!117 = !DILocation(line: 78, column: 17, scope: !118)
!118 = distinct !DILexicalBlock(scope: !109, file: !7, line: 78, column: 9)
!119 = !DILocation(line: 78, column: 19, scope: !118)
!120 = !DILocation(line: 78, column: 21, scope: !118)
!121 = !DILocation(line: 78, column: 36, scope: !118)
!122 = !DILocation(line: 78, column: 31, scope: !118)
!123 = !DILocation(line: 78, column: 9, scope: !118)
!124 = !DILocation(line: 78, column: 45, scope: !118)
!125 = !DILocation(line: 78, column: 60, scope: !118)
!126 = !DILocation(line: 79, column: 17, scope: !118)
!127 = !DILocation(line: 79, column: 19, scope: !118)
!128 = !DILocation(line: 79, column: 21, scope: !118)
!129 = !DILocation(line: 79, column: 36, scope: !118)
!130 = !DILocation(line: 79, column: 31, scope: !118)
!131 = !DILocation(line: 79, column: 9, scope: !118)
!132 = !DILocation(line: 79, column: 45, scope: !118)
!133 = !DILocation(line: 78, column: 9, scope: !109)
!134 = !DILocation(line: 81, column: 5, scope: !135)
!135 = distinct !DILexicalBlock(scope: !118, file: !7, line: 79, column: 61)
!136 = !DILocation(line: 82, column: 21, scope: !137)
!137 = distinct !DILexicalBlock(scope: !118, file: !7, line: 81, column: 12)
!138 = !DILocation(line: 82, column: 29, scope: !137)
!139 = !DILocation(line: 82, column: 44, scope: !137)
!140 = !DILocation(line: 82, column: 11, scope: !137)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !6, file: !7, line: 57, type: !4)
!142 = !DILocation(line: 57, column: 7, scope: !6)
!143 = !DILocation(line: 83, column: 13, scope: !144)
!144 = distinct !DILexicalBlock(scope: !137, file: !7, line: 83, column: 11)
!145 = !DILocation(line: 83, column: 11, scope: !137)
!146 = !DILocation(line: 84, column: 9, scope: !144)
!147 = !DILocation(line: 85, column: 13, scope: !148)
!148 = distinct !DILexicalBlock(scope: !137, file: !7, line: 85, column: 11)
!149 = !DILocation(line: 85, column: 11, scope: !137)
