; ModuleID = '/home/gleison/tf/Benchmarks/Olden/power/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.root = type { %struct.demand, double, double, %struct.demand, double, double, [11 x %struct.lateral*] }
%struct.demand = type { double, double }
%struct.lateral = type { %struct.demand, double, double, double, double, %struct.lateral*, %struct.branch* }
%struct.branch = type { %struct.demand, double, double, double, double, %struct.branch*, [12 x %struct.leaf*] }
%struct.leaf = type { %struct.demand, double, double }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !13)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/Olden/power")
!2 = !{}
!3 = !{!4}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !{!6}
!6 = !DISubprogram(name: "main", scope: !7, file: !7, line: 55, type: !8, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !2)
!7 = !DIFile(filename: "/home/gleison/tf/Benchmarks/Olden/power/tmp.c", directory: "/home/gleison/tf/Benchmarks/Olden/power")
!8 = !DISubroutineType(types: !9)
!9 = !{!4, !4, !10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!13 = !{!14, !19}
!14 = !DIGlobalVariable(name: "map_P", scope: !0, file: !7, line: 18, type: !15, isLocal: false, isDefinition: true, variable: [36 x double]* @map_P)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 2304, align: 64, elements: !17)
!16 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!17 = !{!18}
!18 = !DISubrange(count: 36)
!19 = !DIGlobalVariable(name: "map_Q", scope: !0, file: !7, line: 37, type: !15, isLocal: false, isDefinition: true, variable: [36 x double]* @map_Q)
!20 = !{i32 2, !"Dwarf Version", i32 4}
!21 = !{i32 2, !"Debug Info Version", i32 3}
!22 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!23 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !6, file: !7, line: 55, type: !4)
!24 = !DIExpression()
!25 = !DILocation(line: 55, column: 14, scope: !6)
!26 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !6, file: !7, line: 55, type: !10)
!27 = !DILocation(line: 55, column: 26, scope: !6)
!28 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !6, file: !7, line: 56, type: !29)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "Root", file: !30, line: 58, baseType: !31)
!30 = !DIFile(filename: "./power.h", directory: "/home/gleison/tf/Benchmarks/Olden/power")
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "root", file: !30, line: 50, size: 1216, align: 64, elements: !33)
!33 = !{!34, !40, !41, !42, !43, !44, !45}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !32, file: !30, line: 51, baseType: !35, size: 128, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "Demand", file: !30, line: 20, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "demand", file: !30, line: 17, size: 128, align: 64, elements: !37)
!37 = !{!38, !39}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !36, file: !30, line: 18, baseType: !16, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !36, file: !30, line: 19, baseType: !16, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "theta_R", scope: !32, file: !30, line: 52, baseType: !16, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "theta_I", scope: !32, file: !30, line: 53, baseType: !16, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !32, file: !30, line: 54, baseType: !35, size: 128, align: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "last_theta_R", scope: !32, file: !30, line: 55, baseType: !16, size: 64, align: 64, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "last_theta_I", scope: !32, file: !30, line: 56, baseType: !16, size: 64, align: 64, offset: 448)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "feeders", scope: !32, file: !30, line: 57, baseType: !46, size: 704, align: 64, offset: 512)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 704, align: 64, elements: !76)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "lateral", file: !30, line: 60, size: 512, align: 64, elements: !49)
!49 = !{!50, !51, !52, !53, !54, !55, !56}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !48, file: !30, line: 61, baseType: !35, size: 128, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !48, file: !30, line: 62, baseType: !16, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !48, file: !30, line: 63, baseType: !16, size: 64, align: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !48, file: !30, line: 64, baseType: !16, size: 64, align: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !48, file: !30, line: 65, baseType: !16, size: 64, align: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "next_lateral", scope: !48, file: !30, line: 66, baseType: !47, size: 64, align: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "branch", scope: !48, file: !30, line: 67, baseType: !57, size: 64, align: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "branch", file: !30, line: 70, size: 1216, align: 64, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !65, !66}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !58, file: !30, line: 71, baseType: !35, size: 128, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !58, file: !30, line: 72, baseType: !16, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !58, file: !30, line: 73, baseType: !16, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !58, file: !30, line: 74, baseType: !16, size: 64, align: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !58, file: !30, line: 75, baseType: !16, size: 64, align: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "next_branch", scope: !58, file: !30, line: 76, baseType: !57, size: 64, align: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "leaves", scope: !58, file: !30, line: 77, baseType: !67, size: 768, align: 64, offset: 448)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 768, align: 64, elements: !74)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "leaf", file: !30, line: 80, size: 256, align: 64, elements: !70)
!70 = !{!71, !72, !73}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !69, file: !30, line: 81, baseType: !35, size: 128, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "pi_R", scope: !69, file: !30, line: 82, baseType: !16, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "pi_I", scope: !69, file: !30, line: 83, baseType: !16, size: 64, align: 64, offset: 192)
!74 = !{!75}
!75 = !DISubrange(count: 12)
!76 = !{!77}
!77 = !DISubrange(count: 11)
!78 = !DILocation(line: 56, column: 8, scope: !6)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !6, file: !7, line: 57, type: !4)
!80 = !DILocation(line: 57, column: 7, scope: !6)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "finished", scope: !6, file: !7, line: 57, type: !4)
!82 = !DILocation(line: 57, column: 10, scope: !6)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d_theta_R", scope: !6, file: !7, line: 58, type: !16)
!84 = !DILocation(line: 58, column: 10, scope: !6)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d_theta_I", scope: !6, file: !7, line: 58, type: !16)
!86 = !DILocation(line: 58, column: 21, scope: !6)
!87 = !DILocation(line: 60, column: 3, scope: !6)
!88 = !DILocation(line: 63, column: 7, scope: !6)
!89 = !DILocation(line: 63, column: 5, scope: !6)
!90 = !DILocation(line: 64, column: 3, scope: !6)
!91 = !DILocation(line: 65, column: 16, scope: !6)
!92 = !DILocation(line: 65, column: 3, scope: !6)
!93 = !DILocation(line: 66, column: 3, scope: !6)
!94 = !DILocation(line: 67, column: 15, scope: !6)
!95 = !DILocation(line: 67, column: 18, scope: !6)
!96 = !DILocation(line: 67, column: 20, scope: !6)
!97 = !DILocation(line: 67, column: 3, scope: !6)
!98 = !DILocation(line: 67, column: 6, scope: !6)
!99 = !DILocation(line: 67, column: 11, scope: !6)
!100 = !DILocation(line: 67, column: 13, scope: !6)
!101 = !DILocation(line: 68, column: 15, scope: !6)
!102 = !DILocation(line: 68, column: 18, scope: !6)
!103 = !DILocation(line: 68, column: 20, scope: !6)
!104 = !DILocation(line: 68, column: 3, scope: !6)
!105 = !DILocation(line: 68, column: 6, scope: !6)
!106 = !DILocation(line: 68, column: 11, scope: !6)
!107 = !DILocation(line: 68, column: 13, scope: !6)
!108 = !DILocation(line: 69, column: 21, scope: !6)
!109 = !DILocation(line: 69, column: 24, scope: !6)
!110 = !DILocation(line: 69, column: 3, scope: !6)
!111 = !DILocation(line: 69, column: 6, scope: !6)
!112 = !DILocation(line: 69, column: 19, scope: !6)
!113 = !DILocation(line: 70, column: 21, scope: !6)
!114 = !DILocation(line: 70, column: 24, scope: !6)
!115 = !DILocation(line: 70, column: 3, scope: !6)
!116 = !DILocation(line: 70, column: 6, scope: !6)
!117 = !DILocation(line: 70, column: 19, scope: !6)
!118 = !DILocation(line: 71, column: 3, scope: !6)
!119 = !DILocation(line: 71, column: 6, scope: !6)
!120 = !DILocation(line: 71, column: 14, scope: !6)
!121 = !DILocation(line: 72, column: 3, scope: !6)
!122 = !DILocation(line: 72, column: 6, scope: !6)
!123 = !DILocation(line: 72, column: 14, scope: !6)
!124 = !DILocation(line: 74, column: 3, scope: !6)
!125 = !DILocation(line: 74, column: 11, scope: !126)
!126 = !DILexicalBlockFile(scope: !127, file: !7, discriminator: 2)
!127 = !DILexicalBlockFile(scope: !6, file: !7, discriminator: 1)
!128 = !DILocation(line: 74, column: 10, scope: !6)
!129 = !DILocation(line: 75, column: 18, scope: !130)
!130 = distinct !DILexicalBlock(scope: !6, file: !7, line: 74, column: 21)
!131 = !DILocation(line: 75, column: 5, scope: !130)
!132 = !DILocation(line: 77, column: 12, scope: !130)
!133 = !DILocation(line: 77, column: 15, scope: !130)
!134 = !DILocation(line: 77, column: 24, scope: !130)
!135 = !DILocation(line: 77, column: 27, scope: !130)
!136 = !DILocation(line: 77, column: 36, scope: !130)
!137 = !DILocation(line: 77, column: 39, scope: !130)
!138 = !DILocation(line: 77, column: 41, scope: !130)
!139 = !DILocation(line: 77, column: 44, scope: !130)
!140 = !DILocation(line: 77, column: 47, scope: !130)
!141 = !DILocation(line: 77, column: 49, scope: !130)
!142 = !DILocation(line: 76, column: 5, scope: !130)
!143 = !DILocation(line: 78, column: 14, scope: !144)
!144 = distinct !DILexicalBlock(scope: !130, file: !7, line: 78, column: 9)
