; ModuleID = 'result.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.info = type { i32, i32, i32, i32, i32, [18 x i32] }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@preseason = global i32 0, align 4
@terminate = global i32 0, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !96)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/football")
!2 = !{}
!3 = !{!4}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !{!6, !13, !14, !78, !81, !89, !92}
!6 = !DISubprogram(name: "a_wild_card", scope: !7, file: !7, line: 79, type: !8, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32)* @a_wild_card, variables: !2)
!7 = !DIFile(filename: "/home/gleison/tf/Benchmarks/Prolangs-C/football/tmp.c", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/football")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !11}
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEAM", file: !12, line: 22, baseType: !10)
!12 = !DIFile(filename: "./definitions.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/football")
!13 = !DISubprogram(name: "a_champ", scope: !7, file: !7, line: 85, type: !8, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32)* @a_champ, variables: !2)
!14 = !DISubprogram(name: "find_name", scope: !7, file: !7, line: 91, type: !15, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct._IO_FILE*, i8*)* @find_name, variables: !2)
!15 = !DISubroutineType(types: !16)
!16 = !{!10, !17, !25}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !19, line: 48, baseType: !20)
!19 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/football")
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 241, size: 1728, align: 64, elements: !22)
!21 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/football")
!22 = !{!23, !24, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !44, !45, !46, !47, !51, !53, !55, !59, !62, !64, !66, !67, !68, !69, !73, !74}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !20, file: !21, line: 242, baseType: !10, size: 32, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !20, file: !21, line: 247, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !20, file: !21, line: 248, baseType: !25, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !20, file: !21, line: 249, baseType: !25, size: 64, align: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !20, file: !21, line: 250, baseType: !25, size: 64, align: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !20, file: !21, line: 251, baseType: !25, size: 64, align: 64, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !20, file: !21, line: 252, baseType: !25, size: 64, align: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !20, file: !21, line: 253, baseType: !25, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !20, file: !21, line: 254, baseType: !25, size: 64, align: 64, offset: 512)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !20, file: !21, line: 256, baseType: !25, size: 64, align: 64, offset: 576)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !20, file: !21, line: 257, baseType: !25, size: 64, align: 64, offset: 640)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !20, file: !21, line: 258, baseType: !25, size: 64, align: 64, offset: 704)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !20, file: !21, line: 260, baseType: !37, size: 64, align: 64, offset: 768)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !21, line: 156, size: 192, align: 64, elements: !39)
!39 = !{!40, !41, !43}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !38, file: !21, line: 157, baseType: !37, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !38, file: !21, line: 158, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !38, file: !21, line: 162, baseType: !10, size: 32, align: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !20, file: !21, line: 262, baseType: !42, size: 64, align: 64, offset: 832)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !20, file: !21, line: 264, baseType: !10, size: 32, align: 32, offset: 896)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !20, file: !21, line: 268, baseType: !10, size: 32, align: 32, offset: 928)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !20, file: !21, line: 270, baseType: !48, size: 64, align: 64, offset: 960)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !49, line: 131, baseType: !50)
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/football")
!50 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !20, file: !21, line: 274, baseType: !52, size: 16, align: 16, offset: 1024)
!52 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !20, file: !21, line: 275, baseType: !54, size: 8, align: 8, offset: 1040)
!54 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !20, file: !21, line: 276, baseType: !56, size: 8, align: 8, offset: 1048)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, align: 8, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 1)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !20, file: !21, line: 280, baseType: !60, size: 64, align: 64, offset: 1088)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !21, line: 150, baseType: null)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !20, file: !21, line: 289, baseType: !63, size: 64, align: 64, offset: 1152)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !49, line: 132, baseType: !50)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !20, file: !21, line: 297, baseType: !65, size: 64, align: 64, offset: 1216)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !20, file: !21, line: 298, baseType: !65, size: 64, align: 64, offset: 1280)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !20, file: !21, line: 299, baseType: !65, size: 64, align: 64, offset: 1344)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !20, file: !21, line: 300, baseType: !65, size: 64, align: 64, offset: 1408)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !20, file: !21, line: 302, baseType: !70, size: 64, align: 64, offset: 1472)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !71, line: 62, baseType: !72)
!71 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/football")
!72 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !20, file: !21, line: 303, baseType: !10, size: 32, align: 32, offset: 1536)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !20, file: !21, line: 305, baseType: !75, size: 160, align: 8, offset: 1568)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, align: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 20)
!78 = !DISubprogram(name: "compute_team_info", scope: !7, file: !7, line: 105, type: !79, isLocal: false, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @compute_team_info, variables: !2)
!79 = !DISubroutineType(types: !80)
!80 = !{null}
!81 = !DISubprogram(name: "read_sched_into", scope: !7, file: !7, line: 258, type: !82, isLocal: false, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct._IO_FILE*, [15 x [3 x i32]]*)* @read_sched_into, variables: !2)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !17, !84}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1440, align: 32, elements: !86)
!86 = !{!87, !88}
!87 = !DISubrange(count: 15)
!88 = !DISubrange(count: 3)
!89 = !DISubprogram(name: "save_scores", scope: !7, file: !7, line: 345, type: !90, isLocal: false, isDefinition: true, scopeLine: 345, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct._IO_FILE*, i8*)* @save_scores, variables: !2)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !17, !25}
!92 = !DISubprogram(name: "main", scope: !7, file: !7, line: 367, type: !93, isLocal: false, isDefinition: true, scopeLine: 367, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !2)
!93 = !DISubroutineType(types: !94)
!94 = !{!10, !10, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!96 = !{!97, !98, !99, !105, !110, !111, !112, !113, !117, !118, !119, !124, !129, !144, !145, !146, !149, !152, !153, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!97 = !DIGlobalVariable(name: "preseason", scope: !0, file: !7, line: 13, type: !10, isLocal: false, isDefinition: true, variable: i32* @preseason)
!98 = !DIGlobalVariable(name: "terminate", scope: !0, file: !7, line: 16, type: !10, isLocal: false, isDefinition: true, variable: i32* @terminate)
!99 = !DIGlobalVariable(name: "team", scope: !0, file: !7, line: 34, type: !100, isLocal: false, isDefinition: true, variable: [30 x [2 x [15 x i8]]]* @team)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEAM_TYPE", file: !12, line: 31, baseType: !101)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 7200, align: 8, elements: !102)
!102 = !{!103, !104, !87}
!103 = !DISubrange(count: 30)
!104 = !DISubrange(count: 2)
!105 = !DIGlobalVariable(name: "divisions", scope: !0, file: !7, line: 65, type: !106, isLocal: false, isDefinition: true, variable: [29 x [2 x i32]]* @divisions)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIVISION_TYPE", file: !12, line: 60, baseType: !107)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1856, align: 32, elements: !108)
!108 = !{!109, !104}
!109 = !DISubrange(count: 29)
!110 = !DIGlobalVariable(name: "in_fileP", scope: !0, file: !7, line: 365, type: !10, isLocal: false, isDefinition: true, variable: i32* @in_fileP)
!111 = !DIGlobalVariable(name: "num_games", scope: !0, file: !7, line: 14, type: !10, isLocal: false, isDefinition: true, variable: i32* @num_games)
!112 = !DIGlobalVariable(name: "schedule", scope: !0, file: !7, line: 18, type: !17, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @schedule)
!113 = !DIGlobalVariable(name: "inp_sched", scope: !0, file: !7, line: 20, type: !114, isLocal: false, isDefinition: true, variable: [101 x i8]* @inp_sched)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 808, align: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 101)
!117 = !DIGlobalVariable(name: "the_scores", scope: !0, file: !7, line: 22, type: !17, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @the_scores)
!118 = !DIGlobalVariable(name: "input_score", scope: !0, file: !7, line: 24, type: !114, isLocal: false, isDefinition: true, variable: [101 x i8]* @input_score)
!119 = !DIGlobalVariable(name: "sched", scope: !0, file: !7, line: 26, type: !120, isLocal: false, isDefinition: true, variable: [18 x [15 x [3 x i32]]]* @sched)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCHED_TYPE", file: !12, line: 25, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 25920, align: 32, elements: !122)
!122 = !{!123, !87, !88}
!123 = !DISubrange(count: 18)
!124 = !DIGlobalVariable(name: "scores", scope: !0, file: !7, line: 27, type: !125, isLocal: false, isDefinition: true, variable: [19 x [15 x [3 x i32]]]* @scores)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCORES_TYPE", file: !12, line: 28, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 27360, align: 32, elements: !127)
!127 = !{!128, !87, !88}
!128 = !DISubrange(count: 19)
!129 = !DIGlobalVariable(name: "team_info", scope: !0, file: !7, line: 28, type: !130, isLocal: false, isDefinition: true, variable: [29 x %struct.info]* @team_info)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEAMS_STATS", file: !12, line: 42, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 21344, align: 32, elements: !143)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEAM_INFO", file: !12, line: 40, baseType: !133)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "info", file: !12, line: 33, size: 736, align: 32, elements: !134)
!134 = !{!135, !136, !137, !138, !139, !140}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "wins", scope: !133, file: !12, line: 34, baseType: !10, size: 32, align: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "loses", scope: !133, file: !12, line: 35, baseType: !10, size: 32, align: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ties", scope: !133, file: !12, line: 36, baseType: !10, size: 32, align: 32, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "points_for", scope: !133, file: !12, line: 37, baseType: !10, size: 32, align: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "points_against", scope: !133, file: !12, line: 38, baseType: !10, size: 32, align: 32, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !133, file: !12, line: 39, baseType: !141, size: 576, align: 32, offset: 160)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 576, align: 32, elements: !142)
!142 = !{!123}
!143 = !{!109}
!144 = !DIGlobalVariable(name: "team_info_wi_conf", scope: !0, file: !7, line: 28, type: !130, isLocal: false, isDefinition: true, variable: [29 x %struct.info]* @team_info_wi_conf)
!145 = !DIGlobalVariable(name: "team_info_wi_div", scope: !0, file: !7, line: 28, type: !130, isLocal: false, isDefinition: true, variable: [29 x %struct.info]* @team_info_wi_div)
!146 = !DIGlobalVariable(name: "team_plays", scope: !0, file: !7, line: 29, type: !147, isLocal: false, isDefinition: true, variable: [29 x [29 x i32]]* @team_plays)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 26912, align: 32, elements: !148)
!148 = !{!109, !109}
!149 = !DIGlobalVariable(name: "h_to_h_stats", scope: !0, file: !7, line: 30, type: !150, isLocal: false, isDefinition: true, variable: [29 x [29 x %struct.info]]* @h_to_h_stats)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "H_TO_H_STATS", file: !12, line: 43, baseType: !151)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 618976, align: 32, elements: !148)
!152 = !DIGlobalVariable(name: "current_with_disk", scope: !0, file: !7, line: 32, type: !10, isLocal: false, isDefinition: true, variable: i32* @current_with_disk)
!153 = !DIGlobalVariable(name: "standings", scope: !0, file: !7, line: 67, type: !154, isLocal: false, isDefinition: true, variable: [29 x i32]* @standings)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ORDERING", file: !12, line: 62, baseType: !155)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 928, align: 32, elements: !143)
!156 = !DIGlobalVariable(name: "conf_standings", scope: !0, file: !7, line: 67, type: !154, isLocal: false, isDefinition: true, variable: [29 x i32]* @conf_standings)
!157 = !DIGlobalVariable(name: "abs_standings", scope: !0, file: !7, line: 67, type: !154, isLocal: false, isDefinition: true, variable: [29 x i32]* @abs_standings)
!158 = !DIGlobalVariable(name: "defence_ranks", scope: !0, file: !7, line: 68, type: !154, isLocal: false, isDefinition: true, variable: [29 x i32]* @defence_ranks)
!159 = !DIGlobalVariable(name: "defence_ranks_nfl", scope: !0, file: !7, line: 68, type: !154, isLocal: false, isDefinition: true, variable: [29 x i32]* @defence_ranks_nfl)
!160 = !DIGlobalVariable(name: "offence_ranks", scope: !0, file: !7, line: 69, type: !154, isLocal: false, isDefinition: true, variable: [29 x i32]* @offence_ranks)
!161 = !DIGlobalVariable(name: "offence_ranks_nfl", scope: !0, file: !7, line: 69, type: !154, isLocal: false, isDefinition: true, variable: [29 x i32]* @offence_ranks_nfl)
!162 = !DIGlobalVariable(name: "net_ranks", scope: !0, file: !7, line: 70, type: !154, isLocal: false, isDefinition: true, variable: [29 x i32]* @net_ranks)
!163 = !DIGlobalVariable(name: "net_ranks_nfl", scope: !0, file: !7, line: 70, type: !154, isLocal: false, isDefinition: true, variable: [29 x i32]* @net_ranks_nfl)
!164 = !DIGlobalVariable(name: "nfc_east_champ", scope: !0, file: !7, line: 72, type: !11, isLocal: false, isDefinition: true, variable: i32* @nfc_east_champ)
!165 = !DIGlobalVariable(name: "nfc_central_champ", scope: !0, file: !7, line: 72, type: !11, isLocal: false, isDefinition: true, variable: i32* @nfc_central_champ)
!166 = !DIGlobalVariable(name: "nfc_west_champ", scope: !0, file: !7, line: 72, type: !11, isLocal: false, isDefinition: true, variable: i32* @nfc_west_champ)
!167 = !DIGlobalVariable(name: "afc_east_champ", scope: !0, file: !7, line: 73, type: !11, isLocal: false, isDefinition: true, variable: i32* @afc_east_champ)
!168 = !DIGlobalVariable(name: "afc_central_champ", scope: !0, file: !7, line: 73, type: !11, isLocal: false, isDefinition: true, variable: i32* @afc_central_champ)
