; ModuleID = 'result.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }


!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "BYTE", file: !4, line: 18, baseType: !12)
!12 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !{!16, !23, !32, !37, !41}
!16 = !DISubprogram(name: "updateCRC32", scope: !17, file: !17, line: 119, type: !18, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false, function: i64 (i8, i64)* @updateCRC32, variables: !22)
!17 = !DIFile(filename: "/home/gleison/tf/Benchmarks/MiBench/telecomm-CRC32/tmp.c", directory: "/home/gleison/tf/Benchmarks/MiBench/telecomm-CRC32")
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !12, !20}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "DWORD", file: !4, line: 19, baseType: !21)
!21 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!22 = !{}
!23 = !DISubprogram(name: "crc32file", scope: !17, file: !17, line: 123, type: !24, isLocal: false, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i8*, i64*, i64*)* @crc32file, variables: !22)
!24 = !DISubroutineType(types: !25)
!25 = !{!26, !27, !29, !30}
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean_T", file: !4, line: 13, baseType: !3)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!32 = !DISubprogram(name: "crc32buf", scope: !17, file: !17, line: 155, type: !33, isLocal: false, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: false, function: i64 (i8*, i64)* @crc32buf, variables: !22)
!33 = !DISubroutineType(types: !34)
!34 = !{!20, !27, !35}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !36, line: 62, baseType: !21)
!36 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/tf/Benchmarks/MiBench/telecomm-CRC32")
!37 = !DISubprogram(name: "main", scope: !17, file: !17, line: 172, type: !38, isLocal: false, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !22)
!38 = !DISubroutineType(types: !39)
!39 = !{!14, !14, !40}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!41 = !DISubprogram(name: "mybasename", scope: !17, file: !17, line: 167, type: !42, isLocal: true, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: false, function: i8* (i8*)* @mybasename, variables: !22)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !44}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!46 = !{!47}
!47 = !DIGlobalVariable(name: "crc_32_tab", scope: !0, file: !17, line: 74, type: !48, isLocal: true, isDefinition: true, variable: [256 x i64]* @crc_32_tab)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 16384, align: 64, elements: !50)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "UNS_32_BITS", file: !17, line: 26, baseType: !20)
!50 = !{!51}
!51 = !DISubrange(count: 256)
!52 = !{i32 2, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ch", arg: 1, scope: !16, file: !17, line: 119, type: !12)
!56 = !DIExpression()
!57 = !DILocation(line: 119, column: 33, scope: !16)
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "crc", arg: 2, scope: !16, file: !17, line: 119, type: !20)
!59 = !DILocation(line: 119, column: 43, scope: !16)
!60 = !DILocation(line: 120, column: 10, scope: !16)
!61 = !DILocation(line: 120, column: 3, scope: !16)
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !23, file: !17, line: 123, type: !27)
!63 = !DILocation(line: 123, column: 27, scope: !23)
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "crc", arg: 2, scope: !23, file: !17, line: 123, type: !29)
!65 = !DILocation(line: 123, column: 40, scope: !23)
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "charcnt", arg: 3, scope: !23, file: !17, line: 123, type: !30)
!67 = !DILocation(line: 123, column: 51, scope: !23)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldcrc32", scope: !23, file: !17, line: 125, type: !20)
!69 = !DILocation(line: 125, column: 18, scope: !23)
!70 = !DILocation(line: 129, column: 12, scope: !23)
!71 = !DILocation(line: 133, column: 14, scope: !72)
!72 = distinct !DILexicalBlock(scope: !23, file: !17, line: 133, column: 7)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fin", scope: !23, file: !17, line: 124, type: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !76, line: 48, baseType: !77)
!76 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/tf/Benchmarks/MiBench/telecomm-CRC32")
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !78, line: 241, size: 1728, align: 64, elements: !79)
!78 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/tf/Benchmarks/MiBench/telecomm-CRC32")
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !100, !101, !102, !103, !106, !108, !110, !114, !117, !119, !120, !121, !122, !123, !124, !125}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !77, file: !78, line: 242, baseType: !14, size: 32, align: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !77, file: !78, line: 247, baseType: !27, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !77, file: !78, line: 248, baseType: !27, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !77, file: !78, line: 249, baseType: !27, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !77, file: !78, line: 250, baseType: !27, size: 64, align: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !77, file: !78, line: 251, baseType: !27, size: 64, align: 64, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !77, file: !78, line: 252, baseType: !27, size: 64, align: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !77, file: !78, line: 253, baseType: !27, size: 64, align: 64, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !77, file: !78, line: 254, baseType: !27, size: 64, align: 64, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !77, file: !78, line: 256, baseType: !27, size: 64, align: 64, offset: 576)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !77, file: !78, line: 257, baseType: !27, size: 64, align: 64, offset: 640)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !77, file: !78, line: 258, baseType: !27, size: 64, align: 64, offset: 704)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !77, file: !78, line: 260, baseType: !93, size: 64, align: 64, offset: 768)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !78, line: 156, size: 192, align: 64, elements: !95)
!95 = !{!96, !97, !99}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !94, file: !78, line: 157, baseType: !93, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !94, file: !78, line: 158, baseType: !98, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !94, file: !78, line: 162, baseType: !14, size: 32, align: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !77, file: !78, line: 262, baseType: !98, size: 64, align: 64, offset: 832)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !77, file: !78, line: 264, baseType: !14, size: 32, align: 32, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !77, file: !78, line: 268, baseType: !14, size: 32, align: 32, offset: 928)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !77, file: !78, line: 270, baseType: !104, size: 64, align: 64, offset: 960)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !105, line: 131, baseType: !31)
!105 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/tf/Benchmarks/MiBench/telecomm-CRC32")
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !77, file: !78, line: 274, baseType: !107, size: 16, align: 16, offset: 1024)
!107 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !77, file: !78, line: 275, baseType: !109, size: 8, align: 8, offset: 1040)
!109 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !77, file: !78, line: 276, baseType: !111, size: 8, align: 8, offset: 1048)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8, align: 8, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 1)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !77, file: !78, line: 280, baseType: !115, size: 64, align: 64, offset: 1088)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !78, line: 150, baseType: null)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !77, file: !78, line: 289, baseType: !118, size: 64, align: 64, offset: 1152)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !105, line: 132, baseType: !31)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !77, file: !78, line: 297, baseType: !13, size: 64, align: 64, offset: 1216)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !77, file: !78, line: 298, baseType: !13, size: 64, align: 64, offset: 1280)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !77, file: !78, line: 299, baseType: !13, size: 64, align: 64, offset: 1344)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !77, file: !78, line: 300, baseType: !13, size: 64, align: 64, offset: 1408)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !77, file: !78, line: 302, baseType: !35, size: 64, align: 64, offset: 1472)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !77, file: !78, line: 303, baseType: !14, size: 32, align: 32, offset: 1536)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !77, file: !78, line: 305, baseType: !126, size: 160, align: 8, offset: 1568)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 160, align: 8, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 20)
!129 = !DILocation(line: 124, column: 18, scope: !23)
!130 = !DILocation(line: 133, column: 32, scope: !72)
!131 = !DILocation(line: 133, column: 7, scope: !23)
!132 = !DILocation(line: 136, column: 5, scope: !133)
!133 = distinct !DILexicalBlock(scope: !72, file: !17, line: 135, column: 3)
!134 = !DILocation(line: 137, column: 5, scope: !133)
!135 = !DILocation(line: 139, column: 3, scope: !23)
!136 = !DILocation(line: 139, column: 15, scope: !137)
!137 = !DILexicalBlockFile(scope: !138, file: !17, discriminator: 2)
!138 = !DILexicalBlockFile(scope: !23, file: !17, discriminator: 1)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !23, file: !17, line: 126, type: !14)
!140 = !DILocation(line: 126, column: 16, scope: !23)
!141 = !DILocation(line: 139, column: 26, scope: !23)
!142 = !DILocation(line: 140, column: 5, scope: !143)
!143 = distinct !DILexicalBlock(scope: !23, file: !17, line: 139, column: 34)
!144 = !DILocation(line: 141, column: 16, scope: !143)
!145 = !DILocation(line: 144, column: 7, scope: !146)
!146 = distinct !DILexicalBlock(scope: !23, file: !17, line: 144, column: 7)
!147 = !DILocation(line: 144, column: 7, scope: !23)
!148 = !DILocation(line: 145, column: 5, scope: !149)
!149 = distinct !DILexicalBlock(scope: !146, file: !17, line: 144, column: 20)
!150 = !DILocation(line: 146, column: 14, scope: !149)
!151 = !DILocation(line: 147, column: 3, scope: !149)
!152 = !DILocation(line: 148, column: 3, scope: !23)
!153 = !DILocation(line: 150, column: 21, scope: !23)
!154 = !DILocation(line: 150, column: 8, scope: !23)
!155 = !DILocation(line: 152, column: 3, scope: !23)
!156 = !DILocation(line: 153, column: 1, scope: !23)
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 1, scope: !32, file: !17, line: 155, type: !27)
!158 = !DILocation(line: 155, column: 22, scope: !32)
!159 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !32, file: !17, line: 155, type: !35)
!160 = !DILocation(line: 155, column: 34, scope: !32)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldcrc32", scope: !32, file: !17, line: 156, type: !20)
!162 = !DILocation(line: 156, column: 18, scope: !32)
!163 = !DILocation(line: 160, column: 3, scope: !32)
!164 = !DILocation(line: 160, column: 3, scope: !165)
!165 = distinct !DILexicalBlock(scope: !32, file: !17, line: 160, column: 3)
!166 = !DILocation(line: 161, column: 16, scope: !167)
!167 = distinct !DILexicalBlock(scope: !168, file: !17, line: 160, column: 29)
!168 = distinct !DILexicalBlock(scope: !165, file: !17, line: 160, column: 3)
!169 = !DILocation(line: 162, column: 3, scope: !167)
!170 = !DILocation(line: 160, column: 15, scope: !168)
!171 = !DILocation(line: 160, column: 22, scope: !168)
!172 = !DILocation(line: 160, column: 3, scope: !168)
!173 = !DILocation(line: 164, column: 10, scope: !32)
!174 = !DILocation(line: 164, column: 3, scope: !32)
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !37, file: !17, line: 172, type: !14)
!176 = !DILocation(line: 172, column: 14, scope: !37)
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !37, file: !17, line: 172, type: !40)
!178 = !DILocation(line: 172, column: 26, scope: !37)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "crc", scope: !37, file: !17, line: 173, type: !20)
!180 = !DILocation(line: 173, column: 9, scope: !37)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "charcnt", scope: !37, file: !17, line: 174, type: !31)
!182 = !DILocation(line: 174, column: 8, scope: !37)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !37, file: !17, line: 175, type: !14)
