; ModuleID = '/home/gleison/tf/Benchmarks/TSVC/ControlFlow-dbl/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GlobalData = type { [32000 x double], [3 x i32], [20 x i8], [32000 x double], [5 x i32], [12 x i8], [32000 x double], [7 x i32], [32000 x double], [11 x i32], [20 x i8], [32000 x double], [13 x i32], [12 x i8], [256 x [256 x double]], [17 x i32], [28 x i8], [256 x [256 x double]], [19 x i32], [20 x i8], [256 x [256 x double]], [23 x i32], [256 x [256 x double]] }

@global_data = common global %struct.GlobalData zeroinitializer, align 32
@a = constant double* getelementptr inbounds (%struct.GlobalData, %struct.GlobalData* @global_data, i32 0, i32 0, i32 0), align 32
@b = constant double* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 256032) to double*), align 32
@c = constant double* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 512064) to double*), align 32
@d = constant double* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 768096) to double*), align 32
@e = constant double* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 1024160) to double*), align 32
@aa = constant [256 x double]* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 1280224) to [256 x double]*), align 32

!56 = !DISubprogram(name: "s2711", scope: !9, file: !9, line: 3174, type: !36, isLocal: false, isDefinition: true, scopeLine: 3175, isOptimized: false, function: i32 ()* @s2711, variables: !2)
!57 = !DISubprogram(name: "s2712", scope: !9, file: !9, line: 3202, type: !36, isLocal: false, isDefinition: true, scopeLine: 3203, isOptimized: false, function: i32 ()* @s2712, variables: !2)
!58 = !DISubprogram(name: "s441", scope: !9, file: !9, line: 4604, type: !36, isLocal: false, isDefinition: true, scopeLine: 4605, isOptimized: false, function: i32 ()* @s441, variables: !2)
!59 = !DISubprogram(name: "s442", scope: !9, file: !9, line: 4637, type: !36, isLocal: false, isDefinition: true, scopeLine: 4638, isOptimized: false, function: i32 ()* @s442, variables: !2)
!60 = !DISubprogram(name: "s443", scope: !9, file: !9, line: 4682, type: !36, isLocal: false, isDefinition: true, scopeLine: 4683, isOptimized: false, function: i32 ()* @s443, variables: !2)
!61 = !DISubprogram(name: "s481", scope: !9, file: !9, line: 4856, type: !36, isLocal: false, isDefinition: true, scopeLine: 4857, isOptimized: false, function: i32 ()* @s481, variables: !2)
!62 = !DISubprogram(name: "s482", scope: !9, file: !9, line: 4887, type: !36, isLocal: false, isDefinition: true, scopeLine: 4888, isOptimized: false, function: i32 ()* @s482, variables: !2)
!63 = !DISubprogram(name: "min", scope: !9, file: !9, line: 4916, type: !64, isLocal: false, isDefinition: true, scopeLine: 4916, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i32)* @min, variables: !2)
!64 = !DISubroutineType(types: !65)
!65 = !{!12, !12, !12}
!66 = !DISubprogram(name: "set", scope: !9, file: !9, line: 5543, type: !67, isLocal: false, isDefinition: true, scopeLine: 5543, flags: DIFlagPrototyped, isOptimized: false, function: void (i32*, double*, double*)* @set, variables: !2)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !69, !13, !13}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!70 = !DISubprogram(name: "main", scope: !9, file: !9, line: 5572, type: !71, isLocal: false, isDefinition: true, scopeLine: 5572, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !2)
!71 = !DISubroutineType(types: !72)
!72 = !{!12, !12, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!74 = !{!75, !77, !78, !79, !80, !81, !83, !84, !85, !86, !90, !91, !92, !93, !94, !98, !99, !100, !101, !147, !149, !151, !152, !153}
!75 = !DIGlobalVariable(name: "a", scope: !0, file: !9, line: 100, type: !76, isLocal: false, isDefinition: true, variable: double** @a)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!77 = !DIGlobalVariable(name: "b", scope: !0, file: !9, line: 101, type: !76, isLocal: false, isDefinition: true, variable: double** @b)
!78 = !DIGlobalVariable(name: "c", scope: !0, file: !9, line: 102, type: !76, isLocal: false, isDefinition: true, variable: double** @c)
!79 = !DIGlobalVariable(name: "d", scope: !0, file: !9, line: 103, type: !76, isLocal: false, isDefinition: true, variable: double** @d)
!80 = !DIGlobalVariable(name: "e", scope: !0, file: !9, line: 104, type: !76, isLocal: false, isDefinition: true, variable: double** @e)
!81 = !DIGlobalVariable(name: "aa", scope: !0, file: !9, line: 105, type: !82, isLocal: false, isDefinition: true, variable: [256 x double]** @aa)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!83 = !DIGlobalVariable(name: "bb", scope: !0, file: !9, line: 106, type: !82, isLocal: false, isDefinition: true, variable: [256 x double]** @bb)
!84 = !DIGlobalVariable(name: "cc", scope: !0, file: !9, line: 107, type: !82, isLocal: false, isDefinition: true, variable: [256 x double]** @cc)
!85 = !DIGlobalVariable(name: "tt", scope: !0, file: !9, line: 108, type: !82, isLocal: false, isDefinition: true, variable: [256 x double]** @tt)
!86 = !DIGlobalVariable(name: "X", scope: !0, file: !9, line: 59, type: !87, isLocal: false, isDefinition: true, variable: [32000 x double]* @X)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048000, align: 64, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 32000)
!90 = !DIGlobalVariable(name: "Y", scope: !0, file: !9, line: 59, type: !87, isLocal: false, isDefinition: true, variable: [32000 x double]* @Y)
!91 = !DIGlobalVariable(name: "Z", scope: !0, file: !9, line: 59, type: !87, isLocal: false, isDefinition: true, variable: [32000 x double]* @Z)
!92 = !DIGlobalVariable(name: "U", scope: !0, file: !9, line: 59, type: !87, isLocal: false, isDefinition: true, variable: [32000 x double]* @U)
!93 = !DIGlobalVariable(name: "V", scope: !0, file: !9, line: 59, type: !87, isLocal: false, isDefinition: true, variable: [32000 x double]* @V)
!94 = !DIGlobalVariable(name: "array", scope: !0, file: !9, line: 63, type: !95, isLocal: false, isDefinition: true, variable: [65536 x double]* @array)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4194304, align: 64, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 65536)
!98 = !DIGlobalVariable(name: "x", scope: !0, file: !9, line: 65, type: !87, isLocal: false, isDefinition: true, variable: [32000 x double]* @x)
!99 = !DIGlobalVariable(name: "temp", scope: !0, file: !9, line: 66, type: !4, isLocal: false, isDefinition: true, variable: double* @temp)
!100 = !DIGlobalVariable(name: "temp_int", scope: !0, file: !9, line: 67, type: !12, isLocal: false, isDefinition: true, variable: i32* @temp_int)
!101 = !DIGlobalVariable(name: "global_data", scope: !0, file: !9, line: 98, type: !102, isLocal: false, isDefinition: true, variable: %struct.GlobalData* @global_data)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalData", file: !9, line: 79, size: 27021312, align: 256, elements: !103)
!103 = !{!104, !105, !109, !110, !114, !115, !119, !120, !124, !125, !129, !132, !136, !137, !141, !142, !146}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !102, file: !9, line: 80, baseType: !87, size: 2048000, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !102, file: !9, line: 81, baseType: !106, size: 96, align: 32, offset: 2048000)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 96, align: 32, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 3)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !102, file: !9, line: 82, baseType: !87, size: 2048000, align: 64, offset: 2048256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !102, file: !9, line: 83, baseType: !111, size: 160, align: 32, offset: 4096256)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, align: 32, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 5)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !102, file: !9, line: 84, baseType: !87, size: 2048000, align: 64, offset: 4096512)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !102, file: !9, line: 85, baseType: !116, size: 224, align: 32, offset: 6144512)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 224, align: 32, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 7)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !102, file: !9, line: 86, baseType: !87, size: 2048000, align: 64, offset: 6144768)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !102, file: !9, line: 87, baseType: !121, size: 352, align: 32, offset: 8192768)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 352, align: 32, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 11)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !102, file: !9, line: 88, baseType: !87, size: 2048000, align: 64, offset: 8193280)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !102, file: !9, line: 90, baseType: !126, size: 416, align: 32, offset: 10241280)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 416, align: 32, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 13)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !102, file: !9, line: 91, baseType: !130, size: 4194304, align: 64, offset: 10241792)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4194304, align: 64, elements: !131)
!131 = !{!23, !23}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "pad6", scope: !102, file: !9, line: 92, baseType: !133, size: 544, align: 32, offset: 14436096)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 544, align: 32, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 17)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !102, file: !9, line: 93, baseType: !130, size: 4194304, align: 64, offset: 14436864)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "pad7", scope: !102, file: !9, line: 94, baseType: !138, size: 608, align: 32, offset: 18631168)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 608, align: 32, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 19)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "cc", scope: !102, file: !9, line: 95, baseType: !130, size: 4194304, align: 64, offset: 18631936)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pad8", scope: !102, file: !9, line: 96, baseType: !143, size: 736, align: 32, offset: 22826240)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 736, align: 32, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 23)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !102, file: !9, line: 97, baseType: !130, size: 4194304, align: 64, offset: 22827008)
!147 = !DIGlobalVariable(name: "indx", scope: !0, file: !9, line: 110, type: !148, isLocal: false, isDefinition: true, variable: [32000 x i32]* @indx)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 1024000, align: 32, elements: !88)
!149 = !DIGlobalVariable(name: "xx", scope: !0, file: !9, line: 113, type: !150, isLocal: false, isDefinition: true, variable: double** @xx)
!150 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !13)
!151 = !DIGlobalVariable(name: "yy", scope: !0, file: !9, line: 114, type: !13, isLocal: false, isDefinition: true, variable: double** @yy)
!152 = !DIGlobalVariable(name: "digits", scope: !0, file: !9, line: 40, type: !12, isLocal: true, isDefinition: true, variable: i32* @digits)
!153 = !DIGlobalVariable(name: "ntimes", scope: !0, file: !9, line: 39, type: !12, isLocal: true, isDefinition: true, variable: i32* @ntimes)
!154 = !{i32 2, !"Dwarf Version", i32 4}
!155 = !{i32 2, !"Debug Info Version", i32 3}
!156 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arr", arg: 1, scope: !8, file: !9, line: 120, type: !13)
!158 = !DIExpression()
!159 = !DILocation(line: 120, column: 16, scope: !8)
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !8, file: !9, line: 120, type: !4)
!161 = !DILocation(line: 120, column: 31, scope: !8)
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stride", arg: 3, scope: !8, file: !9, line: 120, type: !12)
!163 = !DILocation(line: 120, column: 42, scope: !8)
!164 = !DILocation(line: 122, column: 6, scope: !165)
!165 = distinct !DILexicalBlock(scope: !8, file: !9, line: 122, column: 6)
!166 = !DILocation(line: 122, column: 13, scope: !165)
!167 = !DILocation(line: 122, column: 6, scope: !8)
!168 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !169, file: !9, line: 123, type: !12)
!169 = distinct !DILexicalBlock(scope: !170, file: !9, line: 123, column: 3)
!170 = distinct !DILexicalBlock(scope: !165, file: !9, line: 122, column: 20)
!171 = !DILocation(line: 123, column: 12, scope: !169)
!172 = !DILocation(line: 123, column: 8, scope: !169)
!173 = !DILocation(line: 123, column: 19, scope: !174)
!174 = !DILexicalBlockFile(scope: !175, file: !9, discriminator: 2)
!175 = !DILexicalBlockFile(scope: !176, file: !9, discriminator: 1)
!176 = distinct !DILexicalBlock(scope: !169, file: !9, line: 123, column: 3)
!177 = !DILocation(line: 123, column: 21, scope: !176)
!178 = !DILocation(line: 123, column: 3, scope: !169)
!179 = !DILocation(line: 124, column: 26, scope: !180)
!180 = distinct !DILexicalBlock(scope: !176, file: !9, line: 123, column: 33)
!181 = !DILocation(line: 124, column: 27, scope: !180)
!182 = !DILocation(line: 124, column: 18, scope: !180)
!183 = !DILocation(line: 124, column: 16, scope: !180)
!184 = !DILocation(line: 124, column: 8, scope: !180)
!185 = !DILocation(line: 124, column: 4, scope: !180)
!186 = !DILocation(line: 124, column: 11, scope: !180)
!187 = !DILocation(line: 125, column: 3, scope: !180)
!188 = !DILocation(line: 123, column: 29, scope: !176)
!189 = !DILocation(line: 123, column: 3, scope: !176)
!190 = !DILocation(line: 126, column: 2, scope: !170)
!191 = !DILocation(line: 126, column: 13, scope: !192)
!192 = distinct !DILexicalBlock(scope: !165, file: !9, line: 126, column: 13)
!193 = !DILocation(line: 126, column: 20, scope: !192)
!194 = !DILocation(line: 126, column: 13, scope: !165)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !196, file: !9, line: 127, type: !12)
!196 = distinct !DILexicalBlock(scope: !197, file: !9, line: 127, column: 3)
!197 = distinct !DILexicalBlock(scope: !192, file: !9, line: 126, column: 27)
!198 = !DILocation(line: 127, column: 12, scope: !196)
!199 = !DILocation(line: 127, column: 8, scope: !196)
