; ModuleID = 'result.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.HPointStruct = type { double, double, double, double }
%struct.ObjPointStruct = type { double, double, double, double, double, double }

@.str = private unnamed_addr constant [30 x i8] c" [[ %.2f, %.2f, %.2f, %.2f] \0A\00", align 1
@.str.1 = private unnamed_addr constant [30 x i8] c"  [ %.2f, %.2f, %.2f, %.2f] \0A\00", align 1
@.str.2 = private unnamed_addr constant [30 x i8] c"  [ %.2f, %.2f, %.2f, %.2f]]\0A\00", align 1

; Function Attrs: nounwind uwtable
define void @MultMatrixMatrix([4 x [4 x double]]* %A, [4 x [4 x double]]* %B, [4 x [4 x double]]* %C) #0 {
entry:
  call void @llvm.dbg.value(metadata [4 x [4 x double]]* %A, i64 0, metadata !59, metadata !60), !dbg !61
  call void @llvm.dbg.value(metadata [4 x [4 x double]]* %B, i64 0, metadata !62, metadata !60), !dbg !63
  call void @llvm.dbg.value(metadata [4 x [4 x double]]* %C, i64 0, metadata !64, metadata !60), !dbg !65
  call void @llvm.dbg.value(metadata i32 0, i64 0, metadata !66, metadata !60), !dbg !68
  call void @llvm.dbg.value(metadata i32 0, i64 0, metadata !69, metadata !60), !dbg !70
  call void @llvm.dbg.value(metadata i32 0, i64 0, metadata !71, metadata !60), !dbg !72
  call void @llvm.dbg.value(metadata i32 0, i64 0, metadata !66, metadata !60), !dbg !68
  %C24 = ptrtoint [4 x [4 x double]]* %C to i64
  %0 = ptrtoint [4 x [4 x double]]* %B to i64

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/McCat/08-main")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !17, !27, !30, !33, !36, !37, !38, !50}
!6 = !DISubprogram(name: "MultMatrixMatrix", scope: !7, file: !7, line: 21, type: !8, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, function: void ([4 x [4 x double]]*, [4 x [4 x double]]*, [4 x [4 x double]]*)* @MultMatrixMatrix, variables: !2)
!7 = !DIFile(filename: "/home/gleison/tf/Benchmarks/McCat/08-main/tmp.c", directory: "/home/gleison/tf/Benchmarks/McCat/08-main")
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10, !10, !10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix", file: !12, line: 37, baseType: !13)
!12 = !DIFile(filename: "./types.h", directory: "/home/gleison/tf/Benchmarks/McCat/08-main")
!13 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 1024, align: 64, elements: !15)
!14 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!15 = !{!16, !16}
!16 = !DISubrange(count: 4)
!17 = !DISubprogram(name: "MultMatrixHPoint", scope: !7, file: !7, line: 34, type: !18, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.HPointStruct*, [4 x [4 x double]]*, %struct.HPointStruct*)* @MultMatrixHPoint, variables: !2)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !10, !20}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "HPoint", file: !12, line: 29, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "HPointStruct", file: !12, line: 23, size: 256, align: 64, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !21, file: !12, line: 25, baseType: !14, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !21, file: !12, line: 26, baseType: !14, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !21, file: !12, line: 27, baseType: !14, size: 64, align: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !21, file: !12, line: 28, baseType: !14, size: 64, align: 64, offset: 192)
!27 = !DISubprogram(name: "CopyMatrix", scope: !7, file: !7, line: 48, type: !28, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, function: [4 x [4 x double]]* ([4 x [4 x double]]*)* @CopyMatrix, variables: !2)
!28 = !DISubroutineType(types: !29)
!29 = !{!10, !10}
!30 = !DISubprogram(name: "IdentMatrix", scope: !7, file: !7, line: 62, type: !31, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, function: [4 x [4 x double]]* ()* @IdentMatrix, variables: !2)
!31 = !DISubroutineType(types: !32)
!32 = !{!10}
!33 = !DISubprogram(name: "TranslateMatrix", scope: !7, file: !7, line: 75, type: !34, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false, function: [4 x [4 x double]]* (double, double, double)* @TranslateMatrix, variables: !2)
!34 = !DISubroutineType(types: !35)
!35 = !{!10, !14, !14, !14}
!36 = !DISubprogram(name: "RotateMatrix", scope: !7, file: !7, line: 83, type: !34, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false, function: [4 x [4 x double]]* (double, double, double)* @RotateMatrix, variables: !2)
!37 = !DISubprogram(name: "ScaleMatrix", scope: !7, file: !7, line: 124, type: !34, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: false, function: [4 x [4 x double]]* (double, double, double)* @ScaleMatrix, variables: !2)
!38 = !DISubprogram(name: "RotatePoint", scope: !7, file: !7, line: 133, type: !39, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.ObjPointStruct*, %struct.ObjPointStruct*, double, double, double)* @RotatePoint, variables: !2)
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !41, !14, !14, !14}
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjPoint", file: !12, line: 21, baseType: !42)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjPointStruct", file: !12, line: 13, size: 384, align: 64, elements: !43)
!43 = !{!44, !45, !46, !47, !48, !49}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !42, file: !12, line: 15, baseType: !14, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !42, file: !12, line: 16, baseType: !14, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !42, file: !12, line: 17, baseType: !14, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tx", scope: !42, file: !12, line: 18, baseType: !14, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !42, file: !12, line: 19, baseType: !14, size: 64, align: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tz", scope: !42, file: !12, line: 20, baseType: !14, size: 64, align: 64, offset: 320)
!50 = !DISubprogram(name: "PrintMatrix", scope: !7, file: !7, line: 142, type: !51, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false, function: void ([4 x double]*)* @PrintMatrix, variables: !2)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !53}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, align: 64, elements: !55)
!55 = !{!16}
!56 = !{i32 2, !"Dwarf Version", i32 4}
!57 = !{i32 2, !"Debug Info Version", i32 3}
!58 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "A", arg: 1, scope: !6, file: !7, line: 21, type: !10)
!60 = !DIExpression()
!61 = !DILocation(line: 21, column: 31, scope: !6)
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "B", arg: 2, scope: !6, file: !7, line: 21, type: !10)
!63 = !DILocation(line: 21, column: 42, scope: !6)
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "C", arg: 3, scope: !6, file: !7, line: 21, type: !10)
!65 = !DILocation(line: 21, column: 53, scope: !6)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !6, file: !7, line: 22, type: !67)
!67 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!68 = !DILocation(line: 22, column: 7, scope: !6)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !6, file: !7, line: 22, type: !67)
!70 = !DILocation(line: 22, column: 14, scope: !6)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !6, file: !7, line: 22, type: !67)
!72 = !DILocation(line: 22, column: 21, scope: !6)
!73 = !DILocation(line: 23, column: 3, scope: !74)
!74 = distinct !DILexicalBlock(scope: !6, file: !7, line: 23, column: 3)
!75 = !DILocation(line: 24, column: 5, scope: !76)
!76 = distinct !DILexicalBlock(scope: !77, file: !7, line: 24, column: 5)
!77 = distinct !DILexicalBlock(scope: !78, file: !7, line: 23, column: 27)
!78 = distinct !DILexicalBlock(scope: !74, file: !7, line: 23, column: 3)
!79 = !DILocation(line: 26, column: 7, scope: !80)
!80 = distinct !DILexicalBlock(scope: !81, file: !7, line: 26, column: 7)
!81 = distinct !DILexicalBlock(scope: !82, file: !7, line: 24, column: 29)
!82 = distinct !DILexicalBlock(scope: !76, file: !7, line: 24, column: 5)
!83 = !DILocation(line: 23, column: 8, scope: !74)
!84 = !DILocation(line: 23, column: 17, scope: !78)
!85 = !DILocation(line: 24, column: 10, scope: !76)
!86 = !DILocation(line: 24, column: 19, scope: !82)
!87 = !DILocation(line: 25, column: 7, scope: !81)
!88 = !DILocation(line: 25, column: 18, scope: !81)
!89 = !DILocation(line: 26, column: 12, scope: !80)
!90 = !DILocation(line: 26, column: 21, scope: !91)
!91 = distinct !DILexicalBlock(scope: !80, file: !7, line: 26, column: 7)
!92 = !DILocation(line: 28, column: 23, scope: !93)
!93 = distinct !DILexicalBlock(scope: !91, file: !7, line: 26, column: 31)
!94 = !DILocation(line: 28, column: 36, scope: !93)
!95 = !DILocation(line: 28, column: 34, scope: !93)
!96 = !DILocation(line: 28, column: 9, scope: !93)
!97 = !DILocation(line: 28, column: 20, scope: !93)
!98 = !DILocation(line: 29, column: 7, scope: !93)
!99 = !DILocation(line: 26, column: 27, scope: !91)
!100 = !DILocation(line: 26, column: 7, scope: !91)
!101 = !DILocation(line: 30, column: 5, scope: !81)
!102 = !DILocation(line: 24, column: 25, scope: !82)
!103 = !DILocation(line: 24, column: 5, scope: !82)
!104 = !DILocation(line: 31, column: 3, scope: !77)
!105 = !DILocation(line: 23, column: 23, scope: !78)
!106 = !DILocation(line: 23, column: 3, scope: !78)
!107 = !DILocation(line: 32, column: 1, scope: !6)
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mat", arg: 1, scope: !17, file: !7, line: 34, type: !10)
!109 = !DILocation(line: 34, column: 33, scope: !17)
