; ModuleID = '/home/gleison/tf/Benchmarks/VersaBench/dbms/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.IndexNode = type { i64, %struct.IndexEntry* }
%struct.IndexEntry = type { %union.anon, %struct.IndexKey, %struct.IndexEntry* }
%union.anon = type { %struct.IndexNode* }
%struct.IndexKey = type { %struct.IndexPoint, %struct.IndexPoint }
%struct.IndexPoint = type { float, float, float, float }
%struct.DataAttribute = type { i64, %struct.DataObjectAttribute, %struct.DataAttribute* }
%struct.DataObjectAttribute = type { %union.anon.0 }
%union.anon.0 = type { i8* }
%struct.DataObject = type { i32, %struct.DataObjectAttribute* }

@query.name = internal global [6 x i8] c"query\00", align 1
@.str = private unnamed_addr constant [5 x i8] c"node\00", align 1
@.str.1 = private unnamed_addr constant [50 x i8] c"/home/gleison/tf/Benchmarks/VersaBench/dbms/tmp.c\00", align 1
@__PRETTY_FUNCTION__.query = private unnamed_addr constant [85 x i8] c"Int query(IndexNode *, IndexKey *, DataAttribute *, Boolean, void (*)(DataObject *))\00", align 1
@.str.2 = private unnamed_addr constant [10 x i8] c"searchKey\00", align 1
@.str.3 = private unnamed_addr constant [51 x i8] c"!(checkValidity != TRUE && checkValidity != FALSE)\00", align 1
@.str.4 = private unnamed_addr constant [32 x i8] c"invalid index key search values\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !11, globals: !84)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/VersaBench/dbms")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 36, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./dataObject.h", directory: "/home/gleison/tf/Benchmarks/VersaBench/dbms")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "SMALL", value: 1)
!7 = !DIEnumerator(name: "MEDIUM", value: 2)
!8 = !DIEnumerator(name: "LARGE", value: 3)
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!11 = !{!12}
!12 = !DISubprogram(name: "query", scope: !13, file: !13, line: 75, type: !14, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, function: i64 (%struct.IndexNode*, %struct.IndexKey*, %struct.DataAttribute*, i8, void (%struct.DataObject*)*)* @query, variables: !83)
!13 = !DIFile(filename: "/home/gleison/tf/Benchmarks/VersaBench/dbms/tmp.c", directory: "/home/gleison/tf/Benchmarks/VersaBench/dbms")
!14 = !DISubroutineType(types: !15)
!15 = !{!16, !19, !70, !71, !79, !80}
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int", file: !17, line: 24, baseType: !18)
!17 = !DIFile(filename: "./dataManagement.h", directory: "/home/gleison/tf/Benchmarks/VersaBench/dbms")
!18 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexNode", file: !21, line: 59, baseType: !22)
!21 = !DIFile(filename: "./index.h", directory: "/home/gleison/tf/Benchmarks/VersaBench/dbms")
!22 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 55, size: 128, align: 64, elements: !23)
!23 = !{!24, !25}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !22, file: !21, line: 57, baseType: !16, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !22, file: !21, line: 58, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "IndexEntry", file: !21, line: 76, size: 384, align: 64, elements: !28)
!28 = !{!29, !55, !69}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !27, file: !21, line: 81, baseType: !30, size: 64, align: 64)
!30 = !DICompositeType(tag: DW_TAG_union_type, scope: !27, file: !21, line: 78, size: 64, align: 64, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !30, file: !21, line: 79, baseType: !19, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "dataObject", scope: !30, file: !21, line: 80, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataObject", file: !4, line: 92, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "DataObject", file: !4, line: 86, size: 128, align: 64, elements: !37)
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !36, file: !4, line: 88, baseType: !39, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataObjectType", file: !4, line: 41, baseType: !3)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !36, file: !4, line: 89, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataObjectAttribute", file: !4, line: 57, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 50, size: 64, align: 64, elements: !44)
!44 = !{!45}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !43, file: !4, line: 56, baseType: !46, size: 64, align: 64)
!46 = !DICompositeType(tag: DW_TAG_union_type, scope: !43, file: !4, line: 52, size: 64, align: 64, elements: !47)
!47 = !{!48, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !46, file: !4, line: 54, baseType: !49, size: 32, align: 32)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "Float", file: !17, line: 25, baseType: !50)
!50 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "nonKey", scope: !46, file: !4, line: 55, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char", file: !17, line: 26, baseType: !54)
!54 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !27, file: !21, line: 83, baseType: !56, size: 256, align: 32, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexKey", file: !57, line: 53, baseType: !58)
!57 = !DIFile(filename: "./indexKey.h", directory: "/home/gleison/tf/Benchmarks/VersaBench/dbms")
!58 = !DICompositeType(tag: DW_TAG_structure_type, file: !57, line: 50, size: 256, align: 32, elements: !59)
!59 = !{!60, !68}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !58, file: !57, line: 51, baseType: !61, size: 128, align: 32)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPoint", file: !57, line: 39, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, file: !57, line: 34, size: 128, align: 32, elements: !63)
!63 = !{!64, !65, !66, !67}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !62, file: !57, line: 35, baseType: !49, size: 32, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !62, file: !57, line: 36, baseType: !49, size: 32, align: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !62, file: !57, line: 37, baseType: !49, size: 32, align: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Z", scope: !62, file: !57, line: 38, baseType: !49, size: 32, align: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !58, file: !57, line: 52, baseType: !61, size: 128, align: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !21, line: 85, baseType: !26, size: 64, align: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataAttribute", file: !4, line: 77, baseType: !73)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "DataAttribute", file: !4, line: 69, size: 192, align: 64, elements: !74)
!74 = !{!75, !76, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !73, file: !4, line: 71, baseType: !16, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !73, file: !4, line: 72, baseType: !42, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !73, file: !4, line: 74, baseType: !78, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !17, line: 27, baseType: !54)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !34}
!83 = !{}
!84 = !{!85}
!85 = !DIGlobalVariable(name: "name", scope: !12, file: !13, line: 81, type: !86, isLocal: true, isDefinition: true, variable: [6 x i8]* @query.name)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 48, align: 8, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 6)
!89 = !{i32 2, !"Dwarf Version", i32 4}
!90 = !{i32 2, !"Debug Info Version", i32 3}
!91 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "node", arg: 1, scope: !12, file: !13, line: 75, type: !19)
!93 = !DIExpression()
!94 = !DILocation(line: 75, column: 22, scope: !12)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "searchKey", arg: 2, scope: !12, file: !13, line: 76, type: !70)
!96 = !DILocation(line: 76, column: 21, scope: !12)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "searchNonKey", arg: 3, scope: !12, file: !13, line: 77, type: !71)
!98 = !DILocation(line: 77, column: 26, scope: !12)
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "checkValidity", arg: 4, scope: !12, file: !13, line: 78, type: !79)
!100 = !DILocation(line: 78, column: 19, scope: !12)
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outputQuery", arg: 5, scope: !12, file: !13, line: 79, type: !80)
!102 = !DILocation(line: 79, column: 18, scope: !12)
!103 = !DILocation(line: 83, column: 3, scope: !12)
!104 = !DILocation(line: 83, column: 3, scope: !105)
!105 = !DILexicalBlockFile(scope: !12, file: !13, discriminator: 1)
!106 = !DILocation(line: 83, column: 3, scope: !107)
!107 = !DILexicalBlockFile(scope: !12, file: !13, discriminator: 2)
!108 = !DILocation(line: 84, column: 3, scope: !12)
!109 = !DILocation(line: 84, column: 3, scope: !105)
!110 = !DILocation(line: 84, column: 3, scope: !107)
!111 = !DILocation(line: 85, column: 3, scope: !12)
!112 = !DILocation(line: 85, column: 3, scope: !105)
!113 = !DILocation(line: 85, column: 3, scope: !114)
!114 = !DILexicalBlockFile(scope: !107, file: !13, discriminator: 4)
!115 = !DILocation(line: 85, column: 3, scope: !116)
!116 = !DILexicalBlockFile(scope: !12, file: !13, discriminator: 3)
!117 = !DILocation(line: 90, column: 7, scope: !118)
!118 = distinct !DILexicalBlock(scope: !12, file: !13, line: 90, column: 7)
!119 = !DILocation(line: 90, column: 21, scope: !118)
!120 = !DILocation(line: 90, column: 7, scope: !12)
!121 = !DILocation(line: 91, column: 23, scope: !122)
!122 = distinct !DILexicalBlock(scope: !123, file: !13, line: 91, column: 9)
!123 = distinct !DILexicalBlock(scope: !118, file: !13, line: 90, column: 30)
!124 = !DILocation(line: 91, column: 9, scope: !122)
!125 = !DILocation(line: 91, column: 34, scope: !122)
!126 = !DILocation(line: 91, column: 9, scope: !123)
!127 = !DILocation(line: 92, column: 7, scope: !128)
!128 = distinct !DILexicalBlock(scope: !122, file: !13, line: 91, column: 44)
!129 = !DILocation(line: 93, column: 7, scope: !128)
!130 = !DILocation(line: 94, column: 7, scope: !128)
!131 = !DILocation(line: 96, column: 30, scope: !132)
!132 = distinct !DILexicalBlock(scope: !122, file: !13, line: 96, column: 14)
!133 = !DILocation(line: 96, column: 14, scope: !132)
!134 = !DILocation(line: 96, column: 44, scope: !132)
!135 = !DILocation(line: 96, column: 14, scope: !122)
!136 = !DILocation(line: 97, column: 7, scope: !137)
!137 = distinct !DILexicalBlock(scope: !132, file: !13, line: 96, column: 54)
!138 = !DILocation(line: 98, column: 7, scope: !137)
!139 = !DILocation(line: 99, column: 7, scope: !137)
!140 = !DILocation(line: 101, column: 3, scope: !123)
