; ModuleID = 'result.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.timeval = type { i64, i64 }
%struct.timezone = type { i32, i32 }

@main.postfix = private unnamed_addr constant [3 x i8] c".c\00", align 1
@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1
@stdin = external global %struct._IO_FILE*, align 8
@.str.1 = private unnamed_addr constant [26 x i8] c"Usage: drop_0XX [infile]\0A\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"%d\0A\00", align 1

; Function Attrs: nounwind uwtable
define i32 @drop_0xx(i8* %in, i8* %out, i64 %size) #0 {
entry:
  call void @llvm.dbg.value(metadata i8* %in, i64 0, metadata !84, metadata !85), !dbg !86
  call void @llvm.dbg.value(metadata i8* %out, i64 0, metadata !87, metadata !85), !dbg !88
  call void @llvm.dbg.value(metadata i64 %size, i64 0, metadata !89, metadata !85), !dbg !90
  %conv = trunc i64 %size to i32, !dbg !91
  call void @llvm.dbg.value(metadata i32 %conv, i64 0, metadata !92, metadata !85), !dbg !93
  call void @llvm.dbg.value(metadata i16 0, i64 0, metadata !94, metadata !85), !dbg !95

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/BitBench/drop3")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !16, !22}
!6 = !DISubprogram(name: "drop_0xx", scope: !7, file: !7, line: 11, type: !8, isLocal: false, isDefinition: true, scopeLine: 11, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i8*, i8*, i64)* @drop_0xx, variables: !2)
!7 = !DIFile(filename: "/home/gleison/tf/Benchmarks/BitBench/drop3/tmp.c", directory: "/home/gleison/tf/Benchmarks/BitBench/drop3")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !11, !11, !13}
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !14, line: 62, baseType: !15)
!14 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/tf/Benchmarks/BitBench/drop3")
!15 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!16 = !DISubprogram(name: "main", scope: !7, file: !7, line: 61, type: !17, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !2)
!17 = !DISubroutineType(types: !18)
!18 = !{!10, !10, !19}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!22 = !DISubprogram(name: "read_data", scope: !7, file: !7, line: 53, type: !23, isLocal: true, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false, function: i64 (%struct._IO_FILE*, i8*)* @read_data, variables: !2)
!23 = !DISubroutineType(types: !24)
!24 = !{!13, !25, !4}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !27, line: 48, baseType: !28)
!27 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/tf/Benchmarks/BitBench/drop3")
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !29, line: 241, size: 1728, align: 64, elements: !30)
!29 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/tf/Benchmarks/BitBench/drop3")
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !51, !52, !53, !54, !58, !60, !62, !66, !69, !71, !72, !73, !74, !75, !76, !77}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !28, file: !29, line: 242, baseType: !10, size: 32, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !28, file: !29, line: 247, baseType: !20, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !28, file: !29, line: 248, baseType: !20, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !28, file: !29, line: 249, baseType: !20, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !28, file: !29, line: 250, baseType: !20, size: 64, align: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !28, file: !29, line: 251, baseType: !20, size: 64, align: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !28, file: !29, line: 252, baseType: !20, size: 64, align: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !28, file: !29, line: 253, baseType: !20, size: 64, align: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !28, file: !29, line: 254, baseType: !20, size: 64, align: 64, offset: 512)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !28, file: !29, line: 256, baseType: !20, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !28, file: !29, line: 257, baseType: !20, size: 64, align: 64, offset: 640)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !28, file: !29, line: 258, baseType: !20, size: 64, align: 64, offset: 704)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !28, file: !29, line: 260, baseType: !44, size: 64, align: 64, offset: 768)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !29, line: 156, size: 192, align: 64, elements: !46)
!46 = !{!47, !48, !50}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !45, file: !29, line: 157, baseType: !44, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !45, file: !29, line: 158, baseType: !49, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !45, file: !29, line: 162, baseType: !10, size: 32, align: 32, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !28, file: !29, line: 262, baseType: !49, size: 64, align: 64, offset: 832)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !28, file: !29, line: 264, baseType: !10, size: 32, align: 32, offset: 896)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !28, file: !29, line: 268, baseType: !10, size: 32, align: 32, offset: 928)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !28, file: !29, line: 270, baseType: !55, size: 64, align: 64, offset: 960)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !56, line: 131, baseType: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/tf/Benchmarks/BitBench/drop3")
!57 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !28, file: !29, line: 274, baseType: !59, size: 16, align: 16, offset: 1024)
!59 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !28, file: !29, line: 275, baseType: !61, size: 8, align: 8, offset: 1040)
!61 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !28, file: !29, line: 276, baseType: !63, size: 8, align: 8, offset: 1048)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, align: 8, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 1)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !28, file: !29, line: 280, baseType: !67, size: 64, align: 64, offset: 1088)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !29, line: 150, baseType: null)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !28, file: !29, line: 289, baseType: !70, size: 64, align: 64, offset: 1152)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !56, line: 132, baseType: !57)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !28, file: !29, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !28, file: !29, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !28, file: !29, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !28, file: !29, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !28, file: !29, line: 302, baseType: !13, size: 64, align: 64, offset: 1472)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !28, file: !29, line: 303, baseType: !10, size: 32, align: 32, offset: 1536)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !28, file: !29, line: 305, baseType: !78, size: 160, align: 8, offset: 1568)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 160, align: 8, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 20)
!81 = !{i32 2, !"Dwarf Version", i32 4}
!82 = !{i32 2, !"Debug Info Version", i32 3}
!83 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "in", arg: 1, scope: !6, file: !7, line: 11, type: !11)
!85 = !DIExpression()
!86 = !DILocation(line: 11, column: 29, scope: !6)
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 2, scope: !6, file: !7, line: 11, type: !11)
!88 = !DILocation(line: 11, column: 48, scope: !6)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 3, scope: !6, file: !7, line: 11, type: !13)
!90 = !DILocation(line: 11, column: 60, scope: !6)
!91 = !DILocation(line: 12, column: 14, scope: !6)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left", scope: !6, file: !7, line: 12, type: !10)
!93 = !DILocation(line: 12, column: 7, scope: !6)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ibuf", scope: !6, file: !7, line: 13, type: !59)
!95 = !DILocation(line: 13, column: 18, scope: !6)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obuf", scope: !6, file: !7, line: 14, type: !59)
!97 = !DILocation(line: 14, column: 18, scope: !6)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outoff", scope: !6, file: !7, line: 16, type: !10)
!99 = !DILocation(line: 16, column: 7, scope: !6)
!100 = !DILocation(line: 34, column: 3, scope: !6)
!101 = !DILocation(line: 35, column: 5, scope: !102)
!102 = distinct !DILexicalBlock(scope: !103, file: !7, line: 35, column: 5)
!103 = distinct !DILexicalBlock(scope: !104, file: !7, line: 35, column: 5)
!104 = distinct !DILexicalBlock(scope: !105, file: !7, line: 34, column: 12)
!105 = distinct !DILexicalBlock(scope: !106, file: !7, line: 34, column: 3)
!106 = distinct !DILexicalBlock(scope: !6, file: !7, line: 34, column: 3)
!107 = !DILocation(line: 35, column: 5, scope: !103)
!108 = !DILocation(line: 35, column: 5, scope: !109)
!109 = !DILexicalBlockFile(scope: !102, file: !7, discriminator: 1)
!110 = !DILocation(line: 35, column: 5, scope: !111)
!111 = !DILexicalBlockFile(scope: !112, file: !7, discriminator: 2)
!112 = distinct !DILexicalBlock(scope: !103, file: !7, line: 35, column: 5)
!113 = !DILocation(line: 35, column: 5, scope: !114)
!114 = distinct !DILexicalBlock(scope: !103, file: !7, line: 35, column: 5)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !6, file: !7, line: 15, type: !12)
!116 = !DILocation(line: 15, column: 17, scope: !6)
!117 = !DILocation(line: 35, column: 5, scope: !118)
!118 = !DILexicalBlockFile(scope: !119, file: !7, discriminator: 3)
!119 = distinct !DILexicalBlock(scope: !114, file: !7, line: 35, column: 5)
!120 = !DILocation(line: 35, column: 5, scope: !121)
!121 = distinct !DILexicalBlock(scope: !119, file: !7, line: 35, column: 5)
!122 = !DILocation(line: 35, column: 5, scope: !119)
!123 = !DILocation(line: 35, column: 5, scope: !124)
!124 = !DILexicalBlockFile(scope: !121, file: !7, discriminator: 5)
!125 = !DILocation(line: 35, column: 5, scope: !126)
!126 = !DILexicalBlockFile(scope: !127, file: !7, discriminator: 7)
!127 = !DILexicalBlockFile(scope: !119, file: !7, discriminator: 6)
!128 = !DILocation(line: 35, column: 5, scope: !129)
!129 = !DILexicalBlockFile(scope: !130, file: !7, discriminator: 8)
!130 = !DILexicalBlockFile(scope: !103, file: !7, discriminator: 4)
!131 = !DILocation(line: 36, column: 5, scope: !132)
!132 = distinct !DILexicalBlock(scope: !133, file: !7, line: 36, column: 5)
!133 = distinct !DILexicalBlock(scope: !104, file: !7, line: 36, column: 5)
!134 = !DILocation(line: 36, column: 5, scope: !133)
!135 = !DILocation(line: 36, column: 5, scope: !136)
!136 = !DILexicalBlockFile(scope: !132, file: !7, discriminator: 1)
!137 = !DILocation(line: 36, column: 5, scope: !138)
!138 = !DILexicalBlockFile(scope: !139, file: !7, discriminator: 2)
!139 = distinct !DILexicalBlock(scope: !133, file: !7, line: 36, column: 5)
!140 = !DILocation(line: 36, column: 5, scope: !141)
!141 = !DILexicalBlockFile(scope: !142, file: !7, discriminator: 3)
!142 = distinct !DILexicalBlock(scope: !139, file: !7, line: 36, column: 5)
!143 = !DILocation(line: 36, column: 5, scope: !144)
!144 = distinct !DILexicalBlock(scope: !142, file: !7, line: 36, column: 5)
!145 = !DILocation(line: 36, column: 5, scope: !142)
!146 = !DILocation(line: 36, column: 5, scope: !147)
!147 = !DILexicalBlockFile(scope: !144, file: !7, discriminator: 5)
!148 = !DILocation(line: 36, column: 5, scope: !149)
!149 = !DILexicalBlockFile(scope: !150, file: !7, discriminator: 7)
!150 = !DILexicalBlockFile(scope: !142, file: !7, discriminator: 6)
!151 = !DILocation(line: 36, column: 5, scope: !152)
!152 = !DILexicalBlockFile(scope: !153, file: !7, discriminator: 8)
!153 = !DILexicalBlockFile(scope: !133, file: !7, discriminator: 4)
!154 = !DILocation(line: 37, column: 5, scope: !155)
!155 = distinct !DILexicalBlock(scope: !156, file: !7, line: 37, column: 5)
!156 = distinct !DILexicalBlock(scope: !104, file: !7, line: 37, column: 5)
!157 = !DILocation(line: 37, column: 5, scope: !156)
!158 = !DILocation(line: 37, column: 5, scope: !159)
!159 = !DILexicalBlockFile(scope: !155, file: !7, discriminator: 1)
!160 = !DILocation(line: 37, column: 5, scope: !161)
!161 = !DILexicalBlockFile(scope: !162, file: !7, discriminator: 2)
!162 = distinct !DILexicalBlock(scope: !156, file: !7, line: 37, column: 5)
!163 = !DILocation(line: 37, column: 5, scope: !164)
!164 = distinct !DILexicalBlock(scope: !156, file: !7, line: 37, column: 5)
!165 = !DILocation(line: 37, column: 5, scope: !166)
!166 = !DILexicalBlockFile(scope: !167, file: !7, discriminator: 3)
!167 = distinct !DILexicalBlock(scope: !164, file: !7, line: 37, column: 5)
!168 = !DILocation(line: 37, column: 5, scope: !169)
!169 = distinct !DILexicalBlock(scope: !167, file: !7, line: 37, column: 5)
!170 = !DILocation(line: 37, column: 5, scope: !167)
!171 = !DILocation(line: 37, column: 5, scope: !172)
!172 = !DILexicalBlockFile(scope: !169, file: !7, discriminator: 5)
!173 = !DILocation(line: 37, column: 5, scope: !174)
!174 = !DILexicalBlockFile(scope: !175, file: !7, discriminator: 7)
!175 = !DILexicalBlockFile(scope: !167, file: !7, discriminator: 6)
!176 = !DILocation(line: 37, column: 5, scope: !177)
!177 = !DILexicalBlockFile(scope: !178, file: !7, discriminator: 8)
!178 = !DILexicalBlockFile(scope: !156, file: !7, discriminator: 4)
!179 = !DILocation(line: 38, column: 5, scope: !180)
!180 = distinct !DILexicalBlock(scope: !181, file: !7, line: 38, column: 5)
!181 = distinct !DILexicalBlock(scope: !104, file: !7, line: 38, column: 5)
!182 = !DILocation(line: 38, column: 5, scope: !181)
!183 = !DILocation(line: 38, column: 5, scope: !184)
!184 = !DILexicalBlockFile(scope: !180, file: !7, discriminator: 1)
!185 = !DILocation(line: 38, column: 5, scope: !186)
!186 = !DILexicalBlockFile(scope: !187, file: !7, discriminator: 2)
!187 = distinct !DILexicalBlock(scope: !181, file: !7, line: 38, column: 5)
!188 = !DILocation(line: 38, column: 5, scope: !189)
!189 = !DILexicalBlockFile(scope: !190, file: !7, discriminator: 3)
!190 = distinct !DILexicalBlock(scope: !187, file: !7, line: 38, column: 5)
!191 = !DILocation(line: 38, column: 5, scope: !192)
!192 = distinct !DILexicalBlock(scope: !190, file: !7, line: 38, column: 5)
!193 = !DILocation(line: 38, column: 5, scope: !190)
!194 = !DILocation(line: 38, column: 5, scope: !195)
!195 = !DILexicalBlockFile(scope: !192, file: !7, discriminator: 5)
!196 = !DILocation(line: 38, column: 5, scope: !197)
!197 = !DILexicalBlockFile(scope: !198, file: !7, discriminator: 7)
!198 = !DILexicalBlockFile(scope: !190, file: !7, discriminator: 6)
!199 = !DILocation(line: 38, column: 5, scope: !200)
!200 = !DILexicalBlockFile(scope: !201, file: !7, discriminator: 8)
!201 = !DILexicalBlockFile(scope: !181, file: !7, discriminator: 4)
!202 = !DILocation(line: 39, column: 5, scope: !203)
!203 = distinct !DILexicalBlock(scope: !204, file: !7, line: 39, column: 5)
!204 = distinct !DILexicalBlock(scope: !104, file: !7, line: 39, column: 5)
!205 = !DILocation(line: 39, column: 5, scope: !204)
!206 = !DILocation(line: 39, column: 5, scope: !207)
!207 = !DILexicalBlockFile(scope: !203, file: !7, discriminator: 1)
!208 = !DILocation(line: 39, column: 5, scope: !209)
!209 = !DILexicalBlockFile(scope: !210, file: !7, discriminator: 2)
!210 = distinct !DILexicalBlock(scope: !204, file: !7, line: 39, column: 5)
!211 = !DILocation(line: 39, column: 5, scope: !212)
!212 = !DILexicalBlockFile(scope: !213, file: !7, discriminator: 3)
!213 = distinct !DILexicalBlock(scope: !210, file: !7, line: 39, column: 5)
!214 = !DILocation(line: 39, column: 5, scope: !215)
!215 = distinct !DILexicalBlock(scope: !213, file: !7, line: 39, column: 5)
!216 = !DILocation(line: 39, column: 5, scope: !213)
!217 = !DILocation(line: 39, column: 5, scope: !218)
!218 = !DILexicalBlockFile(scope: !215, file: !7, discriminator: 5)
!219 = !DILocation(line: 39, column: 5, scope: !220)
!220 = !DILexicalBlockFile(scope: !221, file: !7, discriminator: 7)
!221 = !DILexicalBlockFile(scope: !213, file: !7, discriminator: 6)
!222 = !DILocation(line: 39, column: 5, scope: !223)
!223 = !DILexicalBlockFile(scope: !224, file: !7, discriminator: 8)
!224 = !DILexicalBlockFile(scope: !204, file: !7, discriminator: 4)
!225 = !DILocation(line: 40, column: 5, scope: !226)
!226 = distinct !DILexicalBlock(scope: !227, file: !7, line: 40, column: 5)
!227 = distinct !DILexicalBlock(scope: !104, file: !7, line: 40, column: 5)
!228 = !DILocation(line: 40, column: 5, scope: !227)
!229 = !DILocation(line: 40, column: 5, scope: !230)
!230 = !DILexicalBlockFile(scope: !226, file: !7, discriminator: 1)
!231 = !DILocation(line: 40, column: 5, scope: !232)
!232 = !DILexicalBlockFile(scope: !233, file: !7, discriminator: 2)
!233 = distinct !DILexicalBlock(scope: !227, file: !7, line: 40, column: 5)
!234 = !DILocation(line: 40, column: 5, scope: !235)
!235 = distinct !DILexicalBlock(scope: !227, file: !7, line: 40, column: 5)
!236 = !DILocation(line: 40, column: 5, scope: !237)
!237 = !DILexicalBlockFile(scope: !238, file: !7, discriminator: 3)
!238 = distinct !DILexicalBlock(scope: !235, file: !7, line: 40, column: 5)
!239 = !DILocation(line: 40, column: 5, scope: !240)
!240 = distinct !DILexicalBlock(scope: !238, file: !7, line: 40, column: 5)
!241 = !DILocation(line: 40, column: 5, scope: !238)
!242 = !DILocation(line: 40, column: 5, scope: !243)
!243 = !DILexicalBlockFile(scope: !240, file: !7, discriminator: 5)
!244 = !DILocation(line: 40, column: 5, scope: !245)
!245 = !DILexicalBlockFile(scope: !246, file: !7, discriminator: 7)
!246 = !DILexicalBlockFile(scope: !238, file: !7, discriminator: 6)
!247 = !DILocation(line: 40, column: 5, scope: !248)
!248 = !DILexicalBlockFile(scope: !249, file: !7, discriminator: 8)
!249 = !DILexicalBlockFile(scope: !227, file: !7, discriminator: 4)
!250 = !DILocation(line: 41, column: 5, scope: !251)
!251 = distinct !DILexicalBlock(scope: !252, file: !7, line: 41, column: 5)
!252 = distinct !DILexicalBlock(scope: !104, file: !7, line: 41, column: 5)
!253 = !DILocation(line: 41, column: 5, scope: !252)
!254 = !DILocation(line: 41, column: 5, scope: !255)
!255 = !DILexicalBlockFile(scope: !251, file: !7, discriminator: 1)
!256 = !DILocation(line: 41, column: 5, scope: !257)
!257 = !DILexicalBlockFile(scope: !258, file: !7, discriminator: 2)
!258 = distinct !DILexicalBlock(scope: !252, file: !7, line: 41, column: 5)
!259 = !DILocation(line: 41, column: 5, scope: !260)
!260 = !DILexicalBlockFile(scope: !261, file: !7, discriminator: 3)
!261 = distinct !DILexicalBlock(scope: !258, file: !7, line: 41, column: 5)
!262 = !DILocation(line: 41, column: 5, scope: !263)
!263 = distinct !DILexicalBlock(scope: !261, file: !7, line: 41, column: 5)
!264 = !DILocation(line: 41, column: 5, scope: !261)
!265 = !DILocation(line: 41, column: 5, scope: !266)
!266 = !DILexicalBlockFile(scope: !263, file: !7, discriminator: 5)
!267 = !DILocation(line: 41, column: 5, scope: !268)
!268 = !DILexicalBlockFile(scope: !269, file: !7, discriminator: 7)
!269 = !DILexicalBlockFile(scope: !261, file: !7, discriminator: 6)
!270 = !DILocation(line: 41, column: 5, scope: !271)
!271 = !DILexicalBlockFile(scope: !272, file: !7, discriminator: 8)
!272 = !DILexicalBlockFile(scope: !252, file: !7, discriminator: 4)
!273 = !DILocation(line: 42, column: 5, scope: !274)
!274 = distinct !DILexicalBlock(scope: !275, file: !7, line: 42, column: 5)
!275 = distinct !DILexicalBlock(scope: !104, file: !7, line: 42, column: 5)
!276 = !DILocation(line: 42, column: 5, scope: !275)
!277 = !DILocation(line: 42, column: 5, scope: !278)
!278 = !DILexicalBlockFile(scope: !274, file: !7, discriminator: 1)
!279 = !DILocation(line: 42, column: 5, scope: !280)
!280 = !DILexicalBlockFile(scope: !281, file: !7, discriminator: 2)
!281 = distinct !DILexicalBlock(scope: !275, file: !7, line: 42, column: 5)
!282 = !DILocation(line: 42, column: 5, scope: !283)
!283 = !DILexicalBlockFile(scope: !284, file: !7, discriminator: 3)
!284 = distinct !DILexicalBlock(scope: !281, file: !7, line: 42, column: 5)
!285 = !DILocation(line: 42, column: 5, scope: !286)
!286 = distinct !DILexicalBlock(scope: !284, file: !7, line: 42, column: 5)
!287 = !DILocation(line: 42, column: 5, scope: !284)
!288 = !DILocation(line: 42, column: 5, scope: !289)
!289 = !DILexicalBlockFile(scope: !286, file: !7, discriminator: 5)
!290 = !DILocation(line: 42, column: 5, scope: !291)
!291 = !DILexicalBlockFile(scope: !292, file: !7, discriminator: 7)
!292 = !DILexicalBlockFile(scope: !284, file: !7, discriminator: 6)
!293 = !DILocation(line: 42, column: 5, scope: !294)
!294 = !DILexicalBlockFile(scope: !295, file: !7, discriminator: 8)
!295 = !DILexicalBlockFile(scope: !275, file: !7, discriminator: 4)
!296 = !DILocation(line: 34, column: 3, scope: !105)
!297 = !DILocation(line: 45, column: 15, scope: !298)
!298 = distinct !DILexicalBlock(scope: !6, file: !7, line: 45, column: 7)
!299 = !DILocation(line: 45, column: 20, scope: !298)
!300 = !DILocation(line: 45, column: 7, scope: !6)
!301 = !DILocation(line: 47, column: 15, scope: !302)
!302 = distinct !DILexicalBlock(scope: !298, file: !7, line: 46, column: 3)
!303 = !DILocation(line: 47, column: 36, scope: !302)
!304 = !DILocation(line: 47, column: 26, scope: !302)
!305 = !DILocation(line: 47, column: 20, scope: !302)
!306 = !DILocation(line: 47, column: 14, scope: !302)
!307 = !DILocation(line: 47, column: 9, scope: !302)
!308 = !DILocation(line: 47, column: 12, scope: !302)
!309 = !DILocation(line: 48, column: 3, scope: !302)
!310 = !DILocation(line: 49, column: 20, scope: !6)
!311 = !DILocation(line: 49, column: 3, scope: !6)
!312 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !16, file: !7, line: 61, type: !10)
!313 = !DILocation(line: 61, column: 14, scope: !16)
!314 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !16, file: !7, line: 61, type: !19)
!315 = !DILocation(line: 61, column: 26, scope: !16)
!316 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !16, file: !7, line: 62, type: !25)
!317 = !DILocation(line: 62, column: 14, scope: !16)
!318 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "postfix", scope: !16, file: !7, line: 68, type: !319)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 24, align: 8, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 3)
!322 = !DILocation(line: 68, column: 8, scope: !16)
!323 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pre", scope: !16, file: !7, line: 69, type: !324)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !325, line: 30, size: 128, align: 64, elements: !326)
!325 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/gleison/tf/Benchmarks/BitBench/drop3")
!326 = !{!327, !329}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !324, file: !325, line: 32, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !56, line: 139, baseType: !57)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !324, file: !325, line: 33, baseType: !330, size: 64, align: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !56, line: 141, baseType: !57)
!331 = !DILocation(line: 69, column: 18, scope: !16)
!332 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "post", scope: !16, file: !7, line: 69, type: !324)
!333 = !DILocation(line: 69, column: 23, scope: !16)
!334 = !DILocation(line: 72, column: 11, scope: !16)
!335 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inbuf", scope: !16, file: !7, line: 66, type: !11)
!336 = !DILocation(line: 66, column: 18, scope: !16)
!337 = !DILocation(line: 73, column: 12, scope: !16)
!338 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outbuf", scope: !16, file: !7, line: 66, type: !11)
!339 = !DILocation(line: 66, column: 26, scope: !16)
!340 = !DILocation(line: 75, column: 12, scope: !341)
!341 = distinct !DILexicalBlock(scope: !16, file: !7, line: 75, column: 7)
!342 = !DILocation(line: 75, column: 7, scope: !16)
!343 = !DILocation(line: 77, column: 21, scope: !344)
!344 = distinct !DILexicalBlock(scope: !345, file: !7, line: 77, column: 9)
!345 = distinct !DILexicalBlock(scope: !341, file: !7, line: 75, column: 17)
!346 = !DILocation(line: 77, column: 15, scope: !344)
!347 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !16, file: !7, line: 62, type: !25)
!348 = !DILocation(line: 62, column: 9, scope: !16)
!349 = !DILocation(line: 77, column: 36, scope: !344)
!350 = !DILocation(line: 77, column: 9, scope: !345)
!351 = !DILocation(line: 78, column: 14, scope: !352)
!352 = distinct !DILexicalBlock(scope: !344, file: !7, line: 77, column: 45)
!353 = !DILocation(line: 78, column: 7, scope: !352)
!354 = !DILocation(line: 79, column: 7, scope: !352)
!355 = !DILocation(line: 81, column: 33, scope: !345)
!356 = !DILocation(line: 81, column: 26, scope: !345)
!357 = !DILocation(line: 81, column: 51, scope: !345)
!358 = !DILocation(line: 81, column: 44, scope: !345)
!359 = !DILocation(line: 81, column: 42, scope: !345)
!360 = !DILocation(line: 81, column: 60, scope: !345)
!361 = !DILocation(line: 81, column: 19, scope: !345)
!362 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outfilename", scope: !16, file: !7, line: 67, type: !20)
!363 = !DILocation(line: 67, column: 9, scope: !16)
!364 = !DILocation(line: 82, column: 25, scope: !345)
!365 = !DILocation(line: 82, column: 5, scope: !345)
!366 = !DILocation(line: 83, column: 25, scope: !345)
!367 = !DILocation(line: 83, column: 5, scope: !345)
!368 = !DILocation(line: 84, column: 5, scope: !345)
!369 = !DILocation(line: 85, column: 9, scope: !345)
!370 = !DILocation(line: 86, column: 9, scope: !345)
!371 = !DILocation(line: 87, column: 3, scope: !345)
!372 = !DILocation(line: 88, column: 10, scope: !341)
!373 = !DILocation(line: 89, column: 12, scope: !374)
!374 = distinct !DILexicalBlock(scope: !16, file: !7, line: 89, column: 7)
!375 = !DILocation(line: 89, column: 7, scope: !16)
!376 = !DILocation(line: 90, column: 5, scope: !377)
!377 = distinct !DILexicalBlock(scope: !374, file: !7, line: 89, column: 18)
!378 = !DILocation(line: 91, column: 5, scope: !377)
!379 = !DILocation(line: 93, column: 10, scope: !16)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !16, file: !7, line: 64, type: !13)
!381 = !DILocation(line: 64, column: 10, scope: !16)
!382 = !DILocation(line: 94, column: 3, scope: !16)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !16, file: !7, line: 63, type: !10)
!384 = !DILocation(line: 63, column: 7, scope: !16)
!385 = !DILocation(line: 95, column: 8, scope: !386)
!386 = distinct !DILexicalBlock(scope: !16, file: !7, line: 95, column: 3)
!387 = !DILocation(line: 95, column: 17, scope: !388)
!388 = distinct !DILexicalBlock(scope: !386, file: !7, line: 95, column: 3)
!389 = !DILocation(line: 95, column: 3, scope: !386)
