; ModuleID = '/home/gleison/tf/Benchmarks/Prolangs-C/archie-client/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.vlink = type { i32, i8*, i8, i32, i8*, %struct.vlink*, %struct.vlink*, i8*, i8*, i8*, i8*, i64, i64, %struct.acl*, i64, i64, i8*, %struct.pattrib*, %struct.pfile*, %struct.vlink*, %struct.vlink* }
%struct.acl = type { i32, i8*, i8*, i8*, %struct.restrict_*, %struct.acl*, %struct.acl* }
%struct.restrict_ = type { %struct.acl*, %struct.acl* }
%struct.pattrib = type { i8, i8*, i8*, %union.avalue, %struct.pattrib*, %struct.pattrib* }
%union.avalue = type { i8* }
%struct.pfile = type { i32, i64, i64, i64, i64, %struct.vlink*, %struct.vlink*, %struct.pattrib*, %struct.pfile*, %struct.pfile* }

@vlink_count = global i32 0, align 4
@vlink_max = global i32 0, align 4
@lfree = internal global %struct.vlink* null, align 8
@.str = private unnamed_addr constant [5 x i8] c"FILE\00", align 1
@.str.1 = private unnamed_addr constant [11 x i8] c"INTERNET-D\00", align 1
@.str.2 = private unnamed_addr constant [6 x i8] c"ASCII\00", align 1
@string_count = external global i32, align 4

; Function Attrs: nounwind uwtable
define %struct.vlink* @vlalloc() #0 {
entry:
  %retval = alloca %struct.vlink*, align 8
  %vl = alloca %struct.vlink*, align 8
  call void @llvm.dbg.declare(metadata %struct.vlink** %vl, metadata !92, metadata !93), !dbg !94
  %0 = load %struct.vlink*, %struct.vlink** @lfree, align 8, !dbg !95

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !76, globals: !85)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/archie-client")
!2 = !{}
!3 = !{!4, !12, !75}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "VLINK", file: !5, line: 106, baseType: !6)
!5 = !DIFile(filename: "./pfs.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/archie-client")
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "vlink", file: !5, line: 82, size: 1280, align: 64, elements: !8)
!8 = !{!9, !11, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !25, !26, !42, !43, !44, !45, !59, !73, !74}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "dontfree", scope: !7, file: !5, line: 83, baseType: !10, size: 32, align: 32)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !7, file: !5, line: 84, baseType: !12, size: 64, align: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "linktype", scope: !7, file: !5, line: 85, baseType: !13, size: 8, align: 8, offset: 128)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "expanded", scope: !7, file: !5, line: 86, baseType: !10, size: 32, align: 32, offset: 160)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !7, file: !5, line: 87, baseType: !12, size: 64, align: 64, offset: 192)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !7, file: !5, line: 88, baseType: !6, size: 64, align: 64, offset: 256)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "replicas", scope: !7, file: !5, line: 89, baseType: !6, size: 64, align: 64, offset: 320)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "hosttype", scope: !7, file: !5, line: 90, baseType: !12, size: 64, align: 64, offset: 384)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !7, file: !5, line: 91, baseType: !12, size: 64, align: 64, offset: 448)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "nametype", scope: !7, file: !5, line: 92, baseType: !12, size: 64, align: 64, offset: 512)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !7, file: !5, line: 93, baseType: !12, size: 64, align: 64, offset: 576)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !7, file: !5, line: 94, baseType: !24, size: 64, align: 64, offset: 640)
!24 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "f_magic_no", scope: !7, file: !5, line: 95, baseType: !24, size: 64, align: 64, offset: 704)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "acl", scope: !7, file: !5, line: 96, baseType: !27, size: 64, align: 64, offset: 768)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "acl", file: !5, line: 208, size: 448, align: 64, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !40, !41}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "acetype", scope: !28, file: !5, line: 209, baseType: !10, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "atype", scope: !28, file: !5, line: 210, baseType: !12, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "rights", scope: !28, file: !5, line: 211, baseType: !12, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "principals", scope: !28, file: !5, line: 212, baseType: !12, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "restrictions", scope: !28, file: !5, line: 213, baseType: !35, size: 64, align: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "restrict_", file: !5, line: 235, size: 128, align: 64, elements: !37)
!37 = !{!38, !39}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !36, file: !5, line: 236, baseType: !27, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !36, file: !5, line: 237, baseType: !27, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !28, file: !5, line: 214, baseType: !27, size: 64, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !28, file: !5, line: 215, baseType: !27, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "dest_exp", scope: !7, file: !5, line: 97, baseType: !24, size: 64, align: 64, offset: 832)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "link_exp", scope: !7, file: !5, line: 98, baseType: !24, size: 64, align: 64, offset: 896)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !7, file: !5, line: 99, baseType: !12, size: 64, align: 64, offset: 960)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "lattrib", scope: !7, file: !5, line: 100, baseType: !46, size: 64, align: 64, offset: 1024)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "pattrib", file: !5, line: 171, size: 384, align: 64, elements: !48)
!48 = !{!49, !50, !51, !52, !57, !58}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "precedence", scope: !47, file: !5, line: 172, baseType: !13, size: 8, align: 8)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "aname", scope: !47, file: !5, line: 173, baseType: !12, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "avtype", scope: !47, file: !5, line: 174, baseType: !12, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !47, file: !5, line: 175, baseType: !53, size: 64, align: 64, offset: 192)
!53 = !DICompositeType(tag: DW_TAG_union_type, name: "avalue", file: !5, line: 165, size: 64, align: 64, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !53, file: !5, line: 166, baseType: !12, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !53, file: !5, line: 167, baseType: !6, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !47, file: !5, line: 176, baseType: !46, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !47, file: !5, line: 177, baseType: !46, size: 64, align: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "f_info", scope: !7, file: !5, line: 101, baseType: !60, size: 64, align: 64, offset: 1088)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "pfile", file: !5, line: 190, size: 640, align: 64, elements: !62)
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !61, file: !5, line: 191, baseType: !10, size: 32, align: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "f_magic_no", scope: !61, file: !5, line: 192, baseType: !24, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !61, file: !5, line: 193, baseType: !24, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !61, file: !5, line: 194, baseType: !24, size: 64, align: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "last_ref", scope: !61, file: !5, line: 195, baseType: !24, size: 64, align: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !61, file: !5, line: 196, baseType: !6, size: 64, align: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "backlinks", scope: !61, file: !5, line: 197, baseType: !6, size: 64, align: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !61, file: !5, line: 198, baseType: !46, size: 64, align: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !61, file: !5, line: 199, baseType: !60, size: 64, align: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !61, file: !5, line: 200, baseType: !60, size: 64, align: 64, offset: 576)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !7, file: !5, line: 102, baseType: !6, size: 64, align: 64, offset: 1152)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !5, line: 103, baseType: !6, size: 64, align: 64, offset: 1216)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!76 = !{!77, !81, !84}
!77 = !DISubprogram(name: "vlalloc", scope: !78, file: !78, line: 28, type: !79, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false, function: %struct.vlink* ()* @vlalloc, variables: !2)
!78 = !DIFile(filename: "/home/gleison/tf/Benchmarks/Prolangs-C/archie-client/tmp.c", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/archie-client")
!79 = !DISubroutineType(types: !80)
!80 = !{!4}
!81 = !DISubprogram(name: "vlfree", scope: !78, file: !78, line: 62, type: !82, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.vlink*)* @vlfree, variables: !2)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !4}
!84 = !DISubprogram(name: "vllfree", scope: !78, file: !78, line: 103, type: !82, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.vlink*)* @vllfree, variables: !2)
!85 = !{!86, !87, !88}
!86 = !DIGlobalVariable(name: "vlink_count", scope: !0, file: !78, line: 16, type: !10, isLocal: false, isDefinition: true, variable: i32* @vlink_count)
!87 = !DIGlobalVariable(name: "vlink_max", scope: !0, file: !78, line: 17, type: !10, isLocal: false, isDefinition: true, variable: i32* @vlink_max)
!88 = !DIGlobalVariable(name: "lfree", scope: !0, file: !78, line: 15, type: !4, isLocal: true, isDefinition: true, variable: %struct.vlink** @lfree)
!89 = !{i32 2, !"Dwarf Version", i32 4}
!90 = !{i32 2, !"Debug Info Version", i32 3}
!91 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vl", scope: !77, file: !78, line: 29, type: !4)
!93 = !DIExpression()
!94 = !DILocation(line: 29, column: 9, scope: !77)
!95 = !DILocation(line: 30, column: 7, scope: !96)
!96 = distinct !DILexicalBlock(scope: !77, file: !78, line: 30, column: 7)
!97 = !DILocation(line: 30, column: 7, scope: !77)
!98 = !DILocation(line: 31, column: 10, scope: !99)
!99 = distinct !DILexicalBlock(scope: !96, file: !78, line: 30, column: 14)
!100 = !DILocation(line: 31, column: 8, scope: !99)
!101 = !DILocation(line: 32, column: 13, scope: !99)
!102 = !DILocation(line: 32, column: 20, scope: !99)
!103 = !DILocation(line: 32, column: 11, scope: !99)
!104 = !DILocation(line: 33, column: 3, scope: !99)
!105 = !DILocation(line: 34, column: 17, scope: !106)
!106 = distinct !DILexicalBlock(scope: !96, file: !78, line: 33, column: 10)
!107 = !DILocation(line: 34, column: 10, scope: !106)
!108 = !DILocation(line: 34, column: 8, scope: !106)
!109 = !DILocation(line: 35, column: 10, scope: !110)
!110 = distinct !DILexicalBlock(scope: !106, file: !78, line: 35, column: 9)
!111 = !DILocation(line: 35, column: 9, scope: !106)
!112 = !DILocation(line: 36, column: 7, scope: !110)
!113 = !DILocation(line: 37, column: 14, scope: !106)
!114 = !DILocation(line: 40, column: 14, scope: !77)
!115 = !DILocation(line: 45, column: 3, scope: !77)
!116 = !DILocation(line: 47, column: 3, scope: !77)
!117 = !DILocation(line: 47, column: 7, scope: !77)
!118 = !DILocation(line: 47, column: 16, scope: !77)
!119 = !DILocation(line: 48, column: 14, scope: !77)
!120 = !DILocation(line: 48, column: 3, scope: !77)
!121 = !DILocation(line: 48, column: 7, scope: !77)
!122 = !DILocation(line: 48, column: 12, scope: !77)
!123 = !DILocation(line: 49, column: 18, scope: !77)
!124 = !DILocation(line: 49, column: 3, scope: !77)
!125 = !DILocation(line: 49, column: 7, scope: !77)
!126 = !DILocation(line: 49, column: 16, scope: !77)
!127 = !DILocation(line: 50, column: 18, scope: !77)
!128 = !DILocation(line: 50, column: 3, scope: !77)
!129 = !DILocation(line: 50, column: 7, scope: !77)
!130 = !DILocation(line: 50, column: 16, scope: !77)
