; ModuleID = '/home/gleison/tf/Benchmarks/TSVC/CrossingThresholds-dbl/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GlobalData = type { [32000 x double], [3 x i32], [20 x i8], [32000 x double], [5 x i32], [12 x i8], [32000 x double], [7 x i32], [32000 x double], [11 x i32], [20 x i8], [32000 x double], [13 x i32], [12 x i8], [256 x [256 x double]], [17 x i32], [28 x i8], [256 x [256 x double]], [19 x i32], [20 x i8], [256 x [256 x double]], [23 x i32], [256 x [256 x double]] }

@global_data = common global %struct.GlobalData zeroinitializer, align 32
@a = constant double* getelementptr inbounds (%struct.GlobalData, %struct.GlobalData* @global_data, i32 0, i32 0, i32 0), align 32
@b = constant double* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 256032) to double*), align 32
@c = constant double* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 512064) to double*), align 32
@d = constant double* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 768096) to double*), align 32
@e = constant double* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 1024160) to double*), align 32
@aa = constant [256 x double]* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 1280224) to [256 x double]*), align 32

!38 = !DISubprogram(name: "s1281", scope: !9, file: !9, line: 3264, type: !36, isLocal: false, isDefinition: true, scopeLine: 3265, isOptimized: false, function: i32 ()* @s1281, variables: !2)
!39 = !DISubprogram(name: "s291", scope: !9, file: !9, line: 3295, type: !36, isLocal: false, isDefinition: true, scopeLine: 3296, isOptimized: false, function: i32 ()* @s291, variables: !2)
!40 = !DISubprogram(name: "s292", scope: !9, file: !9, line: 3325, type: !36, isLocal: false, isDefinition: true, scopeLine: 3326, isOptimized: false, function: i32 ()* @s292, variables: !2)
!41 = !DISubprogram(name: "s293", scope: !9, file: !9, line: 3358, type: !36, isLocal: false, isDefinition: true, scopeLine: 3359, isOptimized: false, function: i32 ()* @s293, variables: !2)
!42 = !DISubprogram(name: "s2101", scope: !9, file: !9, line: 3384, type: !36, isLocal: false, isDefinition: true, scopeLine: 3385, isOptimized: false, function: i32 ()* @s2101, variables: !2)
!43 = !DISubprogram(name: "s2102", scope: !9, file: !9, line: 3412, type: !36, isLocal: false, isDefinition: true, scopeLine: 3413, isOptimized: false, function: i32 ()* @s2102, variables: !2)
!44 = !DISubprogram(name: "s2111", scope: !9, file: !9, line: 3442, type: !36, isLocal: false, isDefinition: true, scopeLine: 3443, isOptimized: false, function: i32 ()* @s2111, variables: !2)
!45 = !DISubprogram(name: "min", scope: !9, file: !9, line: 4916, type: !46, isLocal: false, isDefinition: true, scopeLine: 4916, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i32)* @min, variables: !2)
!46 = !DISubroutineType(types: !47)
!47 = !{!12, !12, !12}
!48 = !DISubprogram(name: "set", scope: !9, file: !9, line: 5543, type: !49, isLocal: false, isDefinition: true, scopeLine: 5543, flags: DIFlagPrototyped, isOptimized: false, function: void (i32*, double*, double*)* @set, variables: !2)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !51, !13, !13}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!52 = !DISubprogram(name: "main", scope: !9, file: !9, line: 5572, type: !53, isLocal: false, isDefinition: true, scopeLine: 5572, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !2)
!53 = !DISubroutineType(types: !54)
!54 = !{!12, !12, !55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!56 = !{!57, !59, !60, !61, !62, !63, !65, !66, !67, !68, !72, !73, !74, !75, !76, !80, !81, !82, !83, !129, !131, !133, !134, !135}
!57 = !DIGlobalVariable(name: "a", scope: !0, file: !9, line: 100, type: !58, isLocal: false, isDefinition: true, variable: double** @a)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!59 = !DIGlobalVariable(name: "b", scope: !0, file: !9, line: 101, type: !58, isLocal: false, isDefinition: true, variable: double** @b)
!60 = !DIGlobalVariable(name: "c", scope: !0, file: !9, line: 102, type: !58, isLocal: false, isDefinition: true, variable: double** @c)
!61 = !DIGlobalVariable(name: "d", scope: !0, file: !9, line: 103, type: !58, isLocal: false, isDefinition: true, variable: double** @d)
!62 = !DIGlobalVariable(name: "e", scope: !0, file: !9, line: 104, type: !58, isLocal: false, isDefinition: true, variable: double** @e)
!63 = !DIGlobalVariable(name: "aa", scope: !0, file: !9, line: 105, type: !64, isLocal: false, isDefinition: true, variable: [256 x double]** @aa)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!65 = !DIGlobalVariable(name: "bb", scope: !0, file: !9, line: 106, type: !64, isLocal: false, isDefinition: true, variable: [256 x double]** @bb)
!66 = !DIGlobalVariable(name: "cc", scope: !0, file: !9, line: 107, type: !64, isLocal: false, isDefinition: true, variable: [256 x double]** @cc)
!67 = !DIGlobalVariable(name: "tt", scope: !0, file: !9, line: 108, type: !64, isLocal: false, isDefinition: true, variable: [256 x double]** @tt)
!68 = !DIGlobalVariable(name: "X", scope: !0, file: !9, line: 59, type: !69, isLocal: false, isDefinition: true, variable: [32000 x double]* @X)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048000, align: 64, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 32000)
!72 = !DIGlobalVariable(name: "Y", scope: !0, file: !9, line: 59, type: !69, isLocal: false, isDefinition: true, variable: [32000 x double]* @Y)
!73 = !DIGlobalVariable(name: "Z", scope: !0, file: !9, line: 59, type: !69, isLocal: false, isDefinition: true, variable: [32000 x double]* @Z)
!74 = !DIGlobalVariable(name: "U", scope: !0, file: !9, line: 59, type: !69, isLocal: false, isDefinition: true, variable: [32000 x double]* @U)
!75 = !DIGlobalVariable(name: "V", scope: !0, file: !9, line: 59, type: !69, isLocal: false, isDefinition: true, variable: [32000 x double]* @V)
!76 = !DIGlobalVariable(name: "array", scope: !0, file: !9, line: 63, type: !77, isLocal: false, isDefinition: true, variable: [65536 x double]* @array)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4194304, align: 64, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 65536)
!80 = !DIGlobalVariable(name: "x", scope: !0, file: !9, line: 65, type: !69, isLocal: false, isDefinition: true, variable: [32000 x double]* @x)
!81 = !DIGlobalVariable(name: "temp", scope: !0, file: !9, line: 66, type: !4, isLocal: false, isDefinition: true, variable: double* @temp)
!82 = !DIGlobalVariable(name: "temp_int", scope: !0, file: !9, line: 67, type: !12, isLocal: false, isDefinition: true, variable: i32* @temp_int)
!83 = !DIGlobalVariable(name: "global_data", scope: !0, file: !9, line: 98, type: !84, isLocal: false, isDefinition: true, variable: %struct.GlobalData* @global_data)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalData", file: !9, line: 79, size: 27021312, align: 256, elements: !85)
!85 = !{!86, !87, !91, !92, !96, !97, !101, !102, !106, !107, !111, !114, !118, !119, !123, !124, !128}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !84, file: !9, line: 80, baseType: !69, size: 2048000, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !84, file: !9, line: 81, baseType: !88, size: 96, align: 32, offset: 2048000)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 96, align: 32, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 3)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !84, file: !9, line: 82, baseType: !69, size: 2048000, align: 64, offset: 2048256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !84, file: !9, line: 83, baseType: !93, size: 160, align: 32, offset: 4096256)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, align: 32, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 5)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !84, file: !9, line: 84, baseType: !69, size: 2048000, align: 64, offset: 4096512)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !84, file: !9, line: 85, baseType: !98, size: 224, align: 32, offset: 6144512)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 224, align: 32, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 7)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !84, file: !9, line: 86, baseType: !69, size: 2048000, align: 64, offset: 6144768)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !84, file: !9, line: 87, baseType: !103, size: 352, align: 32, offset: 8192768)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 352, align: 32, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 11)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !84, file: !9, line: 88, baseType: !69, size: 2048000, align: 64, offset: 8193280)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !84, file: !9, line: 90, baseType: !108, size: 416, align: 32, offset: 10241280)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 416, align: 32, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 13)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !84, file: !9, line: 91, baseType: !112, size: 4194304, align: 64, offset: 10241792)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4194304, align: 64, elements: !113)
!113 = !{!23, !23}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "pad6", scope: !84, file: !9, line: 92, baseType: !115, size: 544, align: 32, offset: 14436096)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 544, align: 32, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 17)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !84, file: !9, line: 93, baseType: !112, size: 4194304, align: 64, offset: 14436864)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "pad7", scope: !84, file: !9, line: 94, baseType: !120, size: 608, align: 32, offset: 18631168)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 608, align: 32, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 19)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "cc", scope: !84, file: !9, line: 95, baseType: !112, size: 4194304, align: 64, offset: 18631936)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "pad8", scope: !84, file: !9, line: 96, baseType: !125, size: 736, align: 32, offset: 22826240)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 736, align: 32, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 23)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !84, file: !9, line: 97, baseType: !112, size: 4194304, align: 64, offset: 22827008)
!129 = !DIGlobalVariable(name: "indx", scope: !0, file: !9, line: 110, type: !130, isLocal: false, isDefinition: true, variable: [32000 x i32]* @indx)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 1024000, align: 32, elements: !70)
!131 = !DIGlobalVariable(name: "xx", scope: !0, file: !9, line: 113, type: !132, isLocal: false, isDefinition: true, variable: double** @xx)
!132 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !13)
!133 = !DIGlobalVariable(name: "yy", scope: !0, file: !9, line: 114, type: !13, isLocal: false, isDefinition: true, variable: double** @yy)
!134 = !DIGlobalVariable(name: "digits", scope: !0, file: !9, line: 40, type: !12, isLocal: true, isDefinition: true, variable: i32* @digits)
!135 = !DIGlobalVariable(name: "ntimes", scope: !0, file: !9, line: 39, type: !12, isLocal: true, isDefinition: true, variable: i32* @ntimes)
!136 = !{i32 2, !"Dwarf Version", i32 4}
!137 = !{i32 2, !"Debug Info Version", i32 3}
!138 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arr", arg: 1, scope: !8, file: !9, line: 120, type: !13)
!140 = !DIExpression()
!141 = !DILocation(line: 120, column: 16, scope: !8)
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !8, file: !9, line: 120, type: !4)
!143 = !DILocation(line: 120, column: 31, scope: !8)
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stride", arg: 3, scope: !8, file: !9, line: 120, type: !12)
!145 = !DILocation(line: 120, column: 42, scope: !8)
!146 = !DILocation(line: 122, column: 6, scope: !147)
!147 = distinct !DILexicalBlock(scope: !8, file: !9, line: 122, column: 6)
!148 = !DILocation(line: 122, column: 13, scope: !147)
!149 = !DILocation(line: 122, column: 6, scope: !8)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !151, file: !9, line: 123, type: !12)
!151 = distinct !DILexicalBlock(scope: !152, file: !9, line: 123, column: 3)
!152 = distinct !DILexicalBlock(scope: !147, file: !9, line: 122, column: 20)
!153 = !DILocation(line: 123, column: 12, scope: !151)
!154 = !DILocation(line: 123, column: 8, scope: !151)
!155 = !DILocation(line: 123, column: 19, scope: !156)
!156 = !DILexicalBlockFile(scope: !157, file: !9, discriminator: 2)
!157 = !DILexicalBlockFile(scope: !158, file: !9, discriminator: 1)
!158 = distinct !DILexicalBlock(scope: !151, file: !9, line: 123, column: 3)
!159 = !DILocation(line: 123, column: 21, scope: !158)
!160 = !DILocation(line: 123, column: 3, scope: !151)
!161 = !DILocation(line: 124, column: 26, scope: !162)
!162 = distinct !DILexicalBlock(scope: !158, file: !9, line: 123, column: 33)
!163 = !DILocation(line: 124, column: 27, scope: !162)
!164 = !DILocation(line: 124, column: 18, scope: !162)
!165 = !DILocation(line: 124, column: 16, scope: !162)
!166 = !DILocation(line: 124, column: 8, scope: !162)
!167 = !DILocation(line: 124, column: 4, scope: !162)
!168 = !DILocation(line: 124, column: 11, scope: !162)
!169 = !DILocation(line: 125, column: 3, scope: !162)
!170 = !DILocation(line: 123, column: 29, scope: !158)
!171 = !DILocation(line: 123, column: 3, scope: !158)
!172 = !DILocation(line: 126, column: 2, scope: !152)
!173 = !DILocation(line: 126, column: 13, scope: !174)
!174 = distinct !DILexicalBlock(scope: !147, file: !9, line: 126, column: 13)
!175 = !DILocation(line: 126, column: 20, scope: !174)
!176 = !DILocation(line: 126, column: 13, scope: !147)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !178, file: !9, line: 127, type: !12)
!178 = distinct !DILexicalBlock(scope: !179, file: !9, line: 127, column: 3)
!179 = distinct !DILexicalBlock(scope: !174, file: !9, line: 126, column: 27)
!180 = !DILocation(line: 127, column: 12, scope: !178)
!181 = !DILocation(line: 127, column: 8, scope: !178)
