; ModuleID = '/home/gleison/tf/Benchmarks/ASC_Sequoia/AMGmk/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.hypre_Vector = type { double*, i32, i32, i32, i32, i32, i32 }

@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"%le\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.3 = private unnamed_addr constant [25 x i8] c"hypre_assert failed: %s\0A\00", align 1
@.str.4 = private unnamed_addr constant [36 x i8] c"hypre_VectorNumVectors(vector) == 1\00", align 1
@.str.5 = private unnamed_addr constant [52 x i8] c"/home/gleison/tf/Benchmarks/ASC_Sequoia/AMGmk/tmp.c\00", align 1
@.str.6 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.7 = private unnamed_addr constant [4 x i8] c"%d\0A\00", align 1
@.str.8 = private unnamed_addr constant [23 x i8] c"%d vectors of size %d\0A\00", align 1
@.str.9 = private unnamed_addr constant [11 x i8] c"vector %d\0A\00", align 1
@.str.10 = private unnamed_addr constant [7 x i8] c"%.14e\0A\00", align 1


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !22)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/ASC_Sequoia/AMGmk")
!2 = !{}
!3 = !{!4, !19, !20, !10}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "hypre_Vector", file: !6, line: 122, baseType: !7)
!6 = !DIFile(filename: "./seq_mv.h", directory: "/home/gleison/tf/Benchmarks/ASC_Sequoia/AMGmk")
!7 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 104, size: 256, align: 64, elements: !8)
!8 = !{!9, !12, !14, !15, !16, !17, !18}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !7, file: !6, line: 106, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !7, file: !6, line: 107, baseType: !13, size: 32, align: 32, offset: 64)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "owns_data", scope: !7, file: !6, line: 110, baseType: !13, size: 32, align: 32, offset: 96)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "num_vectors", scope: !7, file: !6, line: 113, baseType: !13, size: 32, align: 32, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "multivec_storage_method", scope: !7, file: !6, line: 114, baseType: !13, size: 32, align: 32, offset: 160)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "vecstride", scope: !7, file: !6, line: 119, baseType: !13, size: 32, align: 32, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "idxstride", scope: !7, file: !6, line: 119, baseType: !13, size: 32, align: 32, offset: 224)
!19 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!22 = !{!23, !27, !30, !33, !34, !37, !40, !43, !46, !49, !52, !53, !56, !59, !62}
!23 = !DISubprogram(name: "hypre_SeqVectorCreate", scope: !24, file: !24, line: 41, type: !25, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, function: %struct.hypre_Vector* (i32)* @hypre_SeqVectorCreate, variables: !2)
!24 = !DIFile(filename: "/home/gleison/tf/Benchmarks/ASC_Sequoia/AMGmk/tmp.c", directory: "/home/gleison/tf/Benchmarks/ASC_Sequoia/AMGmk")
!25 = !DISubroutineType(types: !26)
!26 = !{!4, !13}
!27 = !DISubprogram(name: "hypre_SeqMultiVectorCreate", scope: !24, file: !24, line: 63, type: !28, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, function: %struct.hypre_Vector* (i32, i32)* @hypre_SeqMultiVectorCreate, variables: !2)
!28 = !DISubroutineType(types: !29)
!29 = !{!4, !13, !13}
!30 = !DISubprogram(name: "hypre_SeqVectorDestroy", scope: !24, file: !24, line: 73, type: !31, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.hypre_Vector*)* @hypre_SeqVectorDestroy, variables: !2)
!31 = !DISubroutineType(types: !32)
!32 = !{!13, !4}
!33 = !DISubprogram(name: "hypre_SeqVectorInitialize", scope: !24, file: !24, line: 90, type: !31, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.hypre_Vector*)* @hypre_SeqVectorInitialize, variables: !2)
!34 = !DISubprogram(name: "hypre_SeqVectorSetDataOwner", scope: !24, file: !24, line: 115, type: !35, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.hypre_Vector*, i32)* @hypre_SeqVectorSetDataOwner, variables: !2)
!35 = !DISubroutineType(types: !36)
!36 = !{!13, !4, !13}
!37 = !DISubprogram(name: "hypre_SeqVectorRead", scope: !24, file: !24, line: 129, type: !38, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: false, function: %struct.hypre_Vector* (i8*)* @hypre_SeqVectorRead, variables: !2)
!38 = !DISubroutineType(types: !39)
!39 = !{!4, !20}
!40 = !DISubprogram(name: "hypre_SeqVectorPrint", scope: !24, file: !24, line: 167, type: !41, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.hypre_Vector*, i8*)* @hypre_SeqVectorPrint, variables: !2)
!41 = !DISubroutineType(types: !42)
!42 = !{!13, !4, !20}
!43 = !DISubprogram(name: "hypre_SeqVectorSetConstantValues", scope: !24, file: !24, line: 219, type: !44, isLocal: false, isDefinition: true, scopeLine: 220, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.hypre_Vector*, double)* @hypre_SeqVectorSetConstantValues, variables: !2)
!44 = !DISubroutineType(types: !45)
!45 = !{!13, !4, !11}
!46 = !DISubprogram(name: "hypre_SeqVectorCopy", scope: !24, file: !24, line: 242, type: !47, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.hypre_Vector*, %struct.hypre_Vector*)* @hypre_SeqVectorCopy, variables: !2)
!47 = !DISubroutineType(types: !48)
!48 = !{!13, !4, !4}
!49 = !DISubprogram(name: "hypre_SeqVectorCloneDeep", scope: !24, file: !24, line: 266, type: !50, isLocal: false, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: false, function: %struct.hypre_Vector* (%struct.hypre_Vector*)* @hypre_SeqVectorCloneDeep, variables: !2)
!50 = !DISubroutineType(types: !51)
!51 = !{!4, !4}
!52 = !DISubprogram(name: "hypre_SeqVectorCloneShallow", scope: !24, file: !24, line: 287, type: !50, isLocal: false, isDefinition: true, scopeLine: 287, flags: DIFlagPrototyped, isOptimized: false, function: %struct.hypre_Vector* (%struct.hypre_Vector*)* @hypre_SeqVectorCloneShallow, variables: !2)
!53 = !DISubprogram(name: "hypre_SeqVectorScale", scope: !24, file: !24, line: 307, type: !54, isLocal: false, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: false, function: i32 (double, %struct.hypre_Vector*)* @hypre_SeqVectorScale, variables: !2)
!54 = !DISubroutineType(types: !55)
!55 = !{!13, !11, !4}
!56 = !DISubprogram(name: "hypre_SeqVectorAxpy", scope: !24, file: !24, line: 328, type: !57, isLocal: false, isDefinition: true, scopeLine: 330, flags: DIFlagPrototyped, isOptimized: false, function: i32 (double, %struct.hypre_Vector*, %struct.hypre_Vector*)* @hypre_SeqVectorAxpy, variables: !2)
!57 = !DISubroutineType(types: !58)
!58 = !{!13, !11, !4, !4}
!59 = !DISubprogram(name: "hypre_SeqVectorInnerProd", scope: !24, file: !24, line: 351, type: !60, isLocal: false, isDefinition: true, scopeLine: 352, flags: DIFlagPrototyped, isOptimized: false, function: double (%struct.hypre_Vector*, %struct.hypre_Vector*)* @hypre_SeqVectorInnerProd, variables: !2)
!60 = !DISubroutineType(types: !61)
!61 = !{!11, !4, !4}
!62 = !DISubprogram(name: "hypre_VectorSumElts", scope: !24, file: !24, line: 374, type: !63, isLocal: false, isDefinition: true, scopeLine: 374, flags: DIFlagPrototyped, isOptimized: false, function: double (%struct.hypre_Vector*)* @hypre_VectorSumElts, variables: !2)
!63 = !DISubroutineType(types: !64)
!64 = !{!11, !4}
!65 = !{i32 2, !"Dwarf Version", i32 4}
!66 = !{i32 2, !"Debug Info Version", i32 3}
!67 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!68 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !23, file: !24, line: 41, type: !13)
!69 = !DIExpression()
!70 = !DILocation(line: 41, column: 27, scope: !23)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vector", scope: !23, file: !24, line: 42, type: !4)
!72 = !DILocation(line: 42, column: 17, scope: !23)
!73 = !DILocation(line: 44, column: 12, scope: !23)
!74 = !DILocation(line: 44, column: 10, scope: !23)
!75 = !DILocation(line: 46, column: 3, scope: !23)
!76 = !DILocation(line: 46, column: 28, scope: !23)
!77 = !DILocation(line: 47, column: 30, scope: !23)
!78 = !DILocation(line: 47, column: 3, scope: !23)
!79 = !DILocation(line: 47, column: 28, scope: !23)
!80 = !DILocation(line: 49, column: 3, scope: !23)
!81 = !DILocation(line: 49, column: 34, scope: !23)
!82 = !DILocation(line: 50, column: 3, scope: !23)
!83 = !DILocation(line: 50, column: 45, scope: !23)
!84 = !DILocation(line: 53, column: 3, scope: !23)
!85 = !DILocation(line: 53, column: 32, scope: !23)
!86 = !DILocation(line: 55, column: 10, scope: !23)
!87 = !DILocation(line: 55, column: 3, scope: !23)
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !27, file: !24, line: 63, type: !13)
!89 = !DILocation(line: 63, column: 32, scope: !27)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_vectors", arg: 2, scope: !27, file: !24, line: 63, type: !13)
!91 = !DILocation(line: 63, column: 42, scope: !27)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vector", scope: !27, file: !24, line: 64, type: !4)
!93 = !DILocation(line: 64, column: 17, scope: !27)
!94 = !DILocation(line: 64, column: 48, scope: !27)
!95 = !DILocation(line: 64, column: 26, scope: !27)
!96 = !DILocation(line: 65, column: 36, scope: !27)
!97 = !DILocation(line: 65, column: 3, scope: !27)
!98 = !DILocation(line: 65, column: 34, scope: !27)
!99 = !DILocation(line: 66, column: 10, scope: !27)
!100 = !DILocation(line: 66, column: 3, scope: !27)
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vector", arg: 1, scope: !30, file: !24, line: 73, type: !4)
!102 = !DILocation(line: 73, column: 42, scope: !30)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !30, file: !24, line: 74, type: !13)
!104 = !DILocation(line: 74, column: 7, scope: !30)
!105 = !DILocation(line: 76, column: 7, scope: !106)
!106 = distinct !DILexicalBlock(scope: !30, file: !24, line: 76, column: 7)
!107 = !DILocation(line: 76, column: 7, scope: !30)
!108 = !DILocation(line: 77, column: 9, scope: !109)
!109 = distinct !DILexicalBlock(scope: !110, file: !24, line: 77, column: 9)
!110 = distinct !DILexicalBlock(scope: !106, file: !24, line: 76, column: 15)
!111 = !DILocation(line: 77, column: 9, scope: !110)
!112 = !DILocation(line: 78, column: 7, scope: !113)
!113 = distinct !DILexicalBlock(scope: !109, file: !24, line: 77, column: 39)
!114 = !DILocation(line: 79, column: 5, scope: !113)
!115 = !DILocation(line: 80, column: 5, scope: !110)
!116 = !DILocation(line: 81, column: 3, scope: !110)
!117 = !DILocation(line: 83, column: 10, scope: !30)
!118 = !DILocation(line: 83, column: 3, scope: !30)
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vector", arg: 1, scope: !33, file: !24, line: 90, type: !4)
!120 = !DILocation(line: 90, column: 45, scope: !33)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !33, file: !24, line: 91, type: !13)
!122 = !DILocation(line: 91, column: 7, scope: !33)
!123 = !DILocation(line: 91, column: 14, scope: !33)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !33, file: !24, line: 92, type: !13)
!125 = !DILocation(line: 92, column: 7, scope: !33)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_vectors", scope: !33, file: !24, line: 93, type: !13)
!127 = !DILocation(line: 93, column: 7, scope: !33)
!128 = !DILocation(line: 93, column: 21, scope: !33)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "multivec_storage_method", scope: !33, file: !24, line: 94, type: !13)
!130 = !DILocation(line: 94, column: 7, scope: !33)
!131 = !DILocation(line: 94, column: 33, scope: !33)
!132 = !DILocation(line: 96, column: 8, scope: !133)
!133 = distinct !DILexicalBlock(scope: !33, file: !24, line: 96, column: 7)
!134 = !DILocation(line: 96, column: 7, scope: !33)
!135 = !DILocation(line: 97, column: 32, scope: !133)
!136 = !DILocation(line: 97, column: 5, scope: !133)
!137 = !DILocation(line: 97, column: 30, scope: !133)
!138 = !DILocation(line: 99, column: 7, scope: !139)
!139 = distinct !DILexicalBlock(scope: !33, file: !24, line: 99, column: 7)
!140 = !DILocation(line: 99, column: 31, scope: !139)
!141 = !DILocation(line: 99, column: 7, scope: !33)
!142 = !DILocation(line: 100, column: 40, scope: !143)
!143 = distinct !DILexicalBlock(scope: !139, file: !24, line: 99, column: 37)
!144 = !DILocation(line: 100, column: 5, scope: !143)
!145 = !DILocation(line: 100, column: 38, scope: !143)
!146 = !DILocation(line: 101, column: 5, scope: !143)
!147 = !DILocation(line: 101, column: 37, scope: !143)
!148 = !DILocation(line: 102, column: 3, scope: !143)
!149 = !DILocation(line: 102, column: 14, scope: !150)
!150 = distinct !DILexicalBlock(scope: !139, file: !24, line: 102, column: 14)
!151 = !DILocation(line: 102, column: 38, scope: !150)
!152 = !DILocation(line: 102, column: 14, scope: !139)
!153 = !DILocation(line: 103, column: 5, scope: !154)
!154 = distinct !DILexicalBlock(scope: !150, file: !24, line: 102, column: 44)
!155 = !DILocation(line: 103, column: 38, scope: !154)
!156 = !DILocation(line: 104, column: 39, scope: !154)
!157 = !DILocation(line: 104, column: 5, scope: !154)
!158 = !DILocation(line: 104, column: 37, scope: !154)
!159 = !DILocation(line: 105, column: 3, scope: !154)
!160 = !DILocation(line: 106, column: 5, scope: !150)
!161 = !DILocation(line: 108, column: 10, scope: !33)
!162 = !DILocation(line: 108, column: 3, scope: !33)
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vector", arg: 1, scope: !34, file: !24, line: 115, type: !4)
!164 = !DILocation(line: 115, column: 47, scope: !34)
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "owns_data", arg: 2, scope: !34, file: !24, line: 116, type: !13)
!166 = !DILocation(line: 116, column: 37, scope: !34)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !34, file: !24, line: 117, type: !13)
!168 = !DILocation(line: 117, column: 7, scope: !34)
!169 = !DILocation(line: 119, column: 34, scope: !34)
!170 = !DILocation(line: 119, column: 3, scope: !34)
!171 = !DILocation(line: 119, column: 32, scope: !34)
!172 = !DILocation(line: 121, column: 10, scope: !34)
!173 = !DILocation(line: 121, column: 3, scope: !34)
!174 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file_name", arg: 1, scope: !37, file: !24, line: 129, type: !20)
!175 = !DILocation(line: 129, column: 27, scope: !37)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vector", scope: !37, file: !24, line: 130, type: !4)
!177 = !DILocation(line: 130, column: 17, scope: !37)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !37, file: !24, line: 132, type: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !181, line: 48, baseType: !182)
!181 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/tf/Benchmarks/ASC_Sequoia/AMGmk")
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !183, line: 241, size: 1728, align: 64, elements: !184)
!183 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/tf/Benchmarks/ASC_Sequoia/AMGmk")
!184 = !{!185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !205, !206, !207, !208, !212, !214, !216, !220, !223, !225, !227, !228, !229, !230, !234, !235}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !182, file: !183, line: 242, baseType: !13, size: 32, align: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !182, file: !183, line: 247, baseType: !20, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !182, file: !183, line: 248, baseType: !20, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !182, file: !183, line: 249, baseType: !20, size: 64, align: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !182, file: !183, line: 250, baseType: !20, size: 64, align: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !182, file: !183, line: 251, baseType: !20, size: 64, align: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !182, file: !183, line: 252, baseType: !20, size: 64, align: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !182, file: !183, line: 253, baseType: !20, size: 64, align: 64, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !182, file: !183, line: 254, baseType: !20, size: 64, align: 64, offset: 512)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !182, file: !183, line: 256, baseType: !20, size: 64, align: 64, offset: 576)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !182, file: !183, line: 257, baseType: !20, size: 64, align: 64, offset: 640)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !182, file: !183, line: 258, baseType: !20, size: 64, align: 64, offset: 704)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !182, file: !183, line: 260, baseType: !198, size: 64, align: 64, offset: 768)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !183, line: 156, size: 192, align: 64, elements: !200)
!200 = !{!201, !202, !204}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !199, file: !183, line: 157, baseType: !198, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !199, file: !183, line: 158, baseType: !203, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !199, file: !183, line: 162, baseType: !13, size: 32, align: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !182, file: !183, line: 262, baseType: !203, size: 64, align: 64, offset: 832)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !182, file: !183, line: 264, baseType: !13, size: 32, align: 32, offset: 896)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !182, file: !183, line: 268, baseType: !13, size: 32, align: 32, offset: 928)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !182, file: !183, line: 270, baseType: !209, size: 64, align: 64, offset: 960)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !210, line: 131, baseType: !211)
!210 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/tf/Benchmarks/ASC_Sequoia/AMGmk")
!211 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !182, file: !183, line: 274, baseType: !213, size: 16, align: 16, offset: 1024)
!213 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !182, file: !183, line: 275, baseType: !215, size: 8, align: 8, offset: 1040)
!215 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !182, file: !183, line: 276, baseType: !217, size: 8, align: 8, offset: 1048)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, align: 8, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 1)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !182, file: !183, line: 280, baseType: !221, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !183, line: 150, baseType: null)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !182, file: !183, line: 289, baseType: !224, size: 64, align: 64, offset: 1152)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !210, line: 132, baseType: !211)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !182, file: !183, line: 297, baseType: !226, size: 64, align: 64, offset: 1216)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !182, file: !183, line: 298, baseType: !226, size: 64, align: 64, offset: 1280)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !182, file: !183, line: 299, baseType: !226, size: 64, align: 64, offset: 1344)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !182, file: !183, line: 300, baseType: !226, size: 64, align: 64, offset: 1408)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !182, file: !183, line: 302, baseType: !231, size: 64, align: 64, offset: 1472)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !232, line: 62, baseType: !233)
!232 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/tf/Benchmarks/ASC_Sequoia/AMGmk")
!233 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !182, file: !183, line: 303, baseType: !13, size: 32, align: 32, offset: 1536)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !182, file: !183, line: 305, baseType: !236, size: 160, align: 8, offset: 1568)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 160, align: 8, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 20)
!239 = !DILocation(line: 132, column: 9, scope: !37)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !37, file: !24, line: 134, type: !10)
!241 = !DILocation(line: 134, column: 11, scope: !37)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !37, file: !24, line: 135, type: !13)
!243 = !DILocation(line: 135, column: 7, scope: !37)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !37, file: !24, line: 137, type: !13)
!245 = !DILocation(line: 137, column: 7, scope: !37)
!246 = !DILocation(line: 143, column: 14, scope: !37)
!247 = !DILocation(line: 143, column: 8, scope: !37)
!248 = !DILocation(line: 143, column: 6, scope: !37)
!249 = !DILocation(line: 145, column: 10, scope: !37)
!250 = !DILocation(line: 145, column: 3, scope: !37)
!251 = !DILocation(line: 147, column: 34, scope: !37)
!252 = !DILocation(line: 147, column: 12, scope: !37)
!253 = !DILocation(line: 147, column: 10, scope: !37)
!254 = !DILocation(line: 148, column: 29, scope: !37)
!255 = !DILocation(line: 148, column: 3, scope: !37)
!256 = !DILocation(line: 150, column: 10, scope: !37)
!257 = !DILocation(line: 150, column: 8, scope: !37)
!258 = !DILocation(line: 151, column: 10, scope: !259)
!259 = distinct !DILexicalBlock(scope: !37, file: !24, line: 151, column: 3)
!260 = !DILocation(line: 151, column: 8, scope: !259)
!261 = !DILocation(line: 151, column: 15, scope: !262)
!262 = !DILexicalBlockFile(scope: !263, file: !24, discriminator: 2)
!263 = !DILexicalBlockFile(scope: !264, file: !24, discriminator: 1)
!264 = distinct !DILexicalBlock(scope: !259, file: !24, line: 151, column: 3)
!265 = !DILocation(line: 151, column: 19, scope: !264)
!266 = !DILocation(line: 151, column: 17, scope: !264)
!267 = !DILocation(line: 151, column: 3, scope: !259)
!268 = !DILocation(line: 152, column: 12, scope: !269)
!269 = distinct !DILexicalBlock(scope: !264, file: !24, line: 151, column: 30)
!270 = !DILocation(line: 152, column: 29, scope: !269)
!271 = !DILocation(line: 152, column: 24, scope: !269)
!272 = !DILocation(line: 152, column: 5, scope: !269)
!273 = !DILocation(line: 153, column: 3, scope: !269)
!274 = !DILocation(line: 151, column: 26, scope: !264)
!275 = !DILocation(line: 151, column: 3, scope: !264)
!276 = !DILocation(line: 155, column: 10, scope: !37)
!277 = !DILocation(line: 155, column: 3, scope: !37)
!278 = !DILocation(line: 158, column: 3, scope: !279)
!279 = distinct !DILexicalBlock(scope: !37, file: !24, line: 158, column: 3)
!280 = !DILocation(line: 158, column: 3, scope: !37)
!281 = !DILocation(line: 158, column: 3, scope: !282)
!282 = !DILexicalBlockFile(scope: !283, file: !24, discriminator: 1)
!283 = distinct !DILexicalBlock(scope: !279, file: !24, line: 158, column: 3)
!284 = !DILocation(line: 160, column: 10, scope: !37)
!285 = !DILocation(line: 160, column: 3, scope: !37)
!286 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vector", arg: 1, scope: !40, file: !24, line: 167, type: !4)
!287 = !DILocation(line: 167, column: 40, scope: !40)
!288 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file_name", arg: 2, scope: !40, file: !24, line: 168, type: !20)
!289 = !DILocation(line: 168, column: 32, scope: !40)
!290 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !40, file: !24, line: 169, type: !179)
!291 = !DILocation(line: 169, column: 9, scope: !40)
!292 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !40, file: !24, line: 171, type: !10)
!293 = !DILocation(line: 171, column: 11, scope: !40)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !40, file: !24, line: 172, type: !13)
!295 = !DILocation(line: 172, column: 7, scope: !40)
