; ModuleID = '/home/gleison/tf/Benchmarks/mediabench/g721/g721encode/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.g72x_state = type { i64, i16, i16, i16, i16, [2 x i16], [6 x i16], [2 x i16], [6 x i16], [2 x i16], i8 }

@power2 = internal global [15 x i16] [i16 1, i16 2, i16 4, i16 8, i16 16, i16 32, i16 64, i16 128, i16 256, i16 512, i16 1024, i16 2048, i16 4096, i16 8192, i16 16384], align 16

; Function Attrs: nounwind uwtable
define void @g72x_init_state(%struct.g72x_state* %state_ptr) #0 {
entry:
  %state_ptr.addr = alloca %struct.g72x_state*, align 8
  %cnta = alloca i32, align 4
  store %struct.g72x_state* %state_ptr, %struct.g72x_state** %state_ptr.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.g72x_state** %state_ptr.addr, metadata !66, metadata !67), !dbg !68
  call void @llvm.dbg.declare(metadata i32* %cnta, metadata !69, metadata !67), !dbg !70
  %0 = load %struct.g72x_state*, %struct.g72x_state** %state_ptr.addr, align 8, !dbg !71
  %yl = getelementptr inbounds %struct.g72x_state, %struct.g72x_state* %0, i32 0, i32 0, !dbg !72
  store i64 34816, i64* %yl, align 8, !dbg !73
  %1 = load %struct.g72x_state*, %struct.g72x_state** %state_ptr.addr, align 8, !dbg !74
  %yu = getelementptr inbounds %struct.g72x_state, %struct.g72x_state* %1, i32 0, i32 1, !dbg !75
  store i16 544, i16* %yu, align 2, !dbg !76

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !58)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/mediabench/g721/g721encode")
!2 = !{}
!3 = !{!4, !32, !36, !37, !38, !42, !45, !48, !51, !52, !55}
!4 = !DISubprogram(name: "g72x_init_state", scope: !5, file: !5, line: 93, type: !6, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.g72x_state*)* @g72x_init_state, variables: !2)
!5 = !DIFile(filename: "/home/gleison/tf/Benchmarks/mediabench/g721/g721encode/tmp.c", directory: "/home/gleison/tf/Benchmarks/mediabench/g721/g721encode")
!6 = !DISubroutineType(types: !7)
!7 = !{null, !8}
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "g72x_state", file: !10, line: 49, size: 448, align: 64, elements: !11)
!10 = !DIFile(filename: "./g72x.h", directory: "/home/gleison/tf/Benchmarks/mediabench/g721/g721encode")
!11 = !{!12, !14, !16, !17, !18, !19, !23, !27, !28, !29, !30}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "yl", scope: !9, file: !10, line: 50, baseType: !13, size: 64, align: 64)
!13 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "yu", scope: !9, file: !10, line: 51, baseType: !15, size: 16, align: 16, offset: 64)
!15 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "dms", scope: !9, file: !10, line: 52, baseType: !15, size: 16, align: 16, offset: 80)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "dml", scope: !9, file: !10, line: 53, baseType: !15, size: 16, align: 16, offset: 96)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ap", scope: !9, file: !10, line: 54, baseType: !15, size: 16, align: 16, offset: 112)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !9, file: !10, line: 56, baseType: !20, size: 32, align: 16, offset: 128)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 32, align: 16, elements: !21)
!21 = !{!22}
!22 = !DISubrange(count: 2)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !9, file: !10, line: 57, baseType: !24, size: 96, align: 16, offset: 160)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 96, align: 16, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 6)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "pk", scope: !9, file: !10, line: 58, baseType: !20, size: 32, align: 16, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "dq", scope: !9, file: !10, line: 62, baseType: !24, size: 96, align: 16, offset: 288)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "sr", scope: !9, file: !10, line: 67, baseType: !20, size: 32, align: 16, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "td", scope: !9, file: !10, line: 72, baseType: !31, size: 8, align: 8, offset: 416)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DISubprogram(name: "predictor_zero", scope: !5, file: !5, line: 120, type: !33, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.g72x_state*)* @predictor_zero, variables: !2)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !8}
!35 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!36 = !DISubprogram(name: "predictor_pole", scope: !5, file: !5, line: 136, type: !33, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.g72x_state*)* @predictor_pole, variables: !2)
!37 = !DISubprogram(name: "step_size", scope: !5, file: !5, line: 147, type: !33, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.g72x_state*)* @step_size, variables: !2)
!38 = !DISubprogram(name: "quantize", scope: !5, file: !5, line: 176, type: !39, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i32, i16*, i32)* @quantize, variables: !2)
!39 = !DISubroutineType(types: !40)
!40 = !{!35, !35, !35, !41, !35}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!42 = !DISubprogram(name: "reconstruct", scope: !5, file: !5, line: 226, type: !43, isLocal: false, isDefinition: true, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i32, i32)* @reconstruct, variables: !2)
!43 = !DISubroutineType(types: !44)
!44 = !{!35, !35, !35, !35}
!45 = !DISubprogram(name: "update", scope: !5, file: !5, line: 253, type: !46, isLocal: false, isDefinition: true, scopeLine: 262, flags: DIFlagPrototyped, isOptimized: false, function: void (i32, i32, i32, i32, i32, i32, i32, %struct.g72x_state*)* @update, variables: !2)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !35, !35, !35, !35, !35, !35, !35, !8}
!48 = !DISubprogram(name: "tandem_adjust_alaw", scope: !5, file: !5, line: 458, type: !49, isLocal: false, isDefinition: true, scopeLine: 464, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i32, i32, i32, i32, i16*)* @tandem_adjust_alaw, variables: !2)
!49 = !DISubroutineType(types: !50)
!50 = !{!35, !35, !35, !35, !35, !35, !41}
!51 = !DISubprogram(name: "tandem_adjust_ulaw", scope: !5, file: !5, line: 501, type: !49, isLocal: false, isDefinition: true, scopeLine: 507, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i32, i32, i32, i32, i16*)* @tandem_adjust_ulaw, variables: !2)
!52 = !DISubprogram(name: "fmult", scope: !5, file: !5, line: 68, type: !53, isLocal: true, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i32)* @fmult, variables: !2)
!53 = !DISubroutineType(types: !54)
!54 = !{!35, !35, !35}
!55 = !DISubprogram(name: "quan", scope: !5, file: !5, line: 49, type: !56, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i16*, i32)* @quan, variables: !2)
!56 = !DISubroutineType(types: !57)
!57 = !{!35, !35, !41, !35}
!58 = !{!59}
!59 = !DIGlobalVariable(name: "power2", scope: !0, file: !5, line: 37, type: !60, isLocal: true, isDefinition: true, variable: [15 x i16]* @power2)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 240, align: 16, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 15)
!63 = !{i32 2, !"Dwarf Version", i32 4}
!64 = !{i32 2, !"Debug Info Version", i32 3}
!65 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state_ptr", arg: 1, scope: !4, file: !5, line: 94, type: !8)
!67 = !DIExpression()
!68 = !DILocation(line: 94, column: 24, scope: !4)
