; ModuleID = 'result.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._nodeVCGType = type { %struct._constraintVCGType*, i64, i64, i64, %struct._constraintVCGType*, i64, i64, i64 }
%struct._constraintVCGType = type { i64, i64, i64, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@channelNets = external global i64, align 8
@VCG = common global %struct._nodeVCGType* null, align 8
@storageRootVCG = common global %struct._constraintVCGType* null, align 8
@storageVCG = common global %struct._constraintVCGType* null, align 8
@storageLimitVCG = common global i64 0, align 8
@SCC = common global i64* null, align 8
@perSCC = common global i64* null, align 8
@removeVCG = common global %struct._constraintVCGType** null, align 8
@channelColumns = external global i64, align 8
@TOP = external global i64*, align 8
@BOT = external global i64*, align 8
@.str = private unnamed_addr constant [20 x i8] c"storageLimitVCG > 0\00", align 1
@.str.1 = private unnamed_addr constant [48 x i8] c"/home/gleison/tf/Benchmarks/Ptrdist/yacr2/tmp.c\00", align 1
@__PRETTY_FUNCTION__.BuildVCG = private unnamed_addr constant [16 x i8] c"void BuildVCG()\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !29, globals: !71)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/Ptrdist/yacr2")
!2 = !{}
!3 = !{!4, !10, !26, !27, !28}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "nodeVCGType", file: !6, line: 57, baseType: !7)
!6 = !DIFile(filename: "./vcg.h", directory: "/home/gleison/tf/Benchmarks/Ptrdist/yacr2")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "_nodeVCGType", file: !6, line: 48, size: 512, align: 64, elements: !8)
!8 = !{!9, !19, !20, !21, !22, !23, !24, !25}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "netsAboveHook", scope: !7, file: !6, line: 49, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "constraintVCGType", file: !6, line: 46, baseType: !12)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_constraintVCGType", file: !6, line: 41, size: 256, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !12, file: !6, line: 42, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "bot", scope: !12, file: !6, line: 43, baseType: !15, size: 64, align: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !12, file: !6, line: 44, baseType: !15, size: 64, align: 64, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "removed", scope: !12, file: !6, line: 45, baseType: !15, size: 64, align: 64, offset: 192)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "netsAbove", scope: !7, file: !6, line: 50, baseType: !15, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "netsAboveLabel", scope: !7, file: !6, line: 51, baseType: !15, size: 64, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "netsAboveReached", scope: !7, file: !6, line: 52, baseType: !15, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "netsBelowHook", scope: !7, file: !6, line: 53, baseType: !10, size: 64, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "netsBelow", scope: !7, file: !6, line: 54, baseType: !15, size: 64, align: 64, offset: 320)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "netsBelowLabel", scope: !7, file: !6, line: 55, baseType: !15, size: 64, align: 64, offset: 384)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "netsBelowReached", scope: !7, file: !6, line: 56, baseType: !15, size: 64, align: 64, offset: 448)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!29 = !{!30, !34, !35, !36, !39, !40, !43, !44, !47, !50, !53, !56, !57, !60, !63, !64, !67, !68}
!30 = !DISubprogram(name: "AllocVCG", scope: !31, file: !31, line: 30, type: !32, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @AllocVCG, variables: !2)
!31 = !DIFile(filename: "/home/gleison/tf/Benchmarks/Ptrdist/yacr2/tmp.c", directory: "/home/gleison/tf/Benchmarks/Ptrdist/yacr2")
!32 = !DISubroutineType(types: !33)
!33 = !{null}
!34 = !DISubprogram(name: "FreeVCG", scope: !31, file: !31, line: 40, type: !32, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @FreeVCG, variables: !2)
!35 = !DISubprogram(name: "BuildVCG", scope: !31, file: !31, line: 49, type: !32, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @BuildVCG, variables: !2)
!36 = !DISubprogram(name: "DFSClearVCG", scope: !31, file: !31, line: 137, type: !37, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct._nodeVCGType*)* @DFSClearVCG, variables: !2)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !4}
!39 = !DISubprogram(name: "DumpVCG", scope: !31, file: !31, line: 148, type: !37, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct._nodeVCGType*)* @DumpVCG, variables: !2)
!40 = !DISubprogram(name: "DFSAboveVCG", scope: !31, file: !31, line: 174, type: !41, isLocal: false, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct._nodeVCGType*, i64)* @DFSAboveVCG, variables: !2)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !4, !15}
!43 = !DISubprogram(name: "DFSBelowVCG", scope: !31, file: !31, line: 191, type: !41, isLocal: false, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct._nodeVCGType*, i64)* @DFSBelowVCG, variables: !2)
!44 = !DISubprogram(name: "SCCofVCG", scope: !31, file: !31, line: 208, type: !45, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct._nodeVCGType*, i64*, i64*)* @SCCofVCG, variables: !2)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !4, !26, !26}
!47 = !DISubprogram(name: "SCC_DFSAboveVCG", scope: !31, file: !31, line: 285, type: !48, isLocal: false, isDefinition: true, scopeLine: 287, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct._nodeVCGType*, i64, i64*)* @SCC_DFSAboveVCG, variables: !2)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !4, !15, !26}
!50 = !DISubprogram(name: "SCC_DFSBelowVCG", scope: !31, file: !31, line: 305, type: !51, isLocal: false, isDefinition: true, scopeLine: 307, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct._nodeVCGType*, i64, i64)* @SCC_DFSBelowVCG, variables: !2)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !4, !15, !15}
!53 = !DISubprogram(name: "DumpSCC", scope: !31, file: !31, line: 324, type: !54, isLocal: false, isDefinition: true, scopeLine: 325, flags: DIFlagPrototyped, isOptimized: false, function: void (i64*, i64*)* @DumpSCC, variables: !2)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !26, !26}
!56 = !DISubprogram(name: "AcyclicVCG", scope: !31, file: !31, line: 342, type: !32, isLocal: false, isDefinition: true, scopeLine: 342, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @AcyclicVCG, variables: !2)
