; ModuleID = '/home/gleison/tf/Benchmarks/TSVC/ControlLoops-flt/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GlobalData = type { [32000 x float], [3 x i32], [4 x i8], [32000 x float], [5 x i32], [12 x i8], [32000 x float], [7 x i32], [4 x i8], [32000 x float], [11 x i32], [4 x i8], [32000 x float], [13 x i32], [12 x i8], [256 x [256 x float]], [17 x i32], [12 x i8], [256 x [256 x float]], [19 x i32], [4 x i8], [256 x [256 x float]], [23 x i32], [4 x i8], [256 x [256 x float]] }

@global_data = common global %struct.GlobalData zeroinitializer, align 16
@a = constant float* getelementptr inbounds (%struct.GlobalData, %struct.GlobalData* @global_data, i32 0, i32 0, i32 0), align 16
@b = constant float* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 128016) to float*), align 16
@c = constant float* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 256048) to float*), align 16
@d = constant float* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 384080) to float*), align 16
@e = constant float* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 512128) to float*), align 16
@aa = constant [256 x float]* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 640192) to [256 x float]*), align 16

!50 = !DISubprogram(name: "vtv", scope: !10, file: !10, line: 5302, type: !40, isLocal: false, isDefinition: true, scopeLine: 5303, isOptimized: false, function: i32 ()* @vtv, variables: !2)
!51 = !DISubprogram(name: "vpvtv", scope: !10, file: !10, line: 5330, type: !40, isLocal: false, isDefinition: true, scopeLine: 5331, isOptimized: false, function: i32 ()* @vpvtv, variables: !2)
!52 = !DISubprogram(name: "vpvts", scope: !10, file: !10, line: 5357, type: !53, isLocal: false, isDefinition: true, scopeLine: 5358, flags: DIFlagPrototyped, isOptimized: false, function: i32 (float)* @vpvts, variables: !2)
!53 = !DISubroutineType(types: !54)
!54 = !{!13, !4}
!55 = !DISubprogram(name: "vpvpv", scope: !10, file: !10, line: 5384, type: !40, isLocal: false, isDefinition: true, scopeLine: 5385, isOptimized: false, function: i32 ()* @vpvpv, variables: !2)
!56 = !DISubprogram(name: "vtvtv", scope: !10, file: !10, line: 5411, type: !40, isLocal: false, isDefinition: true, scopeLine: 5412, isOptimized: false, function: i32 ()* @vtvtv, variables: !2)
!57 = !DISubprogram(name: "vsumr", scope: !10, file: !10, line: 5438, type: !40, isLocal: false, isDefinition: true, scopeLine: 5439, isOptimized: false, function: i32 ()* @vsumr, variables: !2)
!58 = !DISubprogram(name: "vdotr", scope: !10, file: !10, line: 5467, type: !40, isLocal: false, isDefinition: true, scopeLine: 5468, isOptimized: false, function: i32 ()* @vdotr, variables: !2)
!59 = !DISubprogram(name: "vbor", scope: !10, file: !10, line: 5497, type: !40, isLocal: false, isDefinition: true, scopeLine: 5498, isOptimized: false, function: i32 ()* @vbor, variables: !2)
!60 = !DISubprogram(name: "set", scope: !10, file: !10, line: 5543, type: !61, isLocal: false, isDefinition: true, scopeLine: 5543, flags: DIFlagPrototyped, isOptimized: false, function: void (i32*, float*, float*)* @set, variables: !2)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !46, !14, !14}
!63 = !DISubprogram(name: "main", scope: !10, file: !10, line: 5572, type: !64, isLocal: false, isDefinition: true, scopeLine: 5572, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !2)
!64 = !DISubroutineType(types: !65)
!65 = !{!13, !13, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!67 = !{!68, !70, !71, !72, !73, !74, !76, !77, !78, !79, !83, !84, !85, !86, !87, !91, !92, !93, !94, !140, !142, !144, !145, !146}
!68 = !DIGlobalVariable(name: "a", scope: !0, file: !10, line: 100, type: !69, isLocal: false, isDefinition: true, variable: float** @a)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!70 = !DIGlobalVariable(name: "b", scope: !0, file: !10, line: 101, type: !69, isLocal: false, isDefinition: true, variable: float** @b)
!71 = !DIGlobalVariable(name: "c", scope: !0, file: !10, line: 102, type: !69, isLocal: false, isDefinition: true, variable: float** @c)
!72 = !DIGlobalVariable(name: "d", scope: !0, file: !10, line: 103, type: !69, isLocal: false, isDefinition: true, variable: float** @d)
!73 = !DIGlobalVariable(name: "e", scope: !0, file: !10, line: 104, type: !69, isLocal: false, isDefinition: true, variable: float** @e)
!74 = !DIGlobalVariable(name: "aa", scope: !0, file: !10, line: 105, type: !75, isLocal: false, isDefinition: true, variable: [256 x float]** @aa)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!76 = !DIGlobalVariable(name: "bb", scope: !0, file: !10, line: 106, type: !75, isLocal: false, isDefinition: true, variable: [256 x float]** @bb)
!77 = !DIGlobalVariable(name: "cc", scope: !0, file: !10, line: 107, type: !75, isLocal: false, isDefinition: true, variable: [256 x float]** @cc)
!78 = !DIGlobalVariable(name: "tt", scope: !0, file: !10, line: 108, type: !75, isLocal: false, isDefinition: true, variable: [256 x float]** @tt)
!79 = !DIGlobalVariable(name: "X", scope: !0, file: !10, line: 59, type: !80, isLocal: false, isDefinition: true, variable: [32000 x float]* @X)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024000, align: 32, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 32000)
!83 = !DIGlobalVariable(name: "Y", scope: !0, file: !10, line: 59, type: !80, isLocal: false, isDefinition: true, variable: [32000 x float]* @Y)
!84 = !DIGlobalVariable(name: "Z", scope: !0, file: !10, line: 59, type: !80, isLocal: false, isDefinition: true, variable: [32000 x float]* @Z)
!85 = !DIGlobalVariable(name: "U", scope: !0, file: !10, line: 59, type: !80, isLocal: false, isDefinition: true, variable: [32000 x float]* @U)
!86 = !DIGlobalVariable(name: "V", scope: !0, file: !10, line: 59, type: !80, isLocal: false, isDefinition: true, variable: [32000 x float]* @V)
!87 = !DIGlobalVariable(name: "array", scope: !0, file: !10, line: 63, type: !88, isLocal: false, isDefinition: true, variable: [65536 x float]* @array)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2097152, align: 32, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 65536)
!91 = !DIGlobalVariable(name: "x", scope: !0, file: !10, line: 65, type: !80, isLocal: false, isDefinition: true, variable: [32000 x float]* @x)
!92 = !DIGlobalVariable(name: "temp", scope: !0, file: !10, line: 66, type: !4, isLocal: false, isDefinition: true, variable: float* @temp)
!93 = !DIGlobalVariable(name: "temp_int", scope: !0, file: !10, line: 67, type: !13, isLocal: false, isDefinition: true, variable: i32* @temp_int)
!94 = !DIGlobalVariable(name: "global_data", scope: !0, file: !10, line: 98, type: !95, isLocal: false, isDefinition: true, variable: %struct.GlobalData* @global_data)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalData", file: !10, line: 79, size: 13512192, align: 128, elements: !96)
!96 = !{!97, !98, !102, !103, !107, !108, !112, !113, !117, !118, !122, !125, !129, !130, !134, !135, !139}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !95, file: !10, line: 80, baseType: !80, size: 1024000, align: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !95, file: !10, line: 81, baseType: !99, size: 96, align: 32, offset: 1024000)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 96, align: 32, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 3)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !95, file: !10, line: 82, baseType: !80, size: 1024000, align: 32, offset: 1024128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !95, file: !10, line: 83, baseType: !104, size: 160, align: 32, offset: 2048128)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 160, align: 32, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 5)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !95, file: !10, line: 84, baseType: !80, size: 1024000, align: 32, offset: 2048384)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !95, file: !10, line: 85, baseType: !109, size: 224, align: 32, offset: 3072384)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 224, align: 32, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 7)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !95, file: !10, line: 86, baseType: !80, size: 1024000, align: 32, offset: 3072640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !95, file: !10, line: 87, baseType: !114, size: 352, align: 32, offset: 4096640)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 352, align: 32, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 11)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !95, file: !10, line: 88, baseType: !80, size: 1024000, align: 32, offset: 4097024)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !95, file: !10, line: 90, baseType: !119, size: 416, align: 32, offset: 5121024)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 416, align: 32, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 13)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !95, file: !10, line: 91, baseType: !123, size: 2097152, align: 32, offset: 5121536)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2097152, align: 32, elements: !124)
!124 = !{!24, !24}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pad6", scope: !95, file: !10, line: 92, baseType: !126, size: 544, align: 32, offset: 7218688)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 544, align: 32, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 17)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !95, file: !10, line: 93, baseType: !123, size: 2097152, align: 32, offset: 7219328)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "pad7", scope: !95, file: !10, line: 94, baseType: !131, size: 608, align: 32, offset: 9316480)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 608, align: 32, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 19)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "cc", scope: !95, file: !10, line: 95, baseType: !123, size: 2097152, align: 32, offset: 9317120)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "pad8", scope: !95, file: !10, line: 96, baseType: !136, size: 736, align: 32, offset: 11414272)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 736, align: 32, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 23)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !95, file: !10, line: 97, baseType: !123, size: 2097152, align: 32, offset: 11415040)
!140 = !DIGlobalVariable(name: "indx", scope: !0, file: !10, line: 110, type: !141, isLocal: false, isDefinition: true, variable: [32000 x i32]* @indx)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 1024000, align: 32, elements: !81)
!142 = !DIGlobalVariable(name: "xx", scope: !0, file: !10, line: 113, type: !143, isLocal: false, isDefinition: true, variable: float** @xx)
!143 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !14)
!144 = !DIGlobalVariable(name: "yy", scope: !0, file: !10, line: 114, type: !14, isLocal: false, isDefinition: true, variable: float** @yy)
!145 = !DIGlobalVariable(name: "digits", scope: !0, file: !10, line: 40, type: !13, isLocal: true, isDefinition: true, variable: i32* @digits)
!146 = !DIGlobalVariable(name: "ntimes", scope: !0, file: !10, line: 39, type: !13, isLocal: true, isDefinition: true, variable: i32* @ntimes)
!147 = !{i32 2, !"Dwarf Version", i32 4}
!148 = !{i32 2, !"Debug Info Version", i32 3}
!149 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arr", arg: 1, scope: !9, file: !10, line: 120, type: !14)
!151 = !DIExpression()
!152 = !DILocation(line: 120, column: 16, scope: !9)
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !9, file: !10, line: 120, type: !4)
!154 = !DILocation(line: 120, column: 31, scope: !9)
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stride", arg: 3, scope: !9, file: !10, line: 120, type: !13)
!156 = !DILocation(line: 120, column: 42, scope: !9)
!157 = !DILocation(line: 122, column: 6, scope: !158)
!158 = distinct !DILexicalBlock(scope: !9, file: !10, line: 122, column: 6)
!159 = !DILocation(line: 122, column: 13, scope: !158)
!160 = !DILocation(line: 122, column: 6, scope: !9)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !162, file: !10, line: 123, type: !13)
!162 = distinct !DILexicalBlock(scope: !163, file: !10, line: 123, column: 3)
!163 = distinct !DILexicalBlock(scope: !158, file: !10, line: 122, column: 20)
!164 = !DILocation(line: 123, column: 12, scope: !162)
!165 = !DILocation(line: 123, column: 8, scope: !162)
!166 = !DILocation(line: 123, column: 19, scope: !167)
!167 = !DILexicalBlockFile(scope: !168, file: !10, discriminator: 2)
!168 = !DILexicalBlockFile(scope: !169, file: !10, discriminator: 1)
!169 = distinct !DILexicalBlock(scope: !162, file: !10, line: 123, column: 3)
!170 = !DILocation(line: 123, column: 21, scope: !169)
!171 = !DILocation(line: 123, column: 3, scope: !162)
!172 = !DILocation(line: 124, column: 26, scope: !173)
!173 = distinct !DILexicalBlock(scope: !169, file: !10, line: 123, column: 33)
!174 = !DILocation(line: 124, column: 27, scope: !173)
!175 = !DILocation(line: 124, column: 18, scope: !173)
!176 = !DILocation(line: 124, column: 16, scope: !173)
!177 = !DILocation(line: 124, column: 13, scope: !173)
!178 = !DILocation(line: 124, column: 8, scope: !173)
!179 = !DILocation(line: 124, column: 4, scope: !173)
!180 = !DILocation(line: 124, column: 11, scope: !173)
!181 = !DILocation(line: 125, column: 3, scope: !173)
!182 = !DILocation(line: 123, column: 29, scope: !169)
!183 = !DILocation(line: 123, column: 3, scope: !169)
!184 = !DILocation(line: 126, column: 2, scope: !163)
!185 = !DILocation(line: 126, column: 13, scope: !186)
!186 = distinct !DILexicalBlock(scope: !158, file: !10, line: 126, column: 13)
!187 = !DILocation(line: 126, column: 20, scope: !186)
!188 = !DILocation(line: 126, column: 13, scope: !158)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !190, file: !10, line: 127, type: !13)
!190 = distinct !DILexicalBlock(scope: !191, file: !10, line: 127, column: 3)
!191 = distinct !DILexicalBlock(scope: !186, file: !10, line: 126, column: 27)
!192 = !DILocation(line: 127, column: 12, scope: !190)
