; ModuleID = '/home/gleison/tf/Benchmarks/Prolangs-C/simulator/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SYMBOL_TABLE_ENTRY = type { [9 x i8], [9 x i8], i32, i32, i32, %struct.SYMBOL_TABLE_ENTRY* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [15 x i8] c"%s            \00", align 1
@.str.1 = private unnamed_addr constant [15 x i8] c"          %s  \00", align 1
@.str.2 = private unnamed_addr constant [11 x i8] c"Undefined \00", align 1
@.str.3 = private unnamed_addr constant [7 x i8] c"%s    \00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str.5 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1
@.str.6 = private unnamed_addr constant [18 x i8] c"CONTROL   SYMBOL\0A\00", align 1
@.str.7 = private unnamed_addr constant [37 x i8] c"SECTION   NAME     ADDRESS   LENGTH\0A\00", align 1
@.str.8 = private unnamed_addr constant [37 x i8] c"-----------------------------------\0A\00", align 1
@.str.9 = private unnamed_addr constant [4 x i8] c"M%s\00", align 1
@.str.10 = private unnamed_addr constant [9 x i8] c"_GLOBAL \00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !12, subprograms: !15, globals: !102)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/simulator")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kind", file: !4, line: 8, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./sym_tab.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/simulator")
!5 = !{!6, !7, !8, !9, !10, !11}
!6 = !DIEnumerator(name: "RELATIVE", value: 0)
!7 = !DIEnumerator(name: "ABSOLUTE", value: 1)
!8 = !DIEnumerator(name: "EXTERN_REF", value: 2)
!9 = !DIEnumerator(name: "MODULE", value: 3)
!10 = !DIEnumerator(name: "GLOBAL", value: 4)
!11 = !DIEnumerator(name: "UNDEFINED", value: 5)
!12 = !{!13, !14}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !{!16, !95, !96, !97}
!16 = !DISubprogram(name: "PRINT_TABLE", scope: !17, file: !17, line: 18, type: !18, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.SYMBOL_TABLE_ENTRY*, %struct._IO_FILE*)* @PRINT_TABLE, variables: !94)
!17 = !DIFile(filename: "/home/gleison/tf/Benchmarks/Prolangs-C/simulator/tmp.c", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/simulator")
!18 = !DISubroutineType(types: !19)
!19 = !{null, !20, !34}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYMBOL_TABLE", file: !4, line: 23, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "SYMBOL_TABLE_ENTRY", file: !4, line: 11, size: 320, align: 64, elements: !23)
!23 = !{!24, !29, !30, !31, !32, !33}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "LABEL", scope: !22, file: !4, line: 12, baseType: !25, size: 72, align: 8)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 72, align: 8, elements: !27)
!26 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!27 = !{!28}
!28 = !DISubrange(count: 9)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "MODULE", scope: !22, file: !4, line: 13, baseType: !25, size: 72, align: 8, offset: 72)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "LOCATION", scope: !22, file: !4, line: 15, baseType: !14, size: 32, align: 32, offset: 160)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "LENGTH", scope: !22, file: !4, line: 19, baseType: !14, size: 32, align: 32, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !22, file: !4, line: 21, baseType: !3, size: 32, align: 32, offset: 224)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "NEXT", scope: !22, file: !4, line: 22, baseType: !21, size: 64, align: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !36, line: 48, baseType: !37)
!36 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/simulator")
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 241, size: 1728, align: 64, elements: !39)
!38 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/simulator")
!39 = !{!40, !41, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !61, !62, !63, !64, !68, !70, !72, !76, !79, !81, !82, !83, !84, !85, !89, !90}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !37, file: !38, line: 242, baseType: !14, size: 32, align: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !37, file: !38, line: 247, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !37, file: !38, line: 248, baseType: !42, size: 64, align: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !37, file: !38, line: 249, baseType: !42, size: 64, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !37, file: !38, line: 250, baseType: !42, size: 64, align: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !37, file: !38, line: 251, baseType: !42, size: 64, align: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !37, file: !38, line: 252, baseType: !42, size: 64, align: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !37, file: !38, line: 253, baseType: !42, size: 64, align: 64, offset: 448)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !37, file: !38, line: 254, baseType: !42, size: 64, align: 64, offset: 512)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !37, file: !38, line: 256, baseType: !42, size: 64, align: 64, offset: 576)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !37, file: !38, line: 257, baseType: !42, size: 64, align: 64, offset: 640)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !37, file: !38, line: 258, baseType: !42, size: 64, align: 64, offset: 704)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !37, file: !38, line: 260, baseType: !54, size: 64, align: 64, offset: 768)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !38, line: 156, size: 192, align: 64, elements: !56)
!56 = !{!57, !58, !60}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !55, file: !38, line: 157, baseType: !54, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !55, file: !38, line: 158, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !55, file: !38, line: 162, baseType: !14, size: 32, align: 32, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !37, file: !38, line: 262, baseType: !59, size: 64, align: 64, offset: 832)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !37, file: !38, line: 264, baseType: !14, size: 32, align: 32, offset: 896)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !37, file: !38, line: 268, baseType: !14, size: 32, align: 32, offset: 928)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !37, file: !38, line: 270, baseType: !65, size: 64, align: 64, offset: 960)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !66, line: 131, baseType: !67)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/simulator")
!67 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !37, file: !38, line: 274, baseType: !69, size: 16, align: 16, offset: 1024)
!69 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !37, file: !38, line: 275, baseType: !71, size: 8, align: 8, offset: 1040)
!71 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !37, file: !38, line: 276, baseType: !73, size: 8, align: 8, offset: 1048)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8, align: 8, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 1)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !37, file: !38, line: 280, baseType: !77, size: 64, align: 64, offset: 1088)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !38, line: 150, baseType: null)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !37, file: !38, line: 289, baseType: !80, size: 64, align: 64, offset: 1152)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !66, line: 132, baseType: !67)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !37, file: !38, line: 297, baseType: !13, size: 64, align: 64, offset: 1216)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !37, file: !38, line: 298, baseType: !13, size: 64, align: 64, offset: 1280)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !37, file: !38, line: 299, baseType: !13, size: 64, align: 64, offset: 1344)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !37, file: !38, line: 300, baseType: !13, size: 64, align: 64, offset: 1408)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !37, file: !38, line: 302, baseType: !86, size: 64, align: 64, offset: 1472)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !87, line: 62, baseType: !88)
!87 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/simulator")
!88 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !37, file: !38, line: 303, baseType: !14, size: 32, align: 32, offset: 1536)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !37, file: !38, line: 305, baseType: !91, size: 160, align: 8, offset: 1568)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 160, align: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 20)
!94 = !{}
!95 = !DISubprogram(name: "PRT_SYM_TAB", scope: !17, file: !17, line: 50, type: !18, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.SYMBOL_TABLE_ENTRY*, %struct._IO_FILE*)* @PRT_SYM_TAB, variables: !94)
!96 = !DISubprogram(name: "OUTPUT_TABLE", scope: !17, file: !17, line: 59, type: !18, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.SYMBOL_TABLE_ENTRY*, %struct._IO_FILE*)* @OUTPUT_TABLE, variables: !94)
!97 = !DISubprogram(name: "PRINT_EXEC", scope: !17, file: !17, line: 88, type: !98, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, function: void (i8*, %struct.SYMBOL_TABLE_ENTRY*, %struct._IO_FILE*)* @PRINT_EXEC, variables: !94)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !100, !20, !34}
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "MEM_SPACE", file: !101, line: 9, baseType: !42)
!101 = !DIFile(filename: "./memory.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/simulator")
!102 = !{!103, !105}
!103 = !DIGlobalVariable(name: "START_ADDRESS", scope: !0, file: !104, line: 8, type: !14, isLocal: false, isDefinition: true, variable: i32* @START_ADDRESS)
!104 = !DIFile(filename: "./load.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/simulator")
!105 = !DIGlobalVariable(name: "MAIN_ROUTINE", scope: !0, file: !104, line: 12, type: !25, isLocal: false, isDefinition: true, variable: [9 x i8]* @MAIN_ROUTINE)
!106 = !{i32 2, !"Dwarf Version", i32 4}
!107 = !{i32 2, !"Debug Info Version", i32 3}
!108 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "SYM_TAB", arg: 1, scope: !16, file: !17, line: 18, type: !20)
!110 = !DIExpression()
!111 = !DILocation(line: 18, column: 31, scope: !16)
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "OUTPUT", arg: 2, scope: !16, file: !17, line: 18, type: !34)
!113 = !DILocation(line: 18, column: 46, scope: !16)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "TEMP", scope: !16, file: !17, line: 19, type: !115)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 48, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 6)
!118 = !DILocation(line: 19, column: 8, scope: !16)
!119 = !DILocation(line: 22, column: 7, scope: !120)
!120 = distinct !DILexicalBlock(scope: !16, file: !17, line: 22, column: 7)
!121 = !DILocation(line: 22, column: 15, scope: !120)
!122 = !DILocation(line: 22, column: 7, scope: !16)
!123 = !DILocation(line: 24, column: 19, scope: !124)
!124 = distinct !DILexicalBlock(scope: !120, file: !17, line: 22, column: 24)
!125 = !DILocation(line: 24, column: 28, scope: !124)
!126 = !DILocation(line: 24, column: 34, scope: !124)
!127 = !DILocation(line: 24, column: 5, scope: !124)
!128 = !DILocation(line: 26, column: 11, scope: !129)
!129 = distinct !DILexicalBlock(scope: !124, file: !17, line: 26, column: 9)
!130 = !DILocation(line: 26, column: 20, scope: !129)
!131 = !DILocation(line: 26, column: 25, scope: !129)
!132 = !DILocation(line: 26, column: 9, scope: !124)
!133 = !DILocation(line: 27, column: 21, scope: !129)
!134 = !DILocation(line: 27, column: 49, scope: !129)
!135 = !DILocation(line: 27, column: 58, scope: !129)
!136 = !DILocation(line: 27, column: 47, scope: !129)
!137 = !DILocation(line: 27, column: 13, scope: !129)
!138 = !DILocation(line: 27, column: 7, scope: !129)
!139 = !DILocation(line: 29, column: 21, scope: !129)
!140 = !DILocation(line: 29, column: 49, scope: !129)
!141 = !DILocation(line: 29, column: 58, scope: !129)
!142 = !DILocation(line: 29, column: 47, scope: !129)
