; ModuleID = '/home/gleison/tf/Benchmarks/MiBench/network-dijkstra/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._QITEM = type { i32, i32, i32, %struct._QITEM* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._NODE = type { i32, i32 }

@qHead = global %struct._QITEM* null, align 8
@g_qCount = global i32 0, align 4
@.str = private unnamed_addr constant [4 x i8] c" %d\00", align 1
@stdout = external global %struct._IO_FILE*, align 8
@stderr = external global %struct._IO_FILE*, align 8
@.str.1 = private unnamed_addr constant [16 x i8] c"Out of memory.\0A\00", align 1
@ch = common global i32 0, align 4
@rgnNodes = common global [100 x %struct._NODE] zeroinitializer, align 16
@.str.2 = private unnamed_addr constant [54 x i8] c"Shortest path is 0 in cost. Just stay where you are.\0A\00", align 1
@iNode = common global i32 0, align 4
@iDist = common global i32 0, align 4
@iPrev = common global i32 0, align 4
@i = common global i32 0, align 4
@AdjMatrix = common global [100 x [100 x i32]] zeroinitializer, align 16
@iCost = common global i32 0, align 4
@.str.3 = private unnamed_addr constant [30 x i8] c"Shortest path is %d in cost. \00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !15, globals: !44)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/MiBench/network-dijkstra")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "QITEM", file: !6, line: 19, baseType: !7)
!6 = !DIFile(filename: "/home/gleison/tf/Benchmarks/MiBench/network-dijkstra/tmp.c", directory: "/home/gleison/tf/Benchmarks/MiBench/network-dijkstra")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !6, line: 13, size: 192, align: 64, elements: !8)
!8 = !{!9, !11, !12, !13}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "iNode", scope: !7, file: !6, line: 14, baseType: !10, size: 32, align: 32)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "iDist", scope: !7, file: !6, line: 15, baseType: !10, size: 32, align: 32, offset: 32)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "iPrev", scope: !7, file: !6, line: 16, baseType: !10, size: 32, align: 32, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "qNext", scope: !7, file: !6, line: 17, baseType: !14, size: 64, align: 64, offset: 128)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!15 = !{!16, !25, !28, !32, !35, !38}
!16 = !DISubprogram(name: "print_path", scope: !6, file: !6, line: 31, type: !17, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct._NODE*, i32)* @print_path, variables: !2)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !19, !10}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "NODE", file: !6, line: 11, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !6, line: 7, size: 64, align: 32, elements: !22)
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "iDist", scope: !21, file: !6, line: 8, baseType: !10, size: 32, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "iPrev", scope: !21, file: !6, line: 9, baseType: !10, size: 32, align: 32, offset: 32)
!25 = !DISubprogram(name: "enqueue", scope: !6, file: !6, line: 39, type: !26, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false, function: void (i32, i32, i32)* @enqueue, variables: !2)
!26 = !DISubroutineType(types: !27)
!27 = !{null, !10, !10, !10}
!28 = !DISubprogram(name: "dequeue", scope: !6, file: !6, line: 63, type: !29, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, function: void (i32*, i32*, i32*)* @dequeue, variables: !2)
!29 = !DISubroutineType(types: !30)
!30 = !{null, !31, !31, !31}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!32 = !DISubprogram(name: "qcount", scope: !6, file: !6, line: 77, type: !33, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, function: i32 ()* @qcount, variables: !2)
!33 = !DISubroutineType(types: !34)
!34 = !{!10}
!35 = !DISubprogram(name: "dijkstra", scope: !6, file: !6, line: 81, type: !36, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i32)* @dijkstra, variables: !2)
!36 = !DISubroutineType(types: !37)
!37 = !{!10, !10, !10}
!38 = !DISubprogram(name: "main", scope: !6, file: !6, line: 117, type: !39, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !2)
!39 = !DISubroutineType(types: !40)
!40 = !{!10, !10, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!44 = !{!45, !46, !47, !51, !54, !55, !56, !57, !58, !59}
!45 = !DIGlobalVariable(name: "qHead", scope: !0, file: !6, line: 21, type: !4, isLocal: false, isDefinition: true, variable: %struct._QITEM** @qHead)
!46 = !DIGlobalVariable(name: "g_qCount", scope: !0, file: !6, line: 25, type: !10, isLocal: false, isDefinition: true, variable: i32* @g_qCount)
!47 = !DIGlobalVariable(name: "AdjMatrix", scope: !0, file: !6, line: 23, type: !48, isLocal: false, isDefinition: true, variable: [100 x [100 x i32]]* @AdjMatrix)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 320000, align: 32, elements: !49)
!49 = !{!50, !50}
!50 = !DISubrange(count: 100)
!51 = !DIGlobalVariable(name: "rgnNodes", scope: !0, file: !6, line: 26, type: !52, isLocal: false, isDefinition: true, variable: [100 x %struct._NODE]* @rgnNodes)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 6400, align: 32, elements: !53)
!53 = !{!50}
!54 = !DIGlobalVariable(name: "ch", scope: !0, file: !6, line: 27, type: !10, isLocal: false, isDefinition: true, variable: i32* @ch)
!55 = !DIGlobalVariable(name: "iPrev", scope: !0, file: !6, line: 28, type: !10, isLocal: false, isDefinition: true, variable: i32* @iPrev)
!56 = !DIGlobalVariable(name: "iNode", scope: !0, file: !6, line: 28, type: !10, isLocal: false, isDefinition: true, variable: i32* @iNode)
!57 = !DIGlobalVariable(name: "i", scope: !0, file: !6, line: 29, type: !10, isLocal: false, isDefinition: true, variable: i32* @i)
!58 = !DIGlobalVariable(name: "iCost", scope: !0, file: !6, line: 29, type: !10, isLocal: false, isDefinition: true, variable: i32* @iCost)
!59 = !DIGlobalVariable(name: "iDist", scope: !0, file: !6, line: 29, type: !10, isLocal: false, isDefinition: true, variable: i32* @iDist)
!60 = !{i32 2, !"Dwarf Version", i32 4}
!61 = !{i32 2, !"Debug Info Version", i32 3}
!62 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rgnNodes", arg: 1, scope: !16, file: !6, line: 31, type: !19)
!64 = !DIExpression()
!65 = !DILocation(line: 31, column: 23, scope: !16)
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chNode", arg: 2, scope: !16, file: !6, line: 31, type: !10)
!67 = !DILocation(line: 31, column: 37, scope: !16)
!68 = !DILocation(line: 32, column: 16, scope: !69)
!69 = distinct !DILexicalBlock(scope: !16, file: !6, line: 32, column: 7)
!70 = !DILocation(line: 32, column: 7, scope: !69)
!71 = !DILocation(line: 32, column: 24, scope: !69)
!72 = !DILocation(line: 32, column: 30, scope: !69)
!73 = !DILocation(line: 32, column: 7, scope: !16)
!74 = !DILocation(line: 33, column: 16, scope: !75)
!75 = distinct !DILexicalBlock(scope: !69, file: !6, line: 32, column: 39)
!76 = !DILocation(line: 33, column: 35, scope: !75)
!77 = !DILocation(line: 33, column: 26, scope: !75)
!78 = !DILocation(line: 33, column: 43, scope: !75)
!79 = !DILocation(line: 33, column: 5, scope: !75)
!80 = !DILocation(line: 34, column: 3, scope: !75)
!81 = !DILocation(line: 35, column: 17, scope: !16)
!82 = !DILocation(line: 35, column: 3, scope: !16)
!83 = !DILocation(line: 36, column: 10, scope: !16)
!84 = !DILocation(line: 36, column: 3, scope: !16)
!85 = !DILocation(line: 37, column: 1, scope: !16)
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iNode", arg: 1, scope: !25, file: !6, line: 39, type: !10)
!87 = !DILocation(line: 39, column: 18, scope: !25)
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iDist", arg: 2, scope: !25, file: !6, line: 39, type: !10)
!89 = !DILocation(line: 39, column: 29, scope: !25)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iPrev", arg: 3, scope: !25, file: !6, line: 39, type: !10)
!91 = !DILocation(line: 39, column: 40, scope: !25)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qNew", scope: !25, file: !6, line: 40, type: !4)
!93 = !DILocation(line: 40, column: 10, scope: !25)
!94 = !DILocation(line: 40, column: 26, scope: !25)
!95 = !DILocation(line: 40, column: 17, scope: !25)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qLast", scope: !25, file: !6, line: 41, type: !4)
!97 = !DILocation(line: 41, column: 10, scope: !25)
!98 = !DILocation(line: 41, column: 18, scope: !25)
!99 = !DILocation(line: 43, column: 8, scope: !100)
!100 = distinct !DILexicalBlock(scope: !25, file: !6, line: 43, column: 7)
!101 = !DILocation(line: 43, column: 7, scope: !25)
!102 = !DILocation(line: 44, column: 13, scope: !103)
!103 = distinct !DILexicalBlock(scope: !100, file: !6, line: 43, column: 14)
!104 = !DILocation(line: 44, column: 5, scope: !103)
!105 = !DILocation(line: 45, column: 5, scope: !103)
!106 = !DILocation(line: 47, column: 17, scope: !25)
!107 = !DILocation(line: 47, column: 3, scope: !25)
!108 = !DILocation(line: 47, column: 9, scope: !25)
!109 = !DILocation(line: 47, column: 15, scope: !25)
!110 = !DILocation(line: 48, column: 17, scope: !25)
!111 = !DILocation(line: 48, column: 3, scope: !25)
!112 = !DILocation(line: 48, column: 9, scope: !25)
!113 = !DILocation(line: 48, column: 15, scope: !25)
!114 = !DILocation(line: 49, column: 17, scope: !25)
!115 = !DILocation(line: 49, column: 3, scope: !25)
!116 = !DILocation(line: 49, column: 9, scope: !25)
!117 = !DILocation(line: 49, column: 15, scope: !25)
!118 = !DILocation(line: 50, column: 3, scope: !25)
!119 = !DILocation(line: 50, column: 9, scope: !25)
!120 = !DILocation(line: 50, column: 15, scope: !25)
!121 = !DILocation(line: 52, column: 8, scope: !122)
!122 = distinct !DILexicalBlock(scope: !25, file: !6, line: 52, column: 7)
!123 = !DILocation(line: 52, column: 7, scope: !25)
!124 = !DILocation(line: 53, column: 13, scope: !125)
!125 = distinct !DILexicalBlock(scope: !122, file: !6, line: 52, column: 15)
!126 = !DILocation(line: 53, column: 11, scope: !125)
!127 = !DILocation(line: 54, column: 3, scope: !125)
!128 = !DILocation(line: 55, column: 5, scope: !129)
!129 = distinct !DILexicalBlock(scope: !122, file: !6, line: 54, column: 10)
!130 = !DILocation(line: 55, column: 12, scope: !131)
!131 = !DILexicalBlockFile(scope: !132, file: !6, discriminator: 2)
!132 = !DILexicalBlockFile(scope: !129, file: !6, discriminator: 1)
!133 = !DILocation(line: 55, column: 19, scope: !129)
!134 = !DILocation(line: 56, column: 15, scope: !129)
!135 = !DILocation(line: 56, column: 22, scope: !129)
!136 = !DILocation(line: 56, column: 13, scope: !129)
!137 = !DILocation(line: 57, column: 20, scope: !129)
!138 = !DILocation(line: 57, column: 5, scope: !129)
!139 = !DILocation(line: 57, column: 12, scope: !129)
!140 = !DILocation(line: 57, column: 18, scope: !129)
!141 = !DILocation(line: 59, column: 11, scope: !25)
!142 = !DILocation(line: 61, column: 1, scope: !25)
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "piNode", arg: 1, scope: !28, file: !6, line: 63, type: !31)
!144 = !DILocation(line: 63, column: 19, scope: !28)
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "piDist", arg: 2, scope: !28, file: !6, line: 63, type: !31)
!146 = !DILocation(line: 63, column: 32, scope: !28)
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "piPrev", arg: 3, scope: !28, file: !6, line: 63, type: !31)
!148 = !DILocation(line: 63, column: 45, scope: !28)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qKill", scope: !28, file: !6, line: 64, type: !4)
!150 = !DILocation(line: 64, column: 10, scope: !28)
!151 = !DILocation(line: 64, column: 18, scope: !28)
!152 = !DILocation(line: 66, column: 7, scope: !153)
!153 = distinct !DILexicalBlock(scope: !28, file: !6, line: 66, column: 7)
!154 = !DILocation(line: 66, column: 7, scope: !28)
!155 = !DILocation(line: 68, column: 15, scope: !156)
!156 = distinct !DILexicalBlock(scope: !153, file: !6, line: 66, column: 14)
!157 = !DILocation(line: 68, column: 22, scope: !156)
!158 = !DILocation(line: 68, column: 6, scope: !156)
!159 = !DILocation(line: 68, column: 13, scope: !156)
!160 = !DILocation(line: 69, column: 15, scope: !156)
!161 = !DILocation(line: 69, column: 22, scope: !156)
!162 = !DILocation(line: 69, column: 6, scope: !156)
!163 = !DILocation(line: 69, column: 13, scope: !156)
!164 = !DILocation(line: 70, column: 15, scope: !156)
!165 = !DILocation(line: 70, column: 22, scope: !156)
!166 = !DILocation(line: 70, column: 6, scope: !156)
!167 = !DILocation(line: 70, column: 13, scope: !156)
!168 = !DILocation(line: 71, column: 13, scope: !156)
!169 = !DILocation(line: 71, column: 20, scope: !156)
!170 = !DILocation(line: 71, column: 11, scope: !156)
!171 = !DILocation(line: 72, column: 10, scope: !156)
!172 = !DILocation(line: 72, column: 5, scope: !156)
!173 = !DILocation(line: 73, column: 13, scope: !156)
!174 = !DILocation(line: 74, column: 3, scope: !156)
!175 = !DILocation(line: 75, column: 1, scope: !28)
!176 = !DILocation(line: 78, column: 11, scope: !32)
!177 = !DILocation(line: 78, column: 3, scope: !32)
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chStart", arg: 1, scope: !35, file: !6, line: 81, type: !10)
!179 = !DILocation(line: 81, column: 18, scope: !35)
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chEnd", arg: 2, scope: !35, file: !6, line: 81, type: !10)
!181 = !DILocation(line: 81, column: 31, scope: !35)
!182 = !DILocation(line: 83, column: 11, scope: !183)
!183 = distinct !DILexicalBlock(scope: !35, file: !6, line: 83, column: 3)
!184 = !DILocation(line: 83, column: 8, scope: !183)
!185 = !DILocation(line: 83, column: 16, scope: !186)
!186 = !DILexicalBlockFile(scope: !187, file: !6, discriminator: 2)
!187 = !DILexicalBlockFile(scope: !188, file: !6, discriminator: 1)
!188 = distinct !DILexicalBlock(scope: !183, file: !6, line: 83, column: 3)
!189 = !DILocation(line: 83, column: 19, scope: !188)
!190 = !DILocation(line: 83, column: 3, scope: !183)
!191 = !DILocation(line: 84, column: 14, scope: !192)
!192 = distinct !DILexicalBlock(scope: !188, file: !6, line: 83, column: 38)
!193 = !DILocation(line: 84, column: 5, scope: !192)
!194 = !DILocation(line: 84, column: 18, scope: !192)
!195 = !DILocation(line: 84, column: 24, scope: !192)
!196 = !DILocation(line: 85, column: 14, scope: !192)
!197 = !DILocation(line: 85, column: 5, scope: !192)
!198 = !DILocation(line: 85, column: 18, scope: !192)
!199 = !DILocation(line: 85, column: 24, scope: !192)
!200 = !DILocation(line: 86, column: 3, scope: !192)
!201 = !DILocation(line: 83, column: 34, scope: !188)
!202 = !DILocation(line: 83, column: 3, scope: !188)
!203 = !DILocation(line: 88, column: 7, scope: !204)
!204 = distinct !DILexicalBlock(scope: !35, file: !6, line: 88, column: 7)
!205 = !DILocation(line: 88, column: 18, scope: !204)
!206 = !DILocation(line: 88, column: 15, scope: !204)
!207 = !DILocation(line: 88, column: 7, scope: !35)
!208 = !DILocation(line: 89, column: 5, scope: !209)
!209 = distinct !DILexicalBlock(scope: !204, file: !6, line: 88, column: 25)
!210 = !DILocation(line: 90, column: 3, scope: !209)
!211 = !DILocation(line: 91, column: 14, scope: !212)
!212 = distinct !DILexicalBlock(scope: !204, file: !6, line: 90, column: 10)
!213 = !DILocation(line: 91, column: 5, scope: !212)
!214 = !DILocation(line: 91, column: 23, scope: !212)
!215 = !DILocation(line: 91, column: 29, scope: !212)
!216 = !DILocation(line: 92, column: 14, scope: !212)
!217 = !DILocation(line: 92, column: 5, scope: !212)
!218 = !DILocation(line: 92, column: 23, scope: !212)
!219 = !DILocation(line: 92, column: 29, scope: !212)
!220 = !DILocation(line: 94, column: 13, scope: !212)
!221 = !DILocation(line: 94, column: 5, scope: !212)
!222 = !DILocation(line: 96, column: 5, scope: !212)
!223 = !DILocation(line: 96, column: 12, scope: !224)
!224 = !DILexicalBlockFile(scope: !225, file: !6, discriminator: 2)
!225 = !DILexicalBlockFile(scope: !212, file: !6, discriminator: 1)
!226 = !DILocation(line: 96, column: 21, scope: !212)
!227 = !DILocation(line: 97, column: 7, scope: !228)
!228 = distinct !DILexicalBlock(scope: !212, file: !6, line: 96, column: 26)
!229 = !DILocation(line: 98, column: 14, scope: !230)
!230 = distinct !DILexicalBlock(scope: !228, file: !6, line: 98, column: 7)
!231 = !DILocation(line: 98, column: 12, scope: !230)
!232 = !DILocation(line: 98, column: 19, scope: !233)
!233 = !DILexicalBlockFile(scope: !234, file: !6, discriminator: 2)
!234 = !DILexicalBlockFile(scope: !235, file: !6, discriminator: 1)
!235 = distinct !DILexicalBlock(scope: !230, file: !6, line: 98, column: 7)
!236 = !DILocation(line: 98, column: 21, scope: !235)
!237 = !DILocation(line: 98, column: 7, scope: !230)
!238 = !DILocation(line: 99, column: 39, scope: !239)
!239 = distinct !DILexicalBlock(scope: !240, file: !6, line: 99, column: 13)
!240 = distinct !DILexicalBlock(scope: !235, file: !6, line: 98, column: 39)
!241 = !DILocation(line: 99, column: 22, scope: !239)
!242 = !DILocation(line: 99, column: 32, scope: !239)
!243 = !DILocation(line: 99, column: 20, scope: !239)
!244 = !DILocation(line: 99, column: 43, scope: !239)
!245 = !DILocation(line: 99, column: 13, scope: !240)
!246 = !DILocation(line: 100, column: 33, scope: !247)
!247 = distinct !DILexicalBlock(scope: !248, file: !6, line: 100, column: 15)
!248 = distinct !DILexicalBlock(scope: !239, file: !6, line: 99, column: 52)
!249 = !DILocation(line: 100, column: 24, scope: !247)
!250 = !DILocation(line: 100, column: 36, scope: !247)
!251 = !DILocation(line: 100, column: 21, scope: !247)
!252 = !DILocation(line: 100, column: 43, scope: !247)
!253 = !DILocation(line: 101, column: 25, scope: !247)
!254 = !DILocation(line: 101, column: 16, scope: !247)
!255 = !DILocation(line: 101, column: 28, scope: !247)
!256 = !DILocation(line: 101, column: 37, scope: !247)
!257 = !DILocation(line: 101, column: 45, scope: !247)
!258 = !DILocation(line: 101, column: 43, scope: !247)
!259 = !DILocation(line: 101, column: 34, scope: !247)
!260 = !DILocation(line: 100, column: 15, scope: !248)
!261 = !DILocation(line: 102, column: 33, scope: !262)
!262 = distinct !DILexicalBlock(scope: !247, file: !6, line: 101, column: 54)
!263 = !DILocation(line: 102, column: 41, scope: !262)
!264 = !DILocation(line: 102, column: 39, scope: !262)
!265 = !DILocation(line: 102, column: 22, scope: !262)
!266 = !DILocation(line: 102, column: 13, scope: !262)
!267 = !DILocation(line: 102, column: 25, scope: !262)
!268 = !DILocation(line: 102, column: 31, scope: !262)
!269 = !DILocation(line: 103, column: 33, scope: !262)
!270 = !DILocation(line: 103, column: 22, scope: !262)
!271 = !DILocation(line: 103, column: 13, scope: !262)
!272 = !DILocation(line: 103, column: 25, scope: !262)
!273 = !DILocation(line: 103, column: 31, scope: !262)
!274 = !DILocation(line: 104, column: 21, scope: !262)
!275 = !DILocation(line: 104, column: 24, scope: !262)
!276 = !DILocation(line: 104, column: 32, scope: !262)
!277 = !DILocation(line: 104, column: 30, scope: !262)
!278 = !DILocation(line: 104, column: 39, scope: !262)
!279 = !DILocation(line: 104, column: 13, scope: !262)
!280 = !DILocation(line: 105, column: 11, scope: !262)
!281 = !DILocation(line: 106, column: 9, scope: !248)
!282 = !DILocation(line: 107, column: 7, scope: !240)
!283 = !DILocation(line: 98, column: 35, scope: !235)
!284 = !DILocation(line: 98, column: 7, scope: !235)
!285 = !DILocation(line: 110, column: 54, scope: !212)
!286 = !DILocation(line: 110, column: 45, scope: !212)
!287 = !DILocation(line: 110, column: 61, scope: !212)
!288 = !DILocation(line: 110, column: 5, scope: !212)
!289 = !DILocation(line: 111, column: 5, scope: !212)
!290 = !DILocation(line: 112, column: 26, scope: !212)
!291 = !DILocation(line: 112, column: 5, scope: !212)
!292 = !DILocation(line: 113, column: 5, scope: !212)
!293 = !DILocation(line: 115, column: 1, scope: !35)
!294 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !38, file: !6, line: 117, type: !10)
!295 = !DILocation(line: 117, column: 14, scope: !38)
!296 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !38, file: !6, line: 117, type: !41)
!297 = !DILocation(line: 117, column: 26, scope: !38)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !38, file: !6, line: 118, type: !10)
!299 = !DILocation(line: 118, column: 7, scope: !38)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !38, file: !6, line: 118, type: !10)
!301 = !DILocation(line: 118, column: 10, scope: !38)
!302 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !38, file: !6, line: 118, type: !10)
!303 = !DILocation(line: 118, column: 13, scope: !38)
!304 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !38, file: !6, line: 119, type: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !307, line: 48, baseType: !308)
!307 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/tf/Benchmarks/MiBench/network-dijkstra")
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !309, line: 241, size: 1728, align: 64, elements: !310)
!309 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/tf/Benchmarks/MiBench/network-dijkstra")
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !331, !332, !333, !334, !338, !340, !342, !346, !349, !351, !353, !354, !355, !356, !360, !361}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !308, file: !309, line: 242, baseType: !10, size: 32, align: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !308, file: !309, line: 247, baseType: !42, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !308, file: !309, line: 248, baseType: !42, size: 64, align: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !308, file: !309, line: 249, baseType: !42, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !308, file: !309, line: 250, baseType: !42, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !308, file: !309, line: 251, baseType: !42, size: 64, align: 64, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !308, file: !309, line: 252, baseType: !42, size: 64, align: 64, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !308, file: !309, line: 253, baseType: !42, size: 64, align: 64, offset: 448)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !308, file: !309, line: 254, baseType: !42, size: 64, align: 64, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !308, file: !309, line: 256, baseType: !42, size: 64, align: 64, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !308, file: !309, line: 257, baseType: !42, size: 64, align: 64, offset: 640)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !308, file: !309, line: 258, baseType: !42, size: 64, align: 64, offset: 704)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !308, file: !309, line: 260, baseType: !324, size: 64, align: 64, offset: 768)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !309, line: 156, size: 192, align: 64, elements: !326)
!326 = !{!327, !328, !330}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !325, file: !309, line: 157, baseType: !324, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !325, file: !309, line: 158, baseType: !329, size: 64, align: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !325, file: !309, line: 162, baseType: !10, size: 32, align: 32, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !308, file: !309, line: 262, baseType: !329, size: 64, align: 64, offset: 832)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !308, file: !309, line: 264, baseType: !10, size: 32, align: 32, offset: 896)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !308, file: !309, line: 268, baseType: !10, size: 32, align: 32, offset: 928)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !308, file: !309, line: 270, baseType: !335, size: 64, align: 64, offset: 960)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !336, line: 131, baseType: !337)
!336 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/tf/Benchmarks/MiBench/network-dijkstra")
!337 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !308, file: !309, line: 274, baseType: !339, size: 16, align: 16, offset: 1024)
!339 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !308, file: !309, line: 275, baseType: !341, size: 8, align: 8, offset: 1040)
!341 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !308, file: !309, line: 276, baseType: !343, size: 8, align: 8, offset: 1048)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, align: 8, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 1)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !308, file: !309, line: 280, baseType: !347, size: 64, align: 64, offset: 1088)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !309, line: 150, baseType: null)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !308, file: !309, line: 289, baseType: !350, size: 64, align: 64, offset: 1152)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !336, line: 132, baseType: !337)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !308, file: !309, line: 297, baseType: !352, size: 64, align: 64, offset: 1216)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !308, file: !309, line: 298, baseType: !352, size: 64, align: 64, offset: 1280)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !308, file: !309, line: 299, baseType: !352, size: 64, align: 64, offset: 1344)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !308, file: !309, line: 300, baseType: !352, size: 64, align: 64, offset: 1408)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !308, file: !309, line: 302, baseType: !357, size: 64, align: 64, offset: 1472)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !358, line: 62, baseType: !359)
!358 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/tf/Benchmarks/MiBench/network-dijkstra")
!359 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !308, file: !309, line: 303, baseType: !10, size: 32, align: 32, offset: 1536)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !308, file: !309, line: 305, baseType: !362, size: 160, align: 8, offset: 1568)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, align: 8, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 20)
!365 = !DILocation(line: 119, column: 9, scope: !38)
!366 = !DILocation(line: 121, column: 7, scope: !367)
!367 = distinct !DILexicalBlock(scope: !38, file: !6, line: 121, column: 7)
!368 = !DILocation(line: 121, column: 12, scope: !367)
!369 = !DILocation(line: 121, column: 7, scope: !38)
!370 = !DILocation(line: 122, column: 13, scope: !371)
!371 = distinct !DILexicalBlock(scope: !367, file: !6, line: 121, column: 17)
!372 = !DILocation(line: 122, column: 5, scope: !371)
!373 = !DILocation(line: 123, column: 13, scope: !371)
!374 = !DILocation(line: 123, column: 5, scope: !371)
!375 = !DILocation(line: 124, column: 3, scope: !371)
!376 = !DILocation(line: 127, column: 14, scope: !38)
!377 = !DILocation(line: 127, column: 8, scope: !38)
!378 = !DILocation(line: 127, column: 6, scope: !38)
!379 = !DILocation(line: 130, column: 10, scope: !380)
!380 = distinct !DILexicalBlock(scope: !38, file: !6, line: 130, column: 3)
!381 = !DILocation(line: 130, column: 8, scope: !380)
!382 = !DILocation(line: 130, column: 15, scope: !383)
!383 = !DILexicalBlockFile(scope: !384, file: !6, discriminator: 2)
!384 = !DILexicalBlockFile(scope: !385, file: !6, discriminator: 1)
!385 = distinct !DILexicalBlock(scope: !380, file: !6, line: 130, column: 3)
!386 = !DILocation(line: 130, column: 17, scope: !385)
!387 = !DILocation(line: 130, column: 3, scope: !380)
!388 = !DILocation(line: 131, column: 12, scope: !389)
!389 = distinct !DILexicalBlock(scope: !390, file: !6, line: 131, column: 5)
!390 = distinct !DILexicalBlock(scope: !385, file: !6, line: 130, column: 35)
!391 = !DILocation(line: 131, column: 10, scope: !389)
!392 = !DILocation(line: 131, column: 17, scope: !393)
!393 = !DILexicalBlockFile(scope: !394, file: !6, discriminator: 2)
!394 = !DILexicalBlockFile(scope: !395, file: !6, discriminator: 1)
!395 = distinct !DILexicalBlock(scope: !389, file: !6, line: 131, column: 5)
!396 = !DILocation(line: 131, column: 19, scope: !395)
!397 = !DILocation(line: 131, column: 5, scope: !389)
!398 = !DILocation(line: 133, column: 14, scope: !399)
!399 = distinct !DILexicalBlock(scope: !395, file: !6, line: 131, column: 37)
!400 = !DILocation(line: 133, column: 7, scope: !399)
!401 = !DILocation(line: 134, column: 25, scope: !399)
!402 = !DILocation(line: 134, column: 20, scope: !399)
!403 = !DILocation(line: 134, column: 7, scope: !399)
!404 = !DILocation(line: 134, column: 17, scope: !399)
!405 = !DILocation(line: 134, column: 23, scope: !399)
!406 = !DILocation(line: 135, column: 5, scope: !399)
!407 = !DILocation(line: 131, column: 33, scope: !395)
!408 = !DILocation(line: 131, column: 5, scope: !395)
!409 = !DILocation(line: 136, column: 3, scope: !390)
!410 = !DILocation(line: 130, column: 31, scope: !385)
!411 = !DILocation(line: 130, column: 3, scope: !385)
!412 = !DILocation(line: 139, column: 10, scope: !413)
!413 = distinct !DILexicalBlock(scope: !38, file: !6, line: 139, column: 3)
!414 = !DILocation(line: 139, column: 17, scope: !413)
!415 = !DILocation(line: 139, column: 8, scope: !413)
!416 = !DILocation(line: 139, column: 34, scope: !417)
!417 = !DILexicalBlockFile(scope: !418, file: !6, discriminator: 2)
!418 = !DILexicalBlockFile(scope: !419, file: !6, discriminator: 1)
!419 = distinct !DILexicalBlock(scope: !413, file: !6, line: 139, column: 3)
!420 = !DILocation(line: 139, column: 36, scope: !419)
!421 = !DILocation(line: 139, column: 3, scope: !413)
!422 = !DILocation(line: 140, column: 9, scope: !423)
!423 = distinct !DILexicalBlock(scope: !419, file: !6, line: 139, column: 53)
!424 = !DILocation(line: 140, column: 11, scope: !423)
!425 = !DILocation(line: 140, column: 7, scope: !423)
!426 = !DILocation(line: 141, column: 14, scope: !423)
