; ModuleID = '/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/miniAMR/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.sorted_block = type { i32, i32 }
%struct.block = type { i32, i32, i32, i32, i32, i32, i32, [6 x i32], [6 x i32], [6 x [2 x [2 x i32]]], [3 x i32], double**** }
%struct.parent = type { i32, i32, i32, i32, i32, i32, [8 x i32], [8 x i32], [3 x i32] }
%struct.object = type { i32, i32, [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double] }

@comm.permutations = private unnamed_addr constant [6 x [3 x i32]] [[3 x i32] [i32 0, i32 1, i32 2], [3 x i32] [i32 1, i32 2, i32 0], [3 x i32] [i32 2, i32 0, i32 1], [3 x i32] [i32 0, i32 2, i32 1], [3 x i32] [i32 1, i32 0, i32 2], [3 x i32] [i32 2, i32 1, i32 0]], align 16
@permute = common global i32 0, align 4
@num_refine = common global i32 0, align 4
@sorted_index = common global i32* null, align 8
@sorted_list = common global %struct.sorted_block* null, align 8
@blocks = common global %struct.block* null, align 8
@counter_same = common global [3 x i32] zeroinitializer, align 4
@timer_comm_same = common global [3 x double] zeroinitializer, align 16
@counter_diff = common global [3 x i32] zeroinitializer, align 4
@timer_comm_diff = common global [3 x double] zeroinitializer, align 16
@counter_bc = common global [3 x i32] zeroinitializer, align 4
@timer_comm_bc = common global [3 x double] zeroinitializer, align 16

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !49)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/miniAMR")
!2 = !{}
!3 = !{!4, !9, !12, !15}
!4 = !DISubprogram(name: "comm", scope: !5, file: !5, line: 40, type: !6, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, function: void (i32, i32, i32)* @comm, variables: !2)
!5 = !DIFile(filename: "/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/miniAMR/tmp.c", directory: "/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/miniAMR")
!6 = !DISubroutineType(types: !7)
!7 = !{null, !8, !8, !8}
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DISubprogram(name: "on_proc_comm", scope: !5, file: !5, line: 107, type: !10, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: false, function: void (i32, i32, i32, i32, i32)* @on_proc_comm, variables: !2)
!10 = !DISubroutineType(types: !11)
!11 = !{null, !8, !8, !8, !8, !8}
!12 = !DISubprogram(name: "on_proc_comm_diff", scope: !5, file: !5, line: 226, type: !13, isLocal: false, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: false, function: void (i32, i32, i32, i32, i32, i32, i32)* @on_proc_comm_diff, variables: !2)
!13 = !DISubroutineType(types: !14)
!14 = !{null, !8, !8, !8, !8, !8, !8, !8}
!15 = !DISubprogram(name: "apply_bc", scope: !5, file: !5, line: 551, type: !16, isLocal: false, isDefinition: true, scopeLine: 551, flags: DIFlagPrototyped, isOptimized: false, function: void (i32, %struct.block*, i32, i32)* @apply_bc, variables: !2)
!16 = !DISubroutineType(types: !17)
!17 = !{null, !8, !18, !8, !8}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "block", file: !20, line: 42, baseType: !21)
!20 = !DIFile(filename: "./block.h", directory: "/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/miniAMR")
!21 = !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 27, size: 1536, align: 64, elements: !22)
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !34, !35, !39, !43}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !21, file: !20, line: 28, baseType: !8, size: 32, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !21, file: !20, line: 29, baseType: !8, size: 32, align: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !21, file: !20, line: 30, baseType: !8, size: 32, align: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "new_proc", scope: !21, file: !20, line: 31, baseType: !8, size: 32, align: 32, offset: 96)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !21, file: !20, line: 32, baseType: !8, size: 32, align: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "parent_node", scope: !21, file: !20, line: 35, baseType: !8, size: 32, align: 32, offset: 160)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "child_number", scope: !21, file: !20, line: 36, baseType: !8, size: 32, align: 32, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "nei_refine", scope: !21, file: !20, line: 37, baseType: !31, size: 192, align: 32, offset: 224)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 192, align: 32, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 6)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "nei_level", scope: !21, file: !20, line: 38, baseType: !31, size: 192, align: 32, offset: 416)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "nei", scope: !21, file: !20, line: 39, baseType: !36, size: 768, align: 32, offset: 608)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 768, align: 32, elements: !37)
!37 = !{!33, !38, !38}
!38 = !DISubrange(count: 2)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "cen", scope: !21, file: !20, line: 40, baseType: !40, size: 96, align: 32, offset: 1376)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 96, align: 32, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 3)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !21, file: !20, line: 41, baseType: !44, size: 64, align: 64, offset: 1472)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!49 = !{!50, !51, !68, !75, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !137, !138, !139, !140, !155, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201}
!50 = !DIGlobalVariable(name: "blocks", scope: !0, file: !20, line: 43, type: !18, isLocal: false, isDefinition: true, variable: %struct.block** @blocks)
!51 = !DIGlobalVariable(name: "parents", scope: !0, file: !20, line: 57, type: !52, isLocal: false, isDefinition: true, variable: %struct.parent** @parents)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "parent", file: !20, line: 56, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 45, size: 800, align: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !66, !67}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !54, file: !20, line: 46, baseType: !8, size: 32, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !54, file: !20, line: 47, baseType: !8, size: 32, align: 32, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !54, file: !20, line: 48, baseType: !8, size: 32, align: 32, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "parent_node", scope: !54, file: !20, line: 49, baseType: !8, size: 32, align: 32, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "child_number", scope: !54, file: !20, line: 50, baseType: !8, size: 32, align: 32, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !54, file: !20, line: 51, baseType: !8, size: 32, align: 32, offset: 160)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !54, file: !20, line: 52, baseType: !63, size: 256, align: 32, offset: 192)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 256, align: 32, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 8)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "child_node", scope: !54, file: !20, line: 54, baseType: !63, size: 256, align: 32, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "cen", scope: !54, file: !20, line: 55, baseType: !40, size: 96, align: 32, offset: 704)
!68 = !DIGlobalVariable(name: "sorted_list", scope: !0, file: !20, line: 63, type: !69, isLocal: false, isDefinition: true, variable: %struct.sorted_block** @sorted_list)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "sorted_block", file: !20, line: 62, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 59, size: 64, align: 32, elements: !72)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !71, file: !20, line: 60, baseType: !8, size: 32, align: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !71, file: !20, line: 61, baseType: !8, size: 32, align: 32, offset: 32)
!75 = !DIGlobalVariable(name: "sorted_index", scope: !0, file: !20, line: 64, type: !76, isLocal: false, isDefinition: true, variable: i32** @sorted_index)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!77 = !DIGlobalVariable(name: "my_pe", scope: !0, file: !20, line: 66, type: !8, isLocal: false, isDefinition: true, variable: i32* @my_pe)
!78 = !DIGlobalVariable(name: "num_pes", scope: !0, file: !20, line: 67, type: !8, isLocal: false, isDefinition: true, variable: i32* @num_pes)
!79 = !DIGlobalVariable(name: "max_num_blocks", scope: !0, file: !20, line: 69, type: !8, isLocal: false, isDefinition: true, variable: i32* @max_num_blocks)
!80 = !DIGlobalVariable(name: "target_active", scope: !0, file: !20, line: 70, type: !8, isLocal: false, isDefinition: true, variable: i32* @target_active)
!81 = !DIGlobalVariable(name: "target_max", scope: !0, file: !20, line: 71, type: !8, isLocal: false, isDefinition: true, variable: i32* @target_max)
!82 = !DIGlobalVariable(name: "target_min", scope: !0, file: !20, line: 72, type: !8, isLocal: false, isDefinition: true, variable: i32* @target_min)
!83 = !DIGlobalVariable(name: "num_refine", scope: !0, file: !20, line: 73, type: !8, isLocal: false, isDefinition: true, variable: i32* @num_refine)
!84 = !DIGlobalVariable(name: "uniform_refine", scope: !0, file: !20, line: 74, type: !8, isLocal: false, isDefinition: true, variable: i32* @uniform_refine)
!85 = !DIGlobalVariable(name: "x_block_size", scope: !0, file: !20, line: 75, type: !8, isLocal: false, isDefinition: true, variable: i32* @x_block_size)
!86 = !DIGlobalVariable(name: "y_block_size", scope: !0, file: !20, line: 75, type: !8, isLocal: false, isDefinition: true, variable: i32* @y_block_size)
!87 = !DIGlobalVariable(name: "z_block_size", scope: !0, file: !20, line: 75, type: !8, isLocal: false, isDefinition: true, variable: i32* @z_block_size)
!88 = !DIGlobalVariable(name: "num_vars", scope: !0, file: !20, line: 76, type: !8, isLocal: false, isDefinition: true, variable: i32* @num_vars)
!89 = !DIGlobalVariable(name: "comm_vars", scope: !0, file: !20, line: 77, type: !8, isLocal: false, isDefinition: true, variable: i32* @comm_vars)
!90 = !DIGlobalVariable(name: "init_block_x", scope: !0, file: !20, line: 78, type: !8, isLocal: false, isDefinition: true, variable: i32* @init_block_x)
!91 = !DIGlobalVariable(name: "init_block_y", scope: !0, file: !20, line: 78, type: !8, isLocal: false, isDefinition: true, variable: i32* @init_block_y)
!92 = !DIGlobalVariable(name: "init_block_z", scope: !0, file: !20, line: 78, type: !8, isLocal: false, isDefinition: true, variable: i32* @init_block_z)
!93 = !DIGlobalVariable(name: "reorder", scope: !0, file: !20, line: 79, type: !8, isLocal: false, isDefinition: true, variable: i32* @reorder)
!94 = !DIGlobalVariable(name: "npx", scope: !0, file: !20, line: 80, type: !8, isLocal: false, isDefinition: true, variable: i32* @npx)
!95 = !DIGlobalVariable(name: "npy", scope: !0, file: !20, line: 80, type: !8, isLocal: false, isDefinition: true, variable: i32* @npy)
!96 = !DIGlobalVariable(name: "npz", scope: !0, file: !20, line: 80, type: !8, isLocal: false, isDefinition: true, variable: i32* @npz)
!97 = !DIGlobalVariable(name: "inbalance", scope: !0, file: !20, line: 81, type: !8, isLocal: false, isDefinition: true, variable: i32* @inbalance)
!98 = !DIGlobalVariable(name: "refine_freq", scope: !0, file: !20, line: 82, type: !8, isLocal: false, isDefinition: true, variable: i32* @refine_freq)
!99 = !DIGlobalVariable(name: "report_diffusion", scope: !0, file: !20, line: 83, type: !8, isLocal: false, isDefinition: true, variable: i32* @report_diffusion)
!100 = !DIGlobalVariable(name: "checksum_freq", scope: !0, file: !20, line: 84, type: !8, isLocal: false, isDefinition: true, variable: i32* @checksum_freq)
!101 = !DIGlobalVariable(name: "stages_per_ts", scope: !0, file: !20, line: 85, type: !8, isLocal: false, isDefinition: true, variable: i32* @stages_per_ts)
!102 = !DIGlobalVariable(name: "error_tol", scope: !0, file: !20, line: 86, type: !8, isLocal: false, isDefinition: true, variable: i32* @error_tol)
!103 = !DIGlobalVariable(name: "num_tsteps", scope: !0, file: !20, line: 87, type: !8, isLocal: false, isDefinition: true, variable: i32* @num_tsteps)
!104 = !DIGlobalVariable(name: "stencil", scope: !0, file: !20, line: 88, type: !8, isLocal: false, isDefinition: true, variable: i32* @stencil)
!105 = !DIGlobalVariable(name: "report_perf", scope: !0, file: !20, line: 89, type: !8, isLocal: false, isDefinition: true, variable: i32* @report_perf)
!106 = !DIGlobalVariable(name: "plot_freq", scope: !0, file: !20, line: 90, type: !8, isLocal: false, isDefinition: true, variable: i32* @plot_freq)
!107 = !DIGlobalVariable(name: "lb_opt", scope: !0, file: !20, line: 91, type: !8, isLocal: false, isDefinition: true, variable: i32* @lb_opt)
!108 = !DIGlobalVariable(name: "block_change", scope: !0, file: !20, line: 92, type: !8, isLocal: false, isDefinition: true, variable: i32* @block_change)
!109 = !DIGlobalVariable(name: "code", scope: !0, file: !20, line: 93, type: !8, isLocal: false, isDefinition: true, variable: i32* @code)
!110 = !DIGlobalVariable(name: "permute", scope: !0, file: !20, line: 94, type: !8, isLocal: false, isDefinition: true, variable: i32* @permute)
!111 = !DIGlobalVariable(name: "nonblocking", scope: !0, file: !20, line: 95, type: !8, isLocal: false, isDefinition: true, variable: i32* @nonblocking)
!112 = !DIGlobalVariable(name: "refine_ghost", scope: !0, file: !20, line: 96, type: !8, isLocal: false, isDefinition: true, variable: i32* @refine_ghost)
!113 = !DIGlobalVariable(name: "max_num_parents", scope: !0, file: !20, line: 98, type: !8, isLocal: false, isDefinition: true, variable: i32* @max_num_parents)
!114 = !DIGlobalVariable(name: "num_parents", scope: !0, file: !20, line: 99, type: !8, isLocal: false, isDefinition: true, variable: i32* @num_parents)
!115 = !DIGlobalVariable(name: "max_active_parent", scope: !0, file: !20, line: 100, type: !8, isLocal: false, isDefinition: true, variable: i32* @max_active_parent)
!116 = !DIGlobalVariable(name: "cur_max_level", scope: !0, file: !20, line: 101, type: !8, isLocal: false, isDefinition: true, variable: i32* @cur_max_level)
!117 = !DIGlobalVariable(name: "num_blocks", scope: !0, file: !20, line: 102, type: !76, isLocal: false, isDefinition: true, variable: i32** @num_blocks)
!118 = !DIGlobalVariable(name: "block_start", scope: !0, file: !20, line: 103, type: !76, isLocal: false, isDefinition: true, variable: i32** @block_start)
!119 = !DIGlobalVariable(name: "num_active", scope: !0, file: !20, line: 104, type: !8, isLocal: false, isDefinition: true, variable: i32* @num_active)
!120 = !DIGlobalVariable(name: "max_active_block", scope: !0, file: !20, line: 105, type: !8, isLocal: false, isDefinition: true, variable: i32* @max_active_block)
!121 = !DIGlobalVariable(name: "global_active", scope: !0, file: !20, line: 106, type: !8, isLocal: false, isDefinition: true, variable: i32* @global_active)
!122 = !DIGlobalVariable(name: "x_block_half", scope: !0, file: !20, line: 107, type: !8, isLocal: false, isDefinition: true, variable: i32* @x_block_half)
!123 = !DIGlobalVariable(name: "y_block_half", scope: !0, file: !20, line: 107, type: !8, isLocal: false, isDefinition: true, variable: i32* @y_block_half)
!124 = !DIGlobalVariable(name: "z_block_half", scope: !0, file: !20, line: 107, type: !8, isLocal: false, isDefinition: true, variable: i32* @z_block_half)
!125 = !DIGlobalVariable(name: "tol", scope: !0, file: !20, line: 108, type: !48, isLocal: false, isDefinition: true, variable: double* @tol)
!126 = !DIGlobalVariable(name: "grid_sum", scope: !0, file: !20, line: 109, type: !47, isLocal: false, isDefinition: true, variable: double** @grid_sum)
!127 = !DIGlobalVariable(name: "p8", scope: !0, file: !20, line: 110, type: !76, isLocal: false, isDefinition: true, variable: i32** @p8)
!128 = !DIGlobalVariable(name: "p2", scope: !0, file: !20, line: 110, type: !76, isLocal: false, isDefinition: true, variable: i32** @p2)
!129 = !DIGlobalVariable(name: "mesh_size", scope: !0, file: !20, line: 111, type: !40, isLocal: false, isDefinition: true, variable: [3 x i32]* @mesh_size)
!130 = !DIGlobalVariable(name: "max_mesh_size", scope: !0, file: !20, line: 112, type: !8, isLocal: false, isDefinition: true, variable: i32* @max_mesh_size)
!131 = !DIGlobalVariable(name: "from", scope: !0, file: !20, line: 113, type: !76, isLocal: false, isDefinition: true, variable: i32** @from)
!132 = !DIGlobalVariable(name: "to", scope: !0, file: !20, line: 113, type: !76, isLocal: false, isDefinition: true, variable: i32** @to)
!133 = !DIGlobalVariable(name: "msg_len", scope: !0, file: !20, line: 114, type: !134, isLocal: false, isDefinition: true, variable: [3 x [4 x i32]]* @msg_len)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 384, align: 32, elements: !135)
!135 = !{!42, !136}
!136 = !DISubrange(count: 4)
!137 = !DIGlobalVariable(name: "local_max_b", scope: !0, file: !20, line: 115, type: !8, isLocal: false, isDefinition: true, variable: i32* @local_max_b)
!138 = !DIGlobalVariable(name: "global_max_b", scope: !0, file: !20, line: 116, type: !8, isLocal: false, isDefinition: true, variable: i32* @global_max_b)
!139 = !DIGlobalVariable(name: "num_objects", scope: !0, file: !20, line: 118, type: !8, isLocal: false, isDefinition: true, variable: i32* @num_objects)
!140 = !DIGlobalVariable(name: "objects", scope: !0, file: !20, line: 130, type: !141, isLocal: false, isDefinition: true, variable: %struct.object** @objects)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "object", file: !20, line: 129, baseType: !143)
!143 = !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 119, size: 1408, align: 64, elements: !144)
!144 = !{!145, !146, !147, !149, !150, !151, !152, !153, !154}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !143, file: !20, line: 120, baseType: !8, size: 32, align: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "bounce", scope: !143, file: !20, line: 121, baseType: !8, size: 32, align: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "cen", scope: !143, file: !20, line: 122, baseType: !148, size: 192, align: 64, offset: 64)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 192, align: 64, elements: !41)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cen", scope: !143, file: !20, line: 123, baseType: !148, size: 192, align: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "move", scope: !143, file: !20, line: 124, baseType: !148, size: 192, align: 64, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "orig_move", scope: !143, file: !20, line: 125, baseType: !148, size: 192, align: 64, offset: 640)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !143, file: !20, line: 126, baseType: !148, size: 192, align: 64, offset: 832)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "orig_size", scope: !143, file: !20, line: 127, baseType: !148, size: 192, align: 64, offset: 1024)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "inc", scope: !143, file: !20, line: 128, baseType: !148, size: 192, align: 64, offset: 1216)
!155 = !DIGlobalVariable(name: "average", scope: !0, file: !156, line: 27, type: !157, isLocal: false, isDefinition: true, variable: [128 x double]* @average)
!156 = !DIFile(filename: "./timer.h", directory: "/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/miniAMR")
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8192, align: 64, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 128)
!160 = !DIGlobalVariable(name: "stddev", scope: !0, file: !156, line: 28, type: !157, isLocal: false, isDefinition: true, variable: [128 x double]* @stddev)
!161 = !DIGlobalVariable(name: "minimum", scope: !0, file: !156, line: 29, type: !157, isLocal: false, isDefinition: true, variable: [128 x double]* @minimum)
!162 = !DIGlobalVariable(name: "maximum", scope: !0, file: !156, line: 30, type: !157, isLocal: false, isDefinition: true, variable: [128 x double]* @maximum)
!163 = !DIGlobalVariable(name: "timer_all", scope: !0, file: !156, line: 32, type: !48, isLocal: false, isDefinition: true, variable: double* @timer_all)
!164 = !DIGlobalVariable(name: "timer_comm_all", scope: !0, file: !156, line: 34, type: !48, isLocal: false, isDefinition: true, variable: double* @timer_comm_all)
!165 = !DIGlobalVariable(name: "timer_comm_dir", scope: !0, file: !156, line: 35, type: !148, isLocal: false, isDefinition: true, variable: [3 x double]* @timer_comm_dir)
!166 = !DIGlobalVariable(name: "timer_comm_same", scope: !0, file: !156, line: 36, type: !148, isLocal: false, isDefinition: true, variable: [3 x double]* @timer_comm_same)
!167 = !DIGlobalVariable(name: "timer_comm_diff", scope: !0, file: !156, line: 37, type: !148, isLocal: false, isDefinition: true, variable: [3 x double]* @timer_comm_diff)
!168 = !DIGlobalVariable(name: "timer_comm_bc", scope: !0, file: !156, line: 38, type: !148, isLocal: false, isDefinition: true, variable: [3 x double]* @timer_comm_bc)
!169 = !DIGlobalVariable(name: "timer_calc_all", scope: !0, file: !156, line: 40, type: !48, isLocal: false, isDefinition: true, variable: double* @timer_calc_all)
!170 = !DIGlobalVariable(name: "timer_cs_all", scope: !0, file: !156, line: 42, type: !48, isLocal: false, isDefinition: true, variable: double* @timer_cs_all)
!171 = !DIGlobalVariable(name: "timer_cs_calc", scope: !0, file: !156, line: 43, type: !48, isLocal: false, isDefinition: true, variable: double* @timer_cs_calc)
!172 = !DIGlobalVariable(name: "timer_refine_all", scope: !0, file: !156, line: 45, type: !48, isLocal: false, isDefinition: true, variable: double* @timer_refine_all)
!173 = !DIGlobalVariable(name: "timer_refine_co", scope: !0, file: !156, line: 46, type: !48, isLocal: false, isDefinition: true, variable: double* @timer_refine_co)
!174 = !DIGlobalVariable(name: "timer_refine_mr", scope: !0, file: !156, line: 47, type: !48, isLocal: false, isDefinition: true, variable: double* @timer_refine_mr)
!175 = !DIGlobalVariable(name: "timer_refine_sb", scope: !0, file: !156, line: 48, type: !48, isLocal: false, isDefinition: true, variable: double* @timer_refine_sb)
!176 = !DIGlobalVariable(name: "timer_refine_cc", scope: !0, file: !156, line: 49, type: !48, isLocal: false, isDefinition: true, variable: double* @timer_refine_cc)
!177 = !DIGlobalVariable(name: "timer_cb_all", scope: !0, file: !156, line: 50, type: !48, isLocal: false, isDefinition: true, variable: double* @timer_cb_all)
!178 = !DIGlobalVariable(name: "timer_target_all", scope: !0, file: !156, line: 51, type: !48, isLocal: false, isDefinition: true, variable: double* @timer_target_all)
!179 = !DIGlobalVariable(name: "timer_target_rb", scope: !0, file: !156, line: 52, type: !48, isLocal: false, isDefinition: true, variable: double* @timer_target_rb)
!180 = !DIGlobalVariable(name: "timer_target_dc", scope: !0, file: !156, line: 53, type: !48, isLocal: false, isDefinition: true, variable: double* @timer_target_dc)
