; ModuleID = 'result.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Input = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.CalcDataPtrs = type { i32*, i32*, %struct.Materials, %struct.Pole**, %struct.Window**, double** }
%struct.Materials = type { i32*, i32**, double** }
%struct.Pole = type { { double, double }, { double, double }, { double, double }, { double, double }, i16 }
%struct.Window = type { double, double, double, i32, i32 }

@fast_nuclear_W.an = private unnamed_addr constant [10 x double] [double 2.758402e-01, double 2.245740e-01, double 1.594149e-01, double 9.866577e-02, double 5.324414e-02, double 2.505215e-02, double 1.027747e-02, double 3.676164e-03, double 1.146494e-03, double 3.117570e-04], align 16
@fast_nuclear_W.neg_1n = private unnamed_addr constant [10 x double] [double -1.000000e+00, double 1.000000e+00, double -1.000000e+00, double 1.000000e+00, double -1.000000e+00, double 1.000000e+00, double -1.000000e+00, double 1.000000e+00, double -1.000000e+00, double 1.000000e+00], align 16
@fast_nuclear_W.denominator_left = private unnamed_addr constant [10 x double] [double 9.869604e+00, double 3.947842e+01, double 8.882644e+01, double 1.579137e+02, double 2.467401e+02, double 3.553058e+02, double 4.836106e+02, double 6.316547e+02, double 7.994380e+02, double 9.869604e+02], align 16

; Function Attrs: nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !12)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/RSBench")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__hm", file: !4, line: 24, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./rsbench.h", directory: "/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/RSBench")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "SMALL", value: 0)
!7 = !DIEnumerator(name: "LARGE", value: 1)
!8 = !DIEnumerator(name: "XL", value: 2)
!9 = !DIEnumerator(name: "XXL", value: 3)
!10 = !{!11}
!11 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!12 = !{!13, !19, !78, !81, !82}
!13 = !DISubprogram(name: "fast_nuclear_W", scope: !14, file: !14, line: 6, type: !15, isLocal: false, isDefinition: true, scopeLine: 6, flags: DIFlagPrototyped, isOptimized: false, function: { double, double } (double, double)* @fast_nuclear_W, variables: !18)
!14 = !DIFile(filename: "/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/RSBench/tmp.c", directory: "/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/RSBench")
!15 = !DISubroutineType(types: !16)
!16 = !{!17, !17}
!17 = !DIBasicType(name: "complex", size: 128, align: 64, encoding: DW_ATE_complex_float)
!18 = !{}
!19 = !DISubprogram(name: "calculate_macro_xs", scope: !14, file: !14, line: 71, type: !20, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, function: void (double*, i32, double, %struct.Input*, %struct.CalcDataPtrs*, { double, double }*, i64*, i64*)* @calculate_macro_xs, variables: !18)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !22, !11, !23, !24, !36, !75, !76, !76}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "Input", file: !4, line: 35, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 26, size: 256, align: 32, elements: !26)
!26 = !{!27, !28, !29, !30, !32, !33, !34, !35}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !25, file: !4, line: 27, baseType: !11, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "n_nuclides", scope: !25, file: !4, line: 28, baseType: !11, size: 32, align: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "lookups", scope: !25, file: !4, line: 29, baseType: !11, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "HM", scope: !25, file: !4, line: 30, baseType: !31, size: 32, align: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "HM_size", file: !4, line: 24, baseType: !3)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "avg_n_poles", scope: !25, file: !4, line: 31, baseType: !11, size: 32, align: 32, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "avg_n_windows", scope: !25, file: !4, line: 32, baseType: !11, size: 32, align: 32, offset: 160)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "numL", scope: !25, file: !4, line: 33, baseType: !11, size: 32, align: 32, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "doppler", scope: !25, file: !4, line: 34, baseType: !11, size: 32, align: 32, offset: 224)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "CalcDataPtrs", file: !4, line: 66, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 59, size: 512, align: 64, elements: !38)
!38 = !{!39, !41, !42, !51, !63, !74}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "n_poles", scope: !37, file: !4, line: 60, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "n_windows", scope: !37, file: !4, line: 61, baseType: !40, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "materials", scope: !37, file: !4, line: 62, baseType: !43, size: 192, align: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "Materials", file: !4, line: 41, baseType: !44)
!44 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 37, size: 192, align: 64, elements: !45)
!45 = !{!46, !47, !49}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "num_nucs", scope: !44, file: !4, line: 38, baseType: !40, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "mats", scope: !44, file: !4, line: 39, baseType: !48, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "concs", scope: !44, file: !4, line: 40, baseType: !50, size: 64, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "poles", scope: !37, file: !4, line: 63, baseType: !52, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pole", file: !4, line: 49, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 43, size: 576, align: 64, elements: !56)
!56 = !{!57, !58, !59, !60, !61}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "MP_EA", scope: !55, file: !4, line: 44, baseType: !17, size: 128, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "MP_RT", scope: !55, file: !4, line: 45, baseType: !17, size: 128, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "MP_RA", scope: !55, file: !4, line: 46, baseType: !17, size: 128, align: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "MP_RF", scope: !55, file: !4, line: 47, baseType: !17, size: 128, align: 64, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "l_value", scope: !55, file: !4, line: 48, baseType: !62, size: 16, align: 16, offset: 512)
!62 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "windows", scope: !37, file: !4, line: 64, baseType: !64, size: 64, align: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "Window", file: !4, line: 57, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 51, size: 256, align: 64, elements: !68)
!68 = !{!69, !70, !71, !72, !73}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !67, file: !4, line: 52, baseType: !23, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !67, file: !4, line: 53, baseType: !23, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "F", scope: !67, file: !4, line: 54, baseType: !23, size: 64, align: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !67, file: !4, line: 55, baseType: !11, size: 32, align: 32, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !67, file: !4, line: 56, baseType: !11, size: 32, align: 32, offset: 224)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pseudo_K0RS", scope: !37, file: !4, line: 65, baseType: !50, size: 64, align: 64, offset: 448)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!78 = !DISubprogram(name: "calculate_micro_xs", scope: !14, file: !14, line: 98, type: !79, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false, function: void (double*, i32, double, %struct.Input*, %struct.CalcDataPtrs*, { double, double }*)* @calculate_micro_xs, variables: !18)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !22, !11, !23, !24, !36, !75}
!81 = !DISubprogram(name: "calculate_micro_xs_doppler", scope: !14, file: !14, line: 143, type: !20, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: false, function: void (double*, i32, double, %struct.Input*, %struct.CalcDataPtrs*, { double, double }*, i64*, i64*)* @calculate_micro_xs_doppler, variables: !18)
!82 = !DISubprogram(name: "calculate_sig_T", scope: !14, file: !14, line: 194, type: !83, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: false, function: void (i32, double, %struct.Input*, %struct.CalcDataPtrs*, { double, double }*)* @calculate_sig_T, variables: !18)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !11, !23, !24, !36, !75}
!85 = !{i32 2, !"Dwarf Version", i32 4}
!86 = !{i32 2, !"Debug Info Version", i32 3}
!87 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Z", arg: 1, scope: !13, file: !14, line: 6, type: !17)
!89 = !DIExpression()
!90 = !DILocation(line: 6, column: 46, scope: !13)
!91 = !DILocation(line: 8, column: 12, scope: !92)
!92 = distinct !DILexicalBlock(scope: !13, file: !14, line: 8, column: 7)
!93 = !DILocation(line: 8, column: 7, scope: !92)
!94 = !DILocation(line: 8, column: 15, scope: !92)
!95 = !DILocation(line: 8, column: 7, scope: !13)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prefactor", scope: !97, file: !14, line: 11, type: !17)
!97 = distinct !DILexicalBlock(scope: !92, file: !14, line: 8, column: 22)
!98 = !DILocation(line: 11, column: 20, scope: !97)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "an", scope: !97, file: !14, line: 12, type: !100)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 640, align: 64, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 10)
!103 = !DILocation(line: 12, column: 12, scope: !97)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "neg_1n", scope: !97, file: !14, line: 23, type: !100)
!105 = !DILocation(line: 23, column: 12, scope: !97)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "denominator_left", scope: !97, file: !14, line: 35, type: !100)
!107 = !DILocation(line: 35, column: 12, scope: !97)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "W", scope: !97, file: !14, line: 47, type: !17)
!109 = !DILocation(line: 47, column: 20, scope: !97)
!110 = !DILocation(line: 47, column: 48, scope: !97)
!111 = !DILocation(line: 47, column: 46, scope: !97)
!112 = !{!"branch_weights", i32 1, i32 1048575}
!113 = !DILocation(line: 47, column: 46, scope: !114)
!114 = !DILexicalBlockFile(scope: !97, file: !14, discriminator: 1)
!115 = !DILocation(line: 47, column: 46, scope: !116)
!116 = !DILexicalBlockFile(scope: !97, file: !14, discriminator: 3)
!117 = !DILocation(line: 47, column: 33, scope: !118)
!118 = !DILexicalBlockFile(scope: !119, file: !14, discriminator: 5)
!119 = !DILexicalBlockFile(scope: !120, file: !14, discriminator: 4)
!120 = !DILexicalBlockFile(scope: !97, file: !14, discriminator: 2)
!121 = !DILocation(line: 47, column: 31, scope: !97)
!122 = !DILocation(line: 47, column: 26, scope: !97)
!123 = !DILocation(line: 47, column: 26, scope: !124)
