; ModuleID = 'result.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.timeval = type { i64, i64 }
%struct.timezone = type { i32, i32 }

@.str = private unnamed_addr constant [6 x i8] c" \0Aend\00", align 1
@.str.1 = private unnamed_addr constant [11 x i8] c"begin 640 \00", align 1
@.str.2 = private unnamed_addr constant [3 x i8] c" \0A\00", align 1
@.str.3 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@stdin = external global %struct._IO_FILE*, align 8
@stdout = external global %struct._IO_FILE*, align 8
@.str.4 = private unnamed_addr constant [26 x i8] c"Usage: uuencode [infile]\0A\00", align 1
@.str.5 = private unnamed_addr constant [11 x i8] c"uuencode.c\00", align 1
@.str.6 = private unnamed_addr constant [4 x i8] c"%d\0A\00", align 1

; Function Attrs: nounwind uwtable
define i32 @encode_char(i8 signext %c) #0 {
entry:
  call void @llvm.dbg.value(metadata i8 %c, i64 0, metadata !91, metadata !92), !dbg !93
  %conv = sext i8 %c to i32, !dbg !94
  %and = and i32 %conv, 63, !dbg !95
  %add = add nsw i32 32, %and, !dbg !96
  ret i32 %add, !dbg !97
}

; Function Attrs: nounwind readnone

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/BitBench/uuencode")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !12, !16, !19, !22, !26}
!6 = !DISubprogram(name: "encode_char", scope: !7, file: !7, line: 70, type: !8, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i8)* @encode_char, variables: !2)
!7 = !DIFile(filename: "/home/gleison/tf/Benchmarks/BitBench/uuencode/tmp.c", directory: "/home/gleison/tf/Benchmarks/BitBench/uuencode")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !11}
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!12 = !DISubprogram(name: "encode_line", scope: !7, file: !7, line: 74, type: !13, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false, function: void (i8*, i32, i32, i8*)* @encode_line, variables: !2)
!13 = !DISubroutineType(types: !14)
!14 = !{null, !15, !10, !10, !15}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!16 = !DISubprogram(name: "encode", scope: !7, file: !7, line: 114, type: !17, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false, function: void (i8*, i32, i8*)* @encode, variables: !2)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !15, !10, !15}
!19 = !DISubprogram(name: "do_encode", scope: !7, file: !7, line: 132, type: !20, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i8*, i8*, i32, i8*)* @do_encode, variables: !2)
!20 = !DISubroutineType(types: !21)
!21 = !{!10, !15, !15, !10, !15}
!22 = !DISubprogram(name: "main", scope: !7, file: !7, line: 155, type: !23, isLocal: false, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !2)
!23 = !DISubroutineType(types: !24)
!24 = !{!10, !10, !25}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!26 = !DISubprogram(name: "read_data", scope: !7, file: !7, line: 147, type: !27, isLocal: true, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: false, function: i64 (%struct._IO_FILE*, i8*)* @read_data, variables: !2)
!27 = !DISubroutineType(types: !28)
!28 = !{!29, !32, !4}
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !30, line: 62, baseType: !31)
!30 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/tf/Benchmarks/BitBench/uuencode")
!31 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !34, line: 48, baseType: !35)
!34 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/tf/Benchmarks/BitBench/uuencode")
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !36, line: 241, size: 1728, align: 64, elements: !37)
!36 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/tf/Benchmarks/BitBench/uuencode")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !58, !59, !60, !61, !65, !67, !69, !73, !76, !78, !79, !80, !81, !82, !83, !84}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !35, file: !36, line: 242, baseType: !10, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !35, file: !36, line: 247, baseType: !15, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !35, file: !36, line: 248, baseType: !15, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !35, file: !36, line: 249, baseType: !15, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !35, file: !36, line: 250, baseType: !15, size: 64, align: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !35, file: !36, line: 251, baseType: !15, size: 64, align: 64, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !35, file: !36, line: 252, baseType: !15, size: 64, align: 64, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !35, file: !36, line: 253, baseType: !15, size: 64, align: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !35, file: !36, line: 254, baseType: !15, size: 64, align: 64, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !35, file: !36, line: 256, baseType: !15, size: 64, align: 64, offset: 576)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !35, file: !36, line: 257, baseType: !15, size: 64, align: 64, offset: 640)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !35, file: !36, line: 258, baseType: !15, size: 64, align: 64, offset: 704)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !35, file: !36, line: 260, baseType: !51, size: 64, align: 64, offset: 768)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !36, line: 156, size: 192, align: 64, elements: !53)
!53 = !{!54, !55, !57}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !52, file: !36, line: 157, baseType: !51, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !52, file: !36, line: 158, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !52, file: !36, line: 162, baseType: !10, size: 32, align: 32, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !35, file: !36, line: 262, baseType: !56, size: 64, align: 64, offset: 832)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !35, file: !36, line: 264, baseType: !10, size: 32, align: 32, offset: 896)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !35, file: !36, line: 268, baseType: !10, size: 32, align: 32, offset: 928)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !35, file: !36, line: 270, baseType: !62, size: 64, align: 64, offset: 960)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !63, line: 131, baseType: !64)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/tf/Benchmarks/BitBench/uuencode")
!64 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !35, file: !36, line: 274, baseType: !66, size: 16, align: 16, offset: 1024)
!66 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !35, file: !36, line: 275, baseType: !68, size: 8, align: 8, offset: 1040)
!68 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !35, file: !36, line: 276, baseType: !70, size: 8, align: 8, offset: 1048)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, align: 8, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 1)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !35, file: !36, line: 280, baseType: !74, size: 64, align: 64, offset: 1088)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !36, line: 150, baseType: null)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !35, file: !36, line: 289, baseType: !77, size: 64, align: 64, offset: 1152)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !63, line: 132, baseType: !64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !35, file: !36, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !35, file: !36, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !35, file: !36, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !35, file: !36, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !35, file: !36, line: 302, baseType: !29, size: 64, align: 64, offset: 1472)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !35, file: !36, line: 303, baseType: !10, size: 32, align: 32, offset: 1536)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !35, file: !36, line: 305, baseType: !85, size: 160, align: 8, offset: 1568)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, align: 8, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 20)
!88 = !{i32 2, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !6, file: !7, line: 70, type: !11)
!92 = !DIExpression()
!93 = !DILocation(line: 70, column: 18, scope: !6)
!94 = !DILocation(line: 71, column: 17, scope: !6)
!95 = !DILocation(line: 71, column: 19, scope: !6)
!96 = !DILocation(line: 71, column: 14, scope: !6)
!97 = !DILocation(line: 71, column: 3, scope: !6)
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !12, file: !7, line: 74, type: !15)
!99 = !DILocation(line: 74, column: 24, scope: !12)
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offset", arg: 2, scope: !12, file: !7, line: 74, type: !10)
!101 = !DILocation(line: 74, column: 35, scope: !12)
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "octets", arg: 3, scope: !12, file: !7, line: 74, type: !10)
!103 = !DILocation(line: 74, column: 47, scope: !12)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 4, scope: !12, file: !7, line: 74, type: !15)
!105 = !DILocation(line: 74, column: 61, scope: !12)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loffs", scope: !12, file: !7, line: 75, type: !10)
!107 = !DILocation(line: 75, column: 7, scope: !12)
!108 = !DILocation(line: 76, column: 29, scope: !12)
!109 = !DILocation(line: 76, column: 17, scope: !12)
!110 = !DILocation(line: 76, column: 3, scope: !12)
!111 = !DILocation(line: 76, column: 15, scope: !12)
!112 = !DILocation(line: 77, column: 8, scope: !113)
!113 = distinct !DILexicalBlock(scope: !12, file: !7, line: 77, column: 3)
!114 = !DILocation(line: 77, column: 24, scope: !115)
!115 = distinct !DILexicalBlock(scope: !113, file: !7, line: 77, column: 3)
!116 = !DILocation(line: 77, column: 3, scope: !113)
!117 = !DILocation(line: 79, column: 16, scope: !118)
!118 = distinct !DILexicalBlock(scope: !119, file: !7, line: 79, column: 9)
!119 = distinct !DILexicalBlock(scope: !115, file: !7, line: 77, column: 55)
!120 = !DILocation(line: 79, column: 9, scope: !119)
!121 = !DILocation(line: 80, column: 24, scope: !122)
!122 = distinct !DILexicalBlock(scope: !118, file: !7, line: 79, column: 22)
!123 = !DILocation(line: 80, column: 38, scope: !122)
!124 = !DILocation(line: 80, column: 12, scope: !122)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch", scope: !119, file: !7, line: 78, type: !11)
!126 = !DILocation(line: 78, column: 10, scope: !119)
!127 = !DILocation(line: 81, column: 17, scope: !122)
!128 = !DILocation(line: 81, column: 7, scope: !122)
!129 = !DILocation(line: 81, column: 21, scope: !122)
!130 = !DILocation(line: 82, column: 25, scope: !122)
!131 = !DILocation(line: 82, column: 39, scope: !122)
!132 = !DILocation(line: 82, column: 61, scope: !122)
!133 = !DILocation(line: 82, column: 48, scope: !122)
!134 = !DILocation(line: 82, column: 66, scope: !122)
!135 = !DILocation(line: 82, column: 45, scope: !122)
!136 = !DILocation(line: 82, column: 24, scope: !122)
!137 = !DILocation(line: 82, column: 12, scope: !122)
!138 = !DILocation(line: 83, column: 17, scope: !122)
!139 = !DILocation(line: 83, column: 7, scope: !122)
!140 = !DILocation(line: 83, column: 21, scope: !122)
!141 = !DILocation(line: 84, column: 38, scope: !122)
!142 = !DILocation(line: 84, column: 25, scope: !122)
!143 = !DILocation(line: 84, column: 43, scope: !122)
!144 = !DILocation(line: 84, column: 65, scope: !122)
!145 = !DILocation(line: 84, column: 52, scope: !122)
!146 = !DILocation(line: 84, column: 70, scope: !122)
!147 = !DILocation(line: 84, column: 49, scope: !122)
!148 = !DILocation(line: 84, column: 24, scope: !122)
!149 = !DILocation(line: 84, column: 12, scope: !122)
!150 = !DILocation(line: 85, column: 17, scope: !122)
!151 = !DILocation(line: 85, column: 7, scope: !122)
!152 = !DILocation(line: 85, column: 21, scope: !122)
!153 = !DILocation(line: 86, column: 37, scope: !122)
!154 = !DILocation(line: 86, column: 24, scope: !122)
!155 = !DILocation(line: 86, column: 12, scope: !122)
!156 = !DILocation(line: 87, column: 17, scope: !122)
!157 = !DILocation(line: 87, column: 7, scope: !122)
!158 = !DILocation(line: 87, column: 21, scope: !122)
!159 = !DILocation(line: 88, column: 5, scope: !122)
!160 = !DILocation(line: 89, column: 18, scope: !161)
!161 = distinct !DILexicalBlock(scope: !162, file: !7, line: 89, column: 11)
!162 = distinct !DILexicalBlock(scope: !118, file: !7, line: 88, column: 12)
!163 = !DILocation(line: 89, column: 11, scope: !162)
!164 = !DILocation(line: 90, column: 26, scope: !165)
!165 = distinct !DILexicalBlock(scope: !161, file: !7, line: 89, column: 24)
!166 = !DILocation(line: 90, column: 40, scope: !165)
!167 = !DILocation(line: 90, column: 14, scope: !165)
!168 = !DILocation(line: 91, column: 19, scope: !165)
!169 = !DILocation(line: 91, column: 9, scope: !165)
!170 = !DILocation(line: 91, column: 23, scope: !165)
!171 = !DILocation(line: 92, column: 26, scope: !165)
!172 = !DILocation(line: 92, column: 40, scope: !165)
!173 = !DILocation(line: 92, column: 14, scope: !165)
!174 = !DILocation(line: 93, column: 19, scope: !165)
!175 = !DILocation(line: 93, column: 9, scope: !165)
!176 = !DILocation(line: 93, column: 23, scope: !165)
!177 = !DILocation(line: 94, column: 19, scope: !165)
!178 = !DILocation(line: 94, column: 9, scope: !165)
!179 = !DILocation(line: 94, column: 23, scope: !165)
!180 = !DILocation(line: 95, column: 19, scope: !165)
!181 = !DILocation(line: 95, column: 9, scope: !165)
!182 = !DILocation(line: 95, column: 23, scope: !165)
!183 = !DILocation(line: 96, column: 7, scope: !165)
!184 = !DILocation(line: 97, column: 20, scope: !185)
!185 = distinct !DILexicalBlock(scope: !186, file: !7, line: 97, column: 13)
!186 = distinct !DILexicalBlock(scope: !161, file: !7, line: 96, column: 14)
!187 = !DILocation(line: 97, column: 13, scope: !186)
!188 = !DILocation(line: 98, column: 29, scope: !189)
!189 = distinct !DILexicalBlock(scope: !185, file: !7, line: 97, column: 26)
!190 = !DILocation(line: 98, column: 28, scope: !189)
!191 = !DILocation(line: 98, column: 44, scope: !189)
!192 = !DILocation(line: 98, column: 16, scope: !189)
!193 = !DILocation(line: 99, column: 21, scope: !189)
!194 = !DILocation(line: 99, column: 11, scope: !189)
!195 = !DILocation(line: 99, column: 25, scope: !189)
!196 = !DILocation(line: 100, column: 29, scope: !189)
!197 = !DILocation(line: 100, column: 43, scope: !189)
!198 = !DILocation(line: 100, column: 65, scope: !189)
!199 = !DILocation(line: 100, column: 52, scope: !189)
!200 = !DILocation(line: 100, column: 70, scope: !189)
!201 = !DILocation(line: 100, column: 49, scope: !189)
!202 = !DILocation(line: 100, column: 28, scope: !189)
!203 = !DILocation(line: 100, column: 16, scope: !189)
!204 = !DILocation(line: 101, column: 21, scope: !189)
!205 = !DILocation(line: 101, column: 11, scope: !189)
!206 = !DILocation(line: 101, column: 25, scope: !189)
!207 = !DILocation(line: 102, column: 41, scope: !189)
!208 = !DILocation(line: 102, column: 28, scope: !189)
!209 = !DILocation(line: 102, column: 46, scope: !189)
!210 = !DILocation(line: 102, column: 16, scope: !189)
!211 = !DILocation(line: 103, column: 21, scope: !189)
!212 = !DILocation(line: 103, column: 11, scope: !189)
!213 = !DILocation(line: 103, column: 25, scope: !189)
!214 = !DILocation(line: 104, column: 21, scope: !189)
!215 = !DILocation(line: 104, column: 11, scope: !189)
!216 = !DILocation(line: 104, column: 25, scope: !189)
!217 = !DILocation(line: 105, column: 9, scope: !189)
!218 = !DILocation(line: 108, column: 3, scope: !119)
!219 = !DILocation(line: 77, column: 36, scope: !115)
!220 = !DILocation(line: 77, column: 49, scope: !115)
!221 = !DILocation(line: 77, column: 3, scope: !115)
!222 = !DILocation(line: 109, column: 13, scope: !12)
!223 = !DILocation(line: 109, column: 3, scope: !12)
!224 = !DILocation(line: 109, column: 17, scope: !12)
!225 = !DILocation(line: 110, column: 3, scope: !12)
!226 = !DILocation(line: 110, column: 15, scope: !12)
!227 = !DILocation(line: 111, column: 3, scope: !12)
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !16, file: !7, line: 114, type: !15)
!229 = !DILocation(line: 114, column: 19, scope: !16)
!230 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "limit", arg: 2, scope: !16, file: !7, line: 114, type: !10)
!231 = !DILocation(line: 114, column: 30, scope: !16)
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "output", arg: 3, scope: !16, file: !7, line: 114, type: !15)
!233 = !DILocation(line: 114, column: 43, scope: !16)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !16, file: !7, line: 115, type: !235)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 504, align: 8, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 63)
!238 = !DILocation(line: 115, column: 8, scope: !16)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !16, file: !7, line: 116, type: !10)
!240 = !DILocation(line: 116, column: 7, scope: !16)
!241 = !DILocation(line: 117, column: 3, scope: !16)
!242 = !DILocation(line: 117, column: 17, scope: !16)
!243 = !DILocation(line: 118, column: 16, scope: !244)
!244 = distinct !DILexicalBlock(scope: !245, file: !7, line: 118, column: 9)
!245 = distinct !DILexicalBlock(scope: !16, file: !7, line: 117, column: 26)
!246 = !DILocation(line: 118, column: 26, scope: !244)
!247 = !DILocation(line: 118, column: 9, scope: !245)
!248 = !DILocation(line: 119, column: 38, scope: !249)
!249 = distinct !DILexicalBlock(scope: !244, file: !7, line: 118, column: 33)
!250 = !DILocation(line: 119, column: 7, scope: !249)
!251 = !DILocation(line: 120, column: 14, scope: !249)
!252 = !DILocation(line: 121, column: 5, scope: !249)
!253 = !DILocation(line: 122, column: 40, scope: !254)
!254 = distinct !DILexicalBlock(scope: !244, file: !7, line: 121, column: 12)
!255 = !DILocation(line: 122, column: 50, scope: !254)
!256 = !DILocation(line: 122, column: 7, scope: !254)
!257 = !DILocation(line: 125, column: 20, scope: !245)
!258 = !DILocation(line: 125, column: 5, scope: !245)
!259 = !DILocation(line: 126, column: 23, scope: !245)
!260 = !DILocation(line: 126, column: 21, scope: !245)
!261 = !DILocation(line: 128, column: 3, scope: !16)
!262 = !DILocation(line: 129, column: 3, scope: !16)
!263 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !19, file: !7, line: 132, type: !15)
!264 = !DILocation(line: 132, column: 21, scope: !19)
!265 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "output", arg: 2, scope: !19, file: !7, line: 132, type: !15)
!266 = !DILocation(line: 132, column: 34, scope: !19)
!267 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 3, scope: !19, file: !7, line: 132, type: !10)
!268 = !DILocation(line: 132, column: 46, scope: !19)
!269 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "infilename", arg: 4, scope: !19, file: !7, line: 132, type: !15)
!270 = !DILocation(line: 132, column: 57, scope: !19)
!271 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !19, file: !7, line: 133, type: !10)
!272 = !DILocation(line: 133, column: 7, scope: !19)
!273 = !DILocation(line: 134, column: 3, scope: !19)
!274 = !DILocation(line: 135, column: 3, scope: !19)
!275 = !DILocation(line: 136, column: 3, scope: !19)
!276 = !DILocation(line: 138, column: 15, scope: !277)
!277 = distinct !DILexicalBlock(scope: !19, file: !7, line: 137, column: 3)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "namelen", scope: !19, file: !7, line: 133, type: !10)
!279 = !DILocation(line: 133, column: 13, scope: !19)
!280 = !DILocation(line: 139, column: 33, scope: !277)
!281 = !DILocation(line: 139, column: 31, scope: !277)
!282 = !DILocation(line: 139, column: 5, scope: !277)
!283 = !DILocation(line: 140, column: 12, scope: !277)
!284 = !DILocation(line: 140, column: 5, scope: !277)
!285 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !22, file: !7, line: 155, type: !10)
!286 = !DILocation(line: 155, column: 14, scope: !22)
!287 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !22, file: !7, line: 155, type: !25)
!288 = !DILocation(line: 155, column: 26, scope: !22)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !22, file: !7, line: 160, type: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!292 = !DILocation(line: 160, column: 35, scope: !22)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pre", scope: !22, file: !7, line: 161, type: !294)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !295, line: 30, size: 128, align: 64, elements: !296)
!295 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/gleison/tf/Benchmarks/BitBench/uuencode")
!296 = !{!297, !299}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !294, file: !295, line: 32, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !63, line: 139, baseType: !64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !294, file: !295, line: 33, baseType: !300, size: 64, align: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !63, line: 141, baseType: !64)
!301 = !DILocation(line: 161, column: 18, scope: !22)
!302 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "post", scope: !22, file: !7, line: 161, type: !294)
!303 = !DILocation(line: 161, column: 23, scope: !22)
!304 = !DILocation(line: 164, column: 11, scope: !22)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inbuf", scope: !22, file: !7, line: 160, type: !290)
!306 = !DILocation(line: 160, column: 18, scope: !22)
!307 = !DILocation(line: 165, column: 12, scope: !22)
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outbuf", scope: !22, file: !7, line: 160, type: !290)
!309 = !DILocation(line: 160, column: 26, scope: !22)
!310 = !DILocation(line: 167, column: 12, scope: !311)
!311 = distinct !DILexicalBlock(scope: !22, file: !7, line: 167, column: 7)
!312 = !DILocation(line: 167, column: 7, scope: !22)
!313 = !DILocation(line: 169, column: 21, scope: !314)
!314 = distinct !DILexicalBlock(scope: !315, file: !7, line: 169, column: 9)
!315 = distinct !DILexicalBlock(scope: !311, file: !7, line: 167, column: 17)
!316 = !DILocation(line: 169, column: 15, scope: !314)
!317 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !22, file: !7, line: 156, type: !32)
!318 = !DILocation(line: 156, column: 9, scope: !22)
!319 = !DILocation(line: 169, column: 36, scope: !314)
!320 = !DILocation(line: 169, column: 9, scope: !315)
!321 = !DILocation(line: 170, column: 14, scope: !322)
!322 = distinct !DILexicalBlock(scope: !314, file: !7, line: 169, column: 45)
!323 = !DILocation(line: 170, column: 7, scope: !322)
!324 = !DILocation(line: 171, column: 7, scope: !322)
!325 = !DILocation(line: 173, column: 9, scope: !315)
!326 = !DILocation(line: 174, column: 3, scope: !315)
!327 = !DILocation(line: 177, column: 10, scope: !328)
!328 = distinct !DILexicalBlock(scope: !311, file: !7, line: 176, column: 8)
!329 = !DILocation(line: 178, column: 11, scope: !328)
!330 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !22, file: !7, line: 156, type: !32)
!331 = !DILocation(line: 156, column: 14, scope: !22)
!332 = !DILocation(line: 180, column: 12, scope: !333)
!333 = distinct !DILexicalBlock(scope: !22, file: !7, line: 180, column: 7)
!334 = !DILocation(line: 180, column: 7, scope: !22)
!335 = !DILocation(line: 181, column: 5, scope: !336)
!336 = distinct !DILexicalBlock(scope: !333, file: !7, line: 180, column: 18)
!337 = !DILocation(line: 182, column: 5, scope: !336)
!338 = !DILocation(line: 184, column: 10, scope: !22)
!339 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !22, file: !7, line: 158, type: !29)
!340 = !DILocation(line: 158, column: 10, scope: !22)
!341 = !DILocation(line: 185, column: 3, scope: !22)
!342 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !22, file: !7, line: 157, type: !10)
!343 = !DILocation(line: 157, column: 7, scope: !22)
!344 = !DILocation(line: 186, column: 8, scope: !345)
!345 = distinct !DILexicalBlock(scope: !22, file: !7, line: 186, column: 3)
!346 = !DILocation(line: 186, column: 17, scope: !347)
!347 = distinct !DILexicalBlock(scope: !345, file: !7, line: 186, column: 3)
!348 = !DILocation(line: 186, column: 3, scope: !345)
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "infilename", scope: !350, file: !7, line: 187, type: !15)
!350 = distinct !DILexicalBlock(scope: !347, file: !7, line: 186, column: 30)
!351 = !DILocation(line: 187, column: 11, scope: !350)
!352 = !DILocation(line: 188, column: 40, scope: !350)
!353 = !DILocation(line: 188, column: 15, scope: !350)
!354 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outsize", scope: !22, file: !7, line: 159, type: !10)
!355 = !DILocation(line: 159, column: 7, scope: !22)
!356 = !DILocation(line: 189, column: 3, scope: !350)
