; ModuleID = '/home/gleison/tf/Benchmarks/BitBench/uuencode/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.timeval = type { i64, i64 }
%struct.timezone = type { i32, i32 }

@.str = private unnamed_addr constant [6 x i8] c" \0Aend\00", align 1
@.str.1 = private unnamed_addr constant [11 x i8] c"begin 640 \00", align 1
@.str.2 = private unnamed_addr constant [3 x i8] c" \0A\00", align 1
@.str.3 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@stdin = external global %struct._IO_FILE*, align 8
@stdout = external global %struct._IO_FILE*, align 8
@.str.4 = private unnamed_addr constant [26 x i8] c"Usage: uuencode [infile]\0A\00", align 1
@.str.5 = private unnamed_addr constant [11 x i8] c"uuencode.c\00", align 1
@.str.6 = private unnamed_addr constant [4 x i8] c"%d\0A\00", align 1

; Function Attrs: nounwind uwtable
define i32 @encode_char(i8 signext %c) #0 {
entry:
  %c.addr = alloca i8, align 1
  store i8 %c, i8* %c.addr, align 1
  call void @llvm.dbg.declare(metadata i8* %c.addr, metadata !91, metadata !92), !dbg !93
  %0 = load i8, i8* %c.addr, align 1, !dbg !94
  %conv = sext i8 %0 to i32, !dbg !94

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/BitBench/uuencode")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !12, !16, !19, !22, !26}
!6 = !DISubprogram(name: "encode_char", scope: !7, file: !7, line: 70, type: !8, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i8)* @encode_char, variables: !2)
!7 = !DIFile(filename: "/home/gleison/tf/Benchmarks/BitBench/uuencode/tmp.c", directory: "/home/gleison/tf/Benchmarks/BitBench/uuencode")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !11}
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!12 = !DISubprogram(name: "encode_line", scope: !7, file: !7, line: 74, type: !13, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false, function: void (i8*, i32, i32, i8*)* @encode_line, variables: !2)
!13 = !DISubroutineType(types: !14)
!14 = !{null, !15, !10, !10, !15}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!16 = !DISubprogram(name: "encode", scope: !7, file: !7, line: 114, type: !17, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false, function: void (i8*, i32, i8*)* @encode, variables: !2)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !15, !10, !15}
!19 = !DISubprogram(name: "do_encode", scope: !7, file: !7, line: 132, type: !20, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i8*, i8*, i32, i8*)* @do_encode, variables: !2)
!20 = !DISubroutineType(types: !21)
!21 = !{!10, !15, !15, !10, !15}
!22 = !DISubprogram(name: "main", scope: !7, file: !7, line: 155, type: !23, isLocal: false, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !2)
!23 = !DISubroutineType(types: !24)
!24 = !{!10, !10, !25}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!26 = !DISubprogram(name: "read_data", scope: !7, file: !7, line: 147, type: !27, isLocal: true, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: false, function: i64 (%struct._IO_FILE*, i8*)* @read_data, variables: !2)
!27 = !DISubroutineType(types: !28)
!28 = !{!29, !32, !4}
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !30, line: 62, baseType: !31)
!30 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/tf/Benchmarks/BitBench/uuencode")
!31 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !34, line: 48, baseType: !35)
!34 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/tf/Benchmarks/BitBench/uuencode")
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !36, line: 241, size: 1728, align: 64, elements: !37)
!36 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/tf/Benchmarks/BitBench/uuencode")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !58, !59, !60, !61, !65, !67, !69, !73, !76, !78, !79, !80, !81, !82, !83, !84}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !35, file: !36, line: 242, baseType: !10, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !35, file: !36, line: 247, baseType: !15, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !35, file: !36, line: 248, baseType: !15, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !35, file: !36, line: 249, baseType: !15, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !35, file: !36, line: 250, baseType: !15, size: 64, align: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !35, file: !36, line: 251, baseType: !15, size: 64, align: 64, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !35, file: !36, line: 252, baseType: !15, size: 64, align: 64, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !35, file: !36, line: 253, baseType: !15, size: 64, align: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !35, file: !36, line: 254, baseType: !15, size: 64, align: 64, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !35, file: !36, line: 256, baseType: !15, size: 64, align: 64, offset: 576)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !35, file: !36, line: 257, baseType: !15, size: 64, align: 64, offset: 640)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !35, file: !36, line: 258, baseType: !15, size: 64, align: 64, offset: 704)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !35, file: !36, line: 260, baseType: !51, size: 64, align: 64, offset: 768)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !36, line: 156, size: 192, align: 64, elements: !53)
!53 = !{!54, !55, !57}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !52, file: !36, line: 157, baseType: !51, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !52, file: !36, line: 158, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !52, file: !36, line: 162, baseType: !10, size: 32, align: 32, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !35, file: !36, line: 262, baseType: !56, size: 64, align: 64, offset: 832)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !35, file: !36, line: 264, baseType: !10, size: 32, align: 32, offset: 896)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !35, file: !36, line: 268, baseType: !10, size: 32, align: 32, offset: 928)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !35, file: !36, line: 270, baseType: !62, size: 64, align: 64, offset: 960)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !63, line: 131, baseType: !64)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/tf/Benchmarks/BitBench/uuencode")
!64 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !35, file: !36, line: 274, baseType: !66, size: 16, align: 16, offset: 1024)
!66 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !35, file: !36, line: 275, baseType: !68, size: 8, align: 8, offset: 1040)
!68 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !35, file: !36, line: 276, baseType: !70, size: 8, align: 8, offset: 1048)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, align: 8, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 1)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !35, file: !36, line: 280, baseType: !74, size: 64, align: 64, offset: 1088)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !36, line: 150, baseType: null)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !35, file: !36, line: 289, baseType: !77, size: 64, align: 64, offset: 1152)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !63, line: 132, baseType: !64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !35, file: !36, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !35, file: !36, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !35, file: !36, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !35, file: !36, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !35, file: !36, line: 302, baseType: !29, size: 64, align: 64, offset: 1472)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !35, file: !36, line: 303, baseType: !10, size: 32, align: 32, offset: 1536)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !35, file: !36, line: 305, baseType: !85, size: 160, align: 8, offset: 1568)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, align: 8, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 20)
!88 = !{i32 2, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !6, file: !7, line: 70, type: !11)
!92 = !DIExpression()
!93 = !DILocation(line: 70, column: 18, scope: !6)
!94 = !DILocation(line: 71, column: 17, scope: !6)
!95 = !DILocation(line: 71, column: 19, scope: !6)
!96 = !DILocation(line: 71, column: 14, scope: !6)
!97 = !DILocation(line: 71, column: 3, scope: !6)
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !12, file: !7, line: 74, type: !15)
!99 = !DILocation(line: 74, column: 24, scope: !12)
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offset", arg: 2, scope: !12, file: !7, line: 74, type: !10)
!101 = !DILocation(line: 74, column: 35, scope: !12)
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "octets", arg: 3, scope: !12, file: !7, line: 74, type: !10)
!103 = !DILocation(line: 74, column: 47, scope: !12)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 4, scope: !12, file: !7, line: 74, type: !15)
!105 = !DILocation(line: 74, column: 61, scope: !12)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loffs", scope: !12, file: !7, line: 75, type: !10)
!107 = !DILocation(line: 75, column: 7, scope: !12)
!108 = !DILocation(line: 76, column: 29, scope: !12)
!109 = !DILocation(line: 76, column: 17, scope: !12)
!110 = !DILocation(line: 76, column: 8, scope: !12)
!111 = !DILocation(line: 76, column: 3, scope: !12)
!112 = !DILocation(line: 76, column: 15, scope: !12)
!113 = !DILocation(line: 77, column: 8, scope: !114)
!114 = distinct !DILexicalBlock(scope: !12, file: !7, line: 77, column: 3)
!115 = !DILocation(line: 77, column: 17, scope: !116)
!116 = !DILexicalBlockFile(scope: !117, file: !7, discriminator: 2)
!117 = !DILexicalBlockFile(scope: !118, file: !7, discriminator: 1)
!118 = distinct !DILexicalBlock(scope: !114, file: !7, line: 77, column: 3)
!119 = !DILocation(line: 77, column: 24, scope: !118)
!120 = !DILocation(line: 77, column: 3, scope: !114)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch", scope: !122, file: !7, line: 78, type: !11)
!122 = distinct !DILexicalBlock(scope: !118, file: !7, line: 77, column: 55)
!123 = !DILocation(line: 78, column: 10, scope: !122)
!124 = !DILocation(line: 79, column: 9, scope: !125)
!125 = distinct !DILexicalBlock(scope: !122, file: !7, line: 79, column: 9)
!126 = !DILocation(line: 79, column: 16, scope: !125)
!127 = !DILocation(line: 79, column: 9, scope: !122)
!128 = !DILocation(line: 80, column: 30, scope: !129)
!129 = distinct !DILexicalBlock(scope: !125, file: !7, line: 79, column: 22)
!130 = !DILocation(line: 80, column: 24, scope: !129)
!131 = !DILocation(line: 80, column: 38, scope: !129)
!132 = !DILocation(line: 80, column: 12, scope: !129)
!133 = !DILocation(line: 80, column: 10, scope: !129)
!134 = !DILocation(line: 81, column: 23, scope: !129)
!135 = !DILocation(line: 81, column: 17, scope: !129)
!136 = !DILocation(line: 81, column: 7, scope: !129)
!137 = !DILocation(line: 81, column: 21, scope: !129)
!138 = !DILocation(line: 82, column: 31, scope: !129)
!139 = !DILocation(line: 82, column: 25, scope: !129)
!140 = !DILocation(line: 82, column: 39, scope: !129)
!141 = !DILocation(line: 82, column: 54, scope: !129)
!142 = !DILocation(line: 82, column: 61, scope: !129)
!143 = !DILocation(line: 82, column: 48, scope: !129)
!144 = !DILocation(line: 82, column: 66, scope: !129)
!145 = !DILocation(line: 82, column: 45, scope: !129)
!146 = !DILocation(line: 82, column: 24, scope: !129)
!147 = !DILocation(line: 82, column: 12, scope: !129)
!148 = !DILocation(line: 82, column: 10, scope: !129)
!149 = !DILocation(line: 83, column: 23, scope: !129)
!150 = !DILocation(line: 83, column: 17, scope: !129)
!151 = !DILocation(line: 83, column: 7, scope: !129)
!152 = !DILocation(line: 83, column: 21, scope: !129)
!153 = !DILocation(line: 84, column: 31, scope: !129)
!154 = !DILocation(line: 84, column: 38, scope: !129)
!155 = !DILocation(line: 84, column: 25, scope: !129)
!156 = !DILocation(line: 84, column: 43, scope: !129)
!157 = !DILocation(line: 84, column: 58, scope: !129)
!158 = !DILocation(line: 84, column: 65, scope: !129)
!159 = !DILocation(line: 84, column: 52, scope: !129)
!160 = !DILocation(line: 84, column: 70, scope: !129)
!161 = !DILocation(line: 84, column: 49, scope: !129)
!162 = !DILocation(line: 84, column: 24, scope: !129)
!163 = !DILocation(line: 84, column: 12, scope: !129)
!164 = !DILocation(line: 84, column: 10, scope: !129)
!165 = !DILocation(line: 85, column: 23, scope: !129)
!166 = !DILocation(line: 85, column: 17, scope: !129)
!167 = !DILocation(line: 85, column: 7, scope: !129)
!168 = !DILocation(line: 85, column: 21, scope: !129)
!169 = !DILocation(line: 86, column: 30, scope: !129)
!170 = !DILocation(line: 86, column: 37, scope: !129)
!171 = !DILocation(line: 86, column: 24, scope: !129)
!172 = !DILocation(line: 86, column: 12, scope: !129)
!173 = !DILocation(line: 86, column: 10, scope: !129)
!174 = !DILocation(line: 87, column: 23, scope: !129)
!175 = !DILocation(line: 87, column: 17, scope: !129)
!176 = !DILocation(line: 87, column: 7, scope: !129)
!177 = !DILocation(line: 87, column: 21, scope: !129)
!178 = !DILocation(line: 88, column: 5, scope: !129)
!179 = !DILocation(line: 89, column: 11, scope: !180)
!180 = distinct !DILexicalBlock(scope: !181, file: !7, line: 89, column: 11)
!181 = distinct !DILexicalBlock(scope: !125, file: !7, line: 88, column: 12)
!182 = !DILocation(line: 89, column: 18, scope: !180)
!183 = !DILocation(line: 89, column: 11, scope: !181)
!184 = !DILocation(line: 90, column: 32, scope: !185)
!185 = distinct !DILexicalBlock(scope: !180, file: !7, line: 89, column: 24)
!186 = !DILocation(line: 90, column: 26, scope: !185)
!187 = !DILocation(line: 90, column: 40, scope: !185)
!188 = !DILocation(line: 90, column: 14, scope: !185)
!189 = !DILocation(line: 90, column: 12, scope: !185)
!190 = !DILocation(line: 91, column: 25, scope: !185)
!191 = !DILocation(line: 91, column: 19, scope: !185)
!192 = !DILocation(line: 91, column: 9, scope: !185)
!193 = !DILocation(line: 91, column: 23, scope: !185)
!194 = !DILocation(line: 92, column: 32, scope: !185)
!195 = !DILocation(line: 92, column: 26, scope: !185)
!196 = !DILocation(line: 92, column: 40, scope: !185)
!197 = !DILocation(line: 92, column: 14, scope: !185)
!198 = !DILocation(line: 92, column: 12, scope: !185)
!199 = !DILocation(line: 93, column: 25, scope: !185)
!200 = !DILocation(line: 93, column: 19, scope: !185)
!201 = !DILocation(line: 93, column: 9, scope: !185)
!202 = !DILocation(line: 93, column: 23, scope: !185)
!203 = !DILocation(line: 94, column: 19, scope: !185)
!204 = !DILocation(line: 94, column: 9, scope: !185)
!205 = !DILocation(line: 94, column: 23, scope: !185)
!206 = !DILocation(line: 95, column: 19, scope: !185)
!207 = !DILocation(line: 95, column: 9, scope: !185)
!208 = !DILocation(line: 95, column: 23, scope: !185)
!209 = !DILocation(line: 96, column: 7, scope: !185)
!210 = !DILocation(line: 97, column: 13, scope: !211)
!211 = distinct !DILexicalBlock(scope: !212, file: !7, line: 97, column: 13)
!212 = distinct !DILexicalBlock(scope: !180, file: !7, line: 96, column: 14)
!213 = !DILocation(line: 97, column: 20, scope: !211)
!214 = !DILocation(line: 97, column: 13, scope: !212)
!215 = !DILocation(line: 98, column: 35, scope: !216)
!216 = distinct !DILexicalBlock(scope: !211, file: !7, line: 97, column: 26)
!217 = !DILocation(line: 98, column: 29, scope: !216)
!218 = !DILocation(line: 98, column: 28, scope: !216)
!219 = !DILocation(line: 98, column: 44, scope: !216)
!220 = !DILocation(line: 98, column: 16, scope: !216)
!221 = !DILocation(line: 98, column: 14, scope: !216)
!222 = !DILocation(line: 99, column: 27, scope: !216)
!223 = !DILocation(line: 99, column: 21, scope: !216)
!224 = !DILocation(line: 99, column: 11, scope: !216)
!225 = !DILocation(line: 99, column: 25, scope: !216)
!226 = !DILocation(line: 100, column: 35, scope: !216)
!227 = !DILocation(line: 100, column: 29, scope: !216)
!228 = !DILocation(line: 100, column: 43, scope: !216)
!229 = !DILocation(line: 100, column: 58, scope: !216)
!230 = !DILocation(line: 100, column: 65, scope: !216)
!231 = !DILocation(line: 100, column: 52, scope: !216)
!232 = !DILocation(line: 100, column: 70, scope: !216)
!233 = !DILocation(line: 100, column: 49, scope: !216)
!234 = !DILocation(line: 100, column: 28, scope: !216)
!235 = !DILocation(line: 100, column: 16, scope: !216)
!236 = !DILocation(line: 100, column: 14, scope: !216)
!237 = !DILocation(line: 101, column: 27, scope: !216)
!238 = !DILocation(line: 101, column: 21, scope: !216)
!239 = !DILocation(line: 101, column: 11, scope: !216)
!240 = !DILocation(line: 101, column: 25, scope: !216)
!241 = !DILocation(line: 102, column: 34, scope: !216)
!242 = !DILocation(line: 102, column: 41, scope: !216)
!243 = !DILocation(line: 102, column: 28, scope: !216)
!244 = !DILocation(line: 102, column: 46, scope: !216)
!245 = !DILocation(line: 102, column: 16, scope: !216)
!246 = !DILocation(line: 102, column: 14, scope: !216)
!247 = !DILocation(line: 103, column: 27, scope: !216)
!248 = !DILocation(line: 103, column: 21, scope: !216)
!249 = !DILocation(line: 103, column: 11, scope: !216)
!250 = !DILocation(line: 103, column: 25, scope: !216)
!251 = !DILocation(line: 104, column: 21, scope: !216)
!252 = !DILocation(line: 104, column: 11, scope: !216)
!253 = !DILocation(line: 104, column: 25, scope: !216)
!254 = !DILocation(line: 105, column: 9, scope: !216)
!255 = !DILocation(line: 108, column: 3, scope: !122)
!256 = !DILocation(line: 77, column: 36, scope: !118)
!257 = !DILocation(line: 77, column: 49, scope: !118)
!258 = !DILocation(line: 77, column: 3, scope: !118)
!259 = !DILocation(line: 109, column: 13, scope: !12)
!260 = !DILocation(line: 109, column: 3, scope: !12)
!261 = !DILocation(line: 109, column: 17, scope: !12)
!262 = !DILocation(line: 110, column: 8, scope: !12)
!263 = !DILocation(line: 110, column: 3, scope: !12)
!264 = !DILocation(line: 110, column: 15, scope: !12)
!265 = !DILocation(line: 111, column: 3, scope: !12)
!266 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !16, file: !7, line: 114, type: !15)
!267 = !DILocation(line: 114, column: 19, scope: !16)
!268 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "limit", arg: 2, scope: !16, file: !7, line: 114, type: !10)
!269 = !DILocation(line: 114, column: 30, scope: !16)
!270 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "output", arg: 3, scope: !16, file: !7, line: 114, type: !15)
!271 = !DILocation(line: 114, column: 43, scope: !16)
!272 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !16, file: !7, line: 115, type: !273)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 504, align: 8, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 63)
!276 = !DILocation(line: 115, column: 8, scope: !16)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !16, file: !7, line: 116, type: !10)
!278 = !DILocation(line: 116, column: 7, scope: !16)
!279 = !DILocation(line: 117, column: 3, scope: !16)
!280 = !DILocation(line: 117, column: 10, scope: !281)
!281 = !DILexicalBlockFile(scope: !282, file: !7, discriminator: 2)
!282 = !DILexicalBlockFile(scope: !16, file: !7, discriminator: 1)
!283 = !DILocation(line: 117, column: 19, scope: !16)
!284 = !DILocation(line: 117, column: 17, scope: !16)
!285 = !DILocation(line: 118, column: 10, scope: !286)
!286 = distinct !DILexicalBlock(scope: !287, file: !7, line: 118, column: 9)
!287 = distinct !DILexicalBlock(scope: !16, file: !7, line: 117, column: 26)
!288 = !DILocation(line: 118, column: 18, scope: !286)
!289 = !DILocation(line: 118, column: 16, scope: !286)
!290 = !DILocation(line: 118, column: 26, scope: !286)
!291 = !DILocation(line: 118, column: 9, scope: !287)
!292 = !DILocation(line: 119, column: 19, scope: !293)
!293 = distinct !DILexicalBlock(scope: !286, file: !7, line: 118, column: 33)
!294 = !DILocation(line: 119, column: 26, scope: !293)
!295 = !DILocation(line: 119, column: 38, scope: !293)
!296 = !DILocation(line: 119, column: 7, scope: !293)
!297 = !DILocation(line: 120, column: 14, scope: !293)
!298 = !DILocation(line: 121, column: 5, scope: !293)
!299 = !DILocation(line: 122, column: 19, scope: !300)
!300 = distinct !DILexicalBlock(scope: !286, file: !7, line: 121, column: 12)
!301 = !DILocation(line: 122, column: 26, scope: !300)
!302 = !DILocation(line: 122, column: 34, scope: !300)
!303 = !DILocation(line: 122, column: 42, scope: !300)
!304 = !DILocation(line: 122, column: 40, scope: !300)
!305 = !DILocation(line: 122, column: 50, scope: !300)
!306 = !DILocation(line: 122, column: 7, scope: !300)
!307 = !DILocation(line: 123, column: 16, scope: !300)
!308 = !DILocation(line: 123, column: 14, scope: !300)
!309 = !DILocation(line: 125, column: 12, scope: !287)
!310 = !DILocation(line: 125, column: 20, scope: !287)
!311 = !DILocation(line: 125, column: 5, scope: !287)
!312 = !DILocation(line: 126, column: 14, scope: !287)
!313 = !DILocation(line: 126, column: 30, scope: !287)
!314 = !DILocation(line: 126, column: 23, scope: !287)
!315 = !DILocation(line: 126, column: 21, scope: !287)
!316 = !DILocation(line: 126, column: 12, scope: !287)
!317 = !DILocation(line: 128, column: 10, scope: !16)
!318 = !DILocation(line: 128, column: 3, scope: !16)
!319 = !DILocation(line: 129, column: 3, scope: !16)
!320 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !19, file: !7, line: 132, type: !15)
!321 = !DILocation(line: 132, column: 21, scope: !19)
!322 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "output", arg: 2, scope: !19, file: !7, line: 132, type: !15)
!323 = !DILocation(line: 132, column: 34, scope: !19)
!324 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 3, scope: !19, file: !7, line: 132, type: !10)
!325 = !DILocation(line: 132, column: 46, scope: !19)
!326 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "infilename", arg: 4, scope: !19, file: !7, line: 132, type: !15)
!327 = !DILocation(line: 132, column: 57, scope: !19)
!328 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !19, file: !7, line: 133, type: !10)
!329 = !DILocation(line: 133, column: 7, scope: !19)
!330 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "namelen", scope: !19, file: !7, line: 133, type: !10)
!331 = !DILocation(line: 133, column: 13, scope: !19)
!332 = !DILocation(line: 134, column: 10, scope: !19)
!333 = !DILocation(line: 134, column: 3, scope: !19)
!334 = !DILocation(line: 135, column: 10, scope: !19)
!335 = !DILocation(line: 135, column: 18, scope: !19)
!336 = !DILocation(line: 135, column: 3, scope: !19)
!337 = !DILocation(line: 136, column: 10, scope: !19)
!338 = !DILocation(line: 136, column: 3, scope: !19)
!339 = !DILocation(line: 138, column: 22, scope: !340)
!340 = distinct !DILexicalBlock(scope: !19, file: !7, line: 137, column: 3)
!341 = !DILocation(line: 138, column: 15, scope: !340)
!342 = !DILocation(line: 138, column: 13, scope: !340)
!343 = !DILocation(line: 139, column: 12, scope: !340)
!344 = !DILocation(line: 139, column: 19, scope: !340)
!345 = !DILocation(line: 139, column: 24, scope: !340)
!346 = !DILocation(line: 139, column: 40, scope: !340)
!347 = !DILocation(line: 139, column: 33, scope: !340)
!348 = !DILocation(line: 139, column: 31, scope: !340)
!349 = !DILocation(line: 139, column: 5, scope: !340)
!350 = !DILocation(line: 140, column: 19, scope: !340)
!351 = !DILocation(line: 140, column: 12, scope: !340)
!352 = !DILocation(line: 140, column: 5, scope: !340)
!353 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !22, file: !7, line: 155, type: !10)
!354 = !DILocation(line: 155, column: 14, scope: !22)
!355 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !22, file: !7, line: 155, type: !25)
!356 = !DILocation(line: 155, column: 26, scope: !22)
!357 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !22, file: !7, line: 156, type: !32)
!358 = !DILocation(line: 156, column: 9, scope: !22)
!359 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !22, file: !7, line: 156, type: !32)
!360 = !DILocation(line: 156, column: 14, scope: !22)
!361 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !22, file: !7, line: 157, type: !10)
!362 = !DILocation(line: 157, column: 7, scope: !22)
!363 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !22, file: !7, line: 158, type: !29)
!364 = !DILocation(line: 158, column: 10, scope: !22)
!365 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outsize", scope: !22, file: !7, line: 159, type: !10)
!366 = !DILocation(line: 159, column: 7, scope: !22)
!367 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "time", scope: !22, file: !7, line: 159, type: !10)
!368 = !DILocation(line: 159, column: 16, scope: !22)
!369 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inbuf", scope: !22, file: !7, line: 160, type: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!372 = !DILocation(line: 160, column: 18, scope: !22)
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outbuf", scope: !22, file: !7, line: 160, type: !370)
!374 = !DILocation(line: 160, column: 26, scope: !22)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !22, file: !7, line: 160, type: !370)
!376 = !DILocation(line: 160, column: 35, scope: !22)
!377 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pre", scope: !22, file: !7, line: 161, type: !378)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !379, line: 30, size: 128, align: 64, elements: !380)
!379 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/gleison/tf/Benchmarks/BitBench/uuencode")
!380 = !{!381, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !378, file: !379, line: 32, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !63, line: 139, baseType: !64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !378, file: !379, line: 33, baseType: !384, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !63, line: 141, baseType: !64)
!385 = !DILocation(line: 161, column: 18, scope: !22)
!386 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "post", scope: !22, file: !7, line: 161, type: !378)
!387 = !DILocation(line: 161, column: 23, scope: !22)
!388 = !DILocation(line: 164, column: 11, scope: !22)
!389 = !DILocation(line: 164, column: 9, scope: !22)
!390 = !DILocation(line: 165, column: 12, scope: !22)
!391 = !DILocation(line: 165, column: 10, scope: !22)
!392 = !DILocation(line: 167, column: 7, scope: !393)
!393 = distinct !DILexicalBlock(scope: !22, file: !7, line: 167, column: 7)
!394 = !DILocation(line: 167, column: 12, scope: !393)
!395 = !DILocation(line: 167, column: 7, scope: !22)
!396 = !DILocation(line: 169, column: 21, scope: !397)
!397 = distinct !DILexicalBlock(scope: !398, file: !7, line: 169, column: 9)
!398 = distinct !DILexicalBlock(scope: !393, file: !7, line: 167, column: 17)
!399 = !DILocation(line: 169, column: 15, scope: !397)
!400 = !DILocation(line: 169, column: 13, scope: !397)
!401 = !DILocation(line: 169, column: 36, scope: !397)
!402 = !DILocation(line: 169, column: 9, scope: !398)
!403 = !DILocation(line: 170, column: 14, scope: !404)
!404 = distinct !DILexicalBlock(scope: !397, file: !7, line: 169, column: 45)
!405 = !DILocation(line: 170, column: 7, scope: !404)
!406 = !DILocation(line: 171, column: 7, scope: !404)
!407 = !DILocation(line: 173, column: 9, scope: !398)
!408 = !DILocation(line: 174, column: 3, scope: !398)
!409 = !DILocation(line: 177, column: 10, scope: !410)
!410 = distinct !DILexicalBlock(scope: !393, file: !7, line: 176, column: 8)
!411 = !DILocation(line: 177, column: 8, scope: !410)
!412 = !DILocation(line: 178, column: 11, scope: !410)
!413 = !DILocation(line: 178, column: 9, scope: !410)
!414 = !DILocation(line: 180, column: 7, scope: !415)
!415 = distinct !DILexicalBlock(scope: !22, file: !7, line: 180, column: 7)
!416 = !DILocation(line: 180, column: 12, scope: !415)
!417 = !DILocation(line: 180, column: 7, scope: !22)
!418 = !DILocation(line: 181, column: 5, scope: !419)
!419 = distinct !DILexicalBlock(scope: !415, file: !7, line: 180, column: 18)
!420 = !DILocation(line: 182, column: 5, scope: !419)
!421 = !DILocation(line: 184, column: 20, scope: !22)
!422 = !DILocation(line: 184, column: 24, scope: !22)
!423 = !DILocation(line: 184, column: 10, scope: !22)
!424 = !DILocation(line: 184, column: 8, scope: !22)
!425 = !DILocation(line: 185, column: 3, scope: !22)
!426 = !DILocation(line: 186, column: 10, scope: !427)
!427 = distinct !DILexicalBlock(scope: !22, file: !7, line: 186, column: 3)
!428 = !DILocation(line: 186, column: 8, scope: !427)
!429 = !DILocation(line: 186, column: 15, scope: !430)
!430 = !DILexicalBlockFile(scope: !431, file: !7, discriminator: 2)
!431 = !DILexicalBlockFile(scope: !432, file: !7, discriminator: 1)
!432 = distinct !DILexicalBlock(scope: !427, file: !7, line: 186, column: 3)
!433 = !DILocation(line: 186, column: 17, scope: !432)
!434 = !DILocation(line: 186, column: 3, scope: !427)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "infilename", scope: !436, file: !7, line: 187, type: !15)
!436 = distinct !DILexicalBlock(scope: !432, file: !7, line: 186, column: 30)
!437 = !DILocation(line: 187, column: 11, scope: !436)
!438 = !DILocation(line: 188, column: 25, scope: !436)
!439 = !DILocation(line: 188, column: 32, scope: !436)
!440 = !DILocation(line: 188, column: 40, scope: !436)
!441 = !DILocation(line: 188, column: 46, scope: !436)
!442 = !DILocation(line: 188, column: 15, scope: !436)
!443 = !DILocation(line: 188, column: 13, scope: !436)
!444 = !DILocation(line: 189, column: 3, scope: !436)
!445 = !DILocation(line: 186, column: 26, scope: !432)
!446 = !DILocation(line: 186, column: 3, scope: !432)
