; ModuleID = '/home/gleison/tf/Benchmarks/MiBench/security-rijndael/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.aes = type { i32, i32, [64 x i32], [64 x i32], i8 }

@fillrand.a = internal global [2 x i64] zeroinitializer, align 16
@fillrand.mt = internal global i64 1, align 8
@fillrand.count = internal global i64 4, align 8
@fillrand.r = internal global [4 x i8] zeroinitializer, align 1
@.str = private unnamed_addr constant [34 x i8] c"Error writing to output file: %s\0A\00", align 1
@.str.1 = private unnamed_addr constant [35 x i8] c"Error reading from input file: %s\0A\00", align 1
@.str.2 = private unnamed_addr constant [27 x i8] c"\0AThe input file is corrupt\00", align 1
@.str.3 = private unnamed_addr constant [59 x i8] c"usage: rijndael in_filename out_filename [d/e] key_in_hex\0A\00", align 1
@.str.4 = private unnamed_addr constant [37 x i8] c"key must be in hexadecimal notation\0A\00", align 1
@.str.5 = private unnamed_addr constant [27 x i8] c"The key value is too long\0A\00", align 1
@.str.6 = private unnamed_addr constant [56 x i8] c"The key length must be 32, 48 or 64 hexadecimal digits\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !13, globals: !108)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/MiBench/security-rijndael")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "aes_key", file: !4, line: 279, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./aes.h", directory: "/home/gleison/tf/Benchmarks/MiBench/security-rijndael")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "enc", value: 1)
!7 = !DIEnumerator(name: "dec", value: 2)
!8 = !DIEnumerator(name: "both", value: 3)
!9 = !{!10, !12, !11}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!12 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!13 = !{!14, !21, !101, !104}
!14 = !DISubprogram(name: "fillrand", scope: !15, file: !15, line: 74, type: !16, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false, function: void (i8*, i32)* @fillrand, variables: !20)
!15 = !DIFile(filename: "/home/gleison/tf/Benchmarks/MiBench/security-rijndael/tmp.c", directory: "/home/gleison/tf/Benchmarks/MiBench/security-rijndael")
!16 = !DISubroutineType(types: !17)
!17 = !{null, !18, !19}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !{}
!21 = !DISubprogram(name: "encfile", scope: !15, file: !15, line: 96, type: !22, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct._IO_FILE*, %struct._IO_FILE*, %struct.aes*, i8*)* @encfile, variables: !20)
!22 = !DISubroutineType(types: !23)
!23 = !{!19, !24, !24, !83, !18}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !26, line: 48, baseType: !27)
!26 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/tf/Benchmarks/MiBench/security-rijndael")
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !28, line: 241, size: 1728, align: 64, elements: !29)
!28 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/tf/Benchmarks/MiBench/security-rijndael")
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !50, !51, !52, !53, !57, !59, !61, !65, !68, !70, !72, !73, !74, !75, !78, !79}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !27, file: !28, line: 242, baseType: !19, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !27, file: !28, line: 247, baseType: !18, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !27, file: !28, line: 248, baseType: !18, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !27, file: !28, line: 249, baseType: !18, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !27, file: !28, line: 250, baseType: !18, size: 64, align: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !27, file: !28, line: 251, baseType: !18, size: 64, align: 64, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !27, file: !28, line: 252, baseType: !18, size: 64, align: 64, offset: 384)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !27, file: !28, line: 253, baseType: !18, size: 64, align: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !27, file: !28, line: 254, baseType: !18, size: 64, align: 64, offset: 512)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !27, file: !28, line: 256, baseType: !18, size: 64, align: 64, offset: 576)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !27, file: !28, line: 257, baseType: !18, size: 64, align: 64, offset: 640)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !27, file: !28, line: 258, baseType: !18, size: 64, align: 64, offset: 704)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !27, file: !28, line: 260, baseType: !43, size: 64, align: 64, offset: 768)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !28, line: 156, size: 192, align: 64, elements: !45)
!45 = !{!46, !47, !49}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !44, file: !28, line: 157, baseType: !43, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !44, file: !28, line: 158, baseType: !48, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !44, file: !28, line: 162, baseType: !19, size: 32, align: 32, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !27, file: !28, line: 262, baseType: !48, size: 64, align: 64, offset: 832)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !27, file: !28, line: 264, baseType: !19, size: 32, align: 32, offset: 896)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !27, file: !28, line: 268, baseType: !19, size: 32, align: 32, offset: 928)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !27, file: !28, line: 270, baseType: !54, size: 64, align: 64, offset: 960)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !55, line: 131, baseType: !56)
!55 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/tf/Benchmarks/MiBench/security-rijndael")
!56 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !27, file: !28, line: 274, baseType: !58, size: 16, align: 16, offset: 1024)
!58 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !27, file: !28, line: 275, baseType: !60, size: 8, align: 8, offset: 1040)
!60 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !27, file: !28, line: 276, baseType: !62, size: 8, align: 8, offset: 1048)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, align: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 1)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !27, file: !28, line: 280, baseType: !66, size: 64, align: 64, offset: 1088)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !28, line: 150, baseType: null)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !27, file: !28, line: 289, baseType: !69, size: 64, align: 64, offset: 1152)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !55, line: 132, baseType: !56)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !27, file: !28, line: 297, baseType: !71, size: 64, align: 64, offset: 1216)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !27, file: !28, line: 298, baseType: !71, size: 64, align: 64, offset: 1280)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !27, file: !28, line: 299, baseType: !71, size: 64, align: 64, offset: 1344)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !27, file: !28, line: 300, baseType: !71, size: 64, align: 64, offset: 1408)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !27, file: !28, line: 302, baseType: !76, size: 64, align: 64, offset: 1472)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !77, line: 62, baseType: !11)
!77 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/tf/Benchmarks/MiBench/security-rijndael")
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !27, file: !28, line: 303, baseType: !19, size: 32, align: 32, offset: 1536)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !27, file: !28, line: 305, baseType: !80, size: 160, align: 8, offset: 1568)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, align: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 20)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "aes", file: !4, line: 307, baseType: !85)
!85 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 297, size: 4192, align: 32, elements: !86)
!86 = !{!87, !92, !93, !97, !98}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Nkey", scope: !85, file: !4, line: 299, baseType: !88, size: 32, align: 32)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "word", file: !4, line: 226, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !90, line: 51, baseType: !91)
!90 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/gleison/tf/Benchmarks/MiBench/security-rijndael")
!91 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Nrnd", scope: !85, file: !4, line: 300, baseType: !88, size: 32, align: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "e_key", scope: !85, file: !4, line: 301, baseType: !94, size: 2048, align: 32, offset: 64)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 2048, align: 32, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "d_key", scope: !85, file: !4, line: 302, baseType: !94, size: 2048, align: 32, offset: 2112)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !85, file: !4, line: 306, baseType: !99, size: 8, align: 8, offset: 4160)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !4, line: 225, baseType: !100)
!100 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!101 = !DISubprogram(name: "decfile", scope: !15, file: !15, line: 159, type: !102, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct._IO_FILE*, %struct._IO_FILE*, %struct.aes*, i8*, i8*)* @decfile, variables: !20)
!102 = !DISubroutineType(types: !103)
!103 = !{!19, !24, !24, !83, !18, !18}
!104 = !DISubprogram(name: "main", scope: !15, file: !15, line: 229, type: !105, isLocal: false, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !20)
!105 = !DISubroutineType(types: !106)
!106 = !{!19, !19, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!108 = !{!109, !113, !114, !115}
!109 = !DIGlobalVariable(name: "a", scope: !14, file: !15, line: 75, type: !110, isLocal: true, isDefinition: true, variable: [2 x i64]* @fillrand.a)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 128, align: 64, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 2)
!113 = !DIGlobalVariable(name: "mt", scope: !14, file: !15, line: 75, type: !11, isLocal: true, isDefinition: true, variable: i64* @fillrand.mt)
!114 = !DIGlobalVariable(name: "count", scope: !14, file: !15, line: 75, type: !11, isLocal: true, isDefinition: true, variable: i64* @fillrand.count)
!115 = !DIGlobalVariable(name: "r", scope: !14, file: !15, line: 76, type: !116, isLocal: true, isDefinition: true, variable: [4 x i8]* @fillrand.r)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 32, align: 8, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 4)
!119 = !{i32 2, !"Dwarf Version", i32 4}
!120 = !{i32 2, !"Debug Info Version", i32 3}
!121 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 1, scope: !14, file: !15, line: 74, type: !18)
!123 = !DIExpression()
!124 = !DILocation(line: 74, column: 21, scope: !14)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !14, file: !15, line: 74, type: !19)
!126 = !DILocation(line: 74, column: 30, scope: !14)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !14, file: !15, line: 77, type: !19)
!128 = !DILocation(line: 77, column: 7, scope: !14)
!129 = !DILocation(line: 79, column: 7, scope: !130)
!130 = distinct !DILexicalBlock(scope: !14, file: !15, line: 79, column: 7)
!131 = !DILocation(line: 79, column: 7, scope: !14)
!132 = !DILocation(line: 80, column: 8, scope: !133)
!133 = distinct !DILexicalBlock(scope: !130, file: !15, line: 79, column: 11)
!134 = !DILocation(line: 82, column: 10, scope: !133)
!135 = !DILocation(line: 83, column: 10, scope: !133)
!136 = !DILocation(line: 84, column: 3, scope: !133)
!137 = !DILocation(line: 86, column: 10, scope: !138)
!138 = distinct !DILexicalBlock(scope: !14, file: !15, line: 86, column: 3)
!139 = !DILocation(line: 86, column: 8, scope: !138)
!140 = !DILocation(line: 86, column: 15, scope: !141)
!141 = !DILexicalBlockFile(scope: !142, file: !15, discriminator: 2)
!142 = !DILexicalBlockFile(scope: !143, file: !15, discriminator: 1)
!143 = distinct !DILexicalBlock(scope: !138, file: !15, line: 86, column: 3)
!144 = !DILocation(line: 86, column: 19, scope: !143)
!145 = !DILocation(line: 86, column: 17, scope: !143)
!146 = !DILocation(line: 86, column: 3, scope: !138)
!147 = !DILocation(line: 87, column: 9, scope: !148)
!148 = distinct !DILexicalBlock(scope: !149, file: !15, line: 87, column: 9)
!149 = distinct !DILexicalBlock(scope: !143, file: !15, line: 86, column: 29)
!150 = !DILocation(line: 87, column: 15, scope: !148)
