; ModuleID = '/home/gleison/tf/Benchmarks/Prolangs-C/agrep/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.snode = type { %struct.rnode*, i32, %struct.snode* }
%struct.rnode = type { i16, %union.anon, i16, %struct.pnode*, %struct.pnode* }
%union.anon = type { %struct.anon.2 }
%struct.anon.2 = type { %struct.rnode*, %struct.rnode* }
%struct.pnode = type { i32, %struct.pnode* }

; Function Attrs: nounwind uwtable
define %struct.snode* @Push(%struct.snode** %s, %struct.rnode* %v) #0 {
entry:
  %retval = alloca %struct.snode*, align 8
  %s.addr = alloca %struct.snode**, align 8
  %v.addr = alloca %struct.rnode*, align 8
  %node = alloca %struct.snode*, align 8
  store %struct.snode** %s, %struct.snode*** %s.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.snode*** %s.addr, metadata !94, metadata !95), !dbg !96
  store %struct.rnode* %v, %struct.rnode** %v.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.rnode** %v.addr, metadata !97, metadata !95), !dbg !98
  call void @llvm.dbg.declare(metadata %struct.snode** %node, metadata !99, metadata !95), !dbg !100
  %call = call noalias i8* @malloc(i64 24) #3, !dbg !101
  %0 = bitcast i8* %call to %struct.snode*, !dbg !102
  store %struct.snode* %0, %struct.snode** %node, align 8, !dbg !103
  %1 = load %struct.snode**, %struct.snode*** %s.addr, align 8, !dbg !104
  %cmp = icmp eq %struct.snode** %1, null, !dbg !106

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !63)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/agrep")
!2 = !{}
!3 = !{!4, !62, !53}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "Stack", file: !5, line: 116, baseType: !6)
!5 = !DIFile(filename: "./re.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/agrep")
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "snode", file: !5, line: 112, size: 192, align: 64, elements: !8)
!8 = !{!9, !60, !61}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !7, file: !5, line: 113, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Re_node", file: !5, line: 104, baseType: !11)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "rnode", file: !5, line: 92, size: 384, align: 64, elements: !13)
!13 = !{!14, !16, !51, !52, !59}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !12, file: !5, line: 93, baseType: !15, size: 16, align: 16)
!15 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !12, file: !5, line: 101, baseType: !17, size: 128, align: 64, offset: 64)
!17 = !DICompositeType(tag: DW_TAG_union_type, scope: !12, file: !5, line: 94, size: 128, align: 64, elements: !18)
!18 = !{!19, !45, !46}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "lit", scope: !17, file: !5, line: 95, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "Re_Lit", file: !5, line: 85, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, file: !5, line: 78, size: 128, align: 64, elements: !23)
!23 = !{!24, !26, !27}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !22, file: !5, line: 79, baseType: !25, size: 32, align: 32)
!25 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "l_type", scope: !22, file: !5, line: 80, baseType: !15, size: 16, align: 16, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !22, file: !5, line: 84, baseType: !28, size: 64, align: 64, offset: 64)
!28 = !DICompositeType(tag: DW_TAG_union_type, scope: !22, file: !5, line: 81, size: 64, align: 64, elements: !29)
!29 = !{!30, !32}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !28, file: !5, line: 82, baseType: !31, size: 8, align: 8)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "cset", scope: !28, file: !5, line: 83, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ch_Set", file: !5, line: 76, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "ch_set", file: !5, line: 73, size: 128, align: 64, elements: !36)
!36 = !{!37, !44}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !35, file: !5, line: 74, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ch_Range", file: !5, line: 71, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, file: !5, line: 69, size: 16, align: 8, elements: !41)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "low_bd", scope: !40, file: !5, line: 70, baseType: !31, size: 8, align: 8)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "hi_bd", scope: !40, file: !5, line: 70, baseType: !31, size: 8, align: 8, offset: 8)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "rest", scope: !35, file: !5, line: 75, baseType: !34, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !17, file: !5, line: 96, baseType: !11, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !17, file: !5, line: 100, baseType: !47, size: 128, align: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, scope: !17, file: !5, line: 97, size: 128, align: 64, elements: !48)
!48 = !{!49, !50}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "l_child", scope: !47, file: !5, line: 98, baseType: !11, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "r_child", scope: !47, file: !5, line: 99, baseType: !11, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "nullable", scope: !12, file: !5, line: 102, baseType: !15, size: 16, align: 16, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "firstposn", scope: !12, file: !5, line: 103, baseType: !53, size: 64, align: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pset", file: !5, line: 90, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "pnode", file: !5, line: 87, size: 128, align: 64, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "posnum", scope: !55, file: !5, line: 88, baseType: !25, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "nextpos", scope: !55, file: !5, line: 89, baseType: !54, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "lastposn", scope: !12, file: !5, line: 103, baseType: !53, size: 64, align: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !7, file: !5, line: 114, baseType: !25, size: 32, align: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !5, line: 115, baseType: !6, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!63 = !{!64, !69, !72, !75, !78, !81, !84, !87, !90}
!64 = !DISubprogram(name: "Push", scope: !65, file: !65, line: 14, type: !66, isLocal: false, isDefinition: true, scopeLine: 14, flags: DIFlagPrototyped, isOptimized: false, function: %struct.snode* (%struct.snode**, %struct.rnode*)* @Push, variables: !2)
!65 = !DIFile(filename: "/home/gleison/tf/Benchmarks/Prolangs-C/agrep/tmp.c", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/agrep")
!66 = !DISubroutineType(types: !67)
!67 = !{!4, !68, !10}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!69 = !DISubprogram(name: "Pop", scope: !65, file: !65, line: 30, type: !70, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, function: %struct.rnode* (%struct.snode**)* @Pop, variables: !2)
!70 = !DISubroutineType(types: !71)
!71 = !{!10, !68}
!72 = !DISubprogram(name: "Top", scope: !65, file: !65, line: 45, type: !73, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, function: %struct.rnode* (%struct.snode*)* @Top, variables: !2)
!73 = !DISubroutineType(types: !74)
!74 = !{!10, !4}
!75 = !DISubprogram(name: "Size", scope: !65, file: !65, line: 52, type: !76, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.snode*)* @Size, variables: !2)
!76 = !DISubroutineType(types: !77)
!77 = !{!25, !4}
!78 = !DISubprogram(name: "occurs_in", scope: !65, file: !65, line: 65, type: !79, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, %struct.pnode*)* @occurs_in, variables: !2)
!79 = !DISubroutineType(types: !80)
!80 = !{!25, !25, !53}
!81 = !DISubprogram(name: "pset_union", scope: !65, file: !65, line: 76, type: !82, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false, function: %struct.pnode* (%struct.pnode*, %struct.pnode*)* @pset_union, variables: !2)
!82 = !DISubroutineType(types: !83)
!83 = !{!53, !53, !53}
!84 = !DISubprogram(name: "create_pos", scope: !65, file: !65, line: 105, type: !85, isLocal: false, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: false, function: %struct.pnode* (i32)* @create_pos, variables: !2)
!85 = !DISubroutineType(types: !86)
!86 = !{!53, !25}
!87 = !DISubprogram(name: "subset_pset", scope: !65, file: !65, line: 119, type: !88, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.pnode*, %struct.pnode*)* @subset_pset, variables: !2)
!88 = !DISubroutineType(types: !89)
!89 = !{!25, !53, !53}
!90 = !DISubprogram(name: "eq_pset", scope: !65, file: !65, line: 134, type: !88, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.pnode*, %struct.pnode*)* @eq_pset, variables: !2)
!91 = !{i32 2, !"Dwarf Version", i32 4}
!92 = !{i32 2, !"Debug Info Version", i32 3}
!93 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !64, file: !65, line: 14, type: !68)
!95 = !DIExpression()
!96 = !DILocation(line: 14, column: 19, scope: !64)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !64, file: !65, line: 14, type: !10)
!98 = !DILocation(line: 14, column: 30, scope: !64)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !64, file: !65, line: 15, type: !4)
!100 = !DILocation(line: 15, column: 9, scope: !64)
!101 = !DILocation(line: 17, column: 17, scope: !64)
!102 = !DILocation(line: 17, column: 10, scope: !64)
!103 = !DILocation(line: 17, column: 8, scope: !64)
!104 = !DILocation(line: 18, column: 7, scope: !105)
