; ModuleID = 'result.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.task = type { %struct.task*, i32, i32, %struct.packet*, i32, %struct.task* (%struct.packet*)*, i64, i64 }
%struct.packet = type { %struct.packet*, i32, i32, i32, [4 x i8] }

@alphabet = global [28 x i8] c"0ABCDEFGHIJKLMNOPQRSTUVWXYZ\00", align 16
@tasktab = global [11 x %struct.task*] zeroinitializer, align 16
@tasklist = global %struct.task* null, align 8
@qpktcount = global i32 0, align 4
@holdcount = global i32 0, align 4
@tracing = global i32 1, align 4
@layout = global i32 0, align 4
@.str = private unnamed_addr constant [2 x i8] c"\0A\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"%c\00", align 1
@tcb = common global %struct.task* null, align 8
@taskid = common global i64 0, align 8
@v1 = common global i64 0, align 8
@v2 = common global i64 0, align 8
@.str.2 = private unnamed_addr constant [17 x i8] c"\0ABad task id %d\0A\00", align 1
@.str.3 = private unnamed_addr constant [21 x i8] c"Bench mark starting\0A\00", align 1
@.str.4 = private unnamed_addr constant [10 x i8] c"Starting\0A\00", align 1
@.str.5 = private unnamed_addr constant [10 x i8] c"finished\0A\00", align 1
@.str.6 = private unnamed_addr constant [33 x i8] c"qpkt count = %d  holdcount = %d\0A\00", align 1
@.str.7 = private unnamed_addr constant [19 x i8] c"These results are \00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !33, globals: !65)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/Misc/richards_benchmark")
!2 = !{}
!3 = !{!4, !13, !31}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "task", file: !6, line: 72, size: 448, align: 64, elements: !7)
!6 = !DIFile(filename: "/home/gleison/tf/Benchmarks/Misc/richards_benchmark/tmp.c", directory: "/home/gleison/tf/Benchmarks/Misc/richards_benchmark")
!7 = !{!8, !9, !11, !12, !25, !26, !30, !32}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "t_link", scope: !5, file: !6, line: 73, baseType: !4, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "t_id", scope: !5, file: !6, line: 74, baseType: !10, size: 32, align: 32, offset: 64)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "t_pri", scope: !5, file: !6, line: 75, baseType: !10, size: 32, align: 32, offset: 96)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "t_wkq", scope: !5, file: !6, line: 76, baseType: !13, size: 64, align: 64, offset: 128)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "packet", file: !6, line: 64, size: 192, align: 64, elements: !15)
!15 = !{!16, !17, !18, !19, !20}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "p_link", scope: !14, file: !6, line: 65, baseType: !13, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "p_id", scope: !14, file: !6, line: 66, baseType: !10, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "p_kind", scope: !14, file: !6, line: 67, baseType: !10, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "p_a1", scope: !14, file: !6, line: 68, baseType: !10, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "p_a2", scope: !14, file: !6, line: 69, baseType: !21, size: 32, align: 8, offset: 160)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 32, align: 8, elements: !23)
!22 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!23 = !{!24}
!24 = !DISubrange(count: 4)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "t_state", scope: !5, file: !6, line: 77, baseType: !10, size: 32, align: 32, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "t_fn", scope: !5, file: !6, line: 78, baseType: !27, size: 64, align: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{!4, !13}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "t_v1", scope: !5, file: !6, line: 79, baseType: !31, size: 64, align: 64, offset: 320)
!31 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "t_v2", scope: !5, file: !6, line: 80, baseType: !31, size: 64, align: 64, offset: 384)
!33 = !{!34, !37, !40, !43, !46, !49, !50, !53, !54, !55, !56, !57, !58, !59, !62}
!34 = !DISubprogram(name: "createtask", scope: !6, file: !6, line: 97, type: !35, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false, function: void (i32, i32, %struct.packet*, i32, %struct.task* (%struct.packet*)*, i64, i64)* @createtask, variables: !2)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !10, !10, !13, !10, !27, !31, !31}
!37 = !DISubprogram(name: "pkt", scope: !6, file: !6, line: 118, type: !38, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: false, function: %struct.packet* (%struct.packet*, i32, i32)* @pkt, variables: !2)
!38 = !DISubroutineType(types: !39)
!39 = !{!13, !13, !10, !10}
!40 = !DISubprogram(name: "trace", scope: !6, file: !6, line: 133, type: !41, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: false, function: void (i8)* @trace, variables: !2)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !22}
!43 = !DISubprogram(name: "schedule", scope: !6, file: !6, line: 142, type: !44, isLocal: false, isDefinition: true, scopeLine: 142, isOptimized: false, function: void ()* @schedule, variables: !2)
!44 = !DISubroutineType(types: !45)
!45 = !{null}
!46 = !DISubprogram(name: "Wait", scope: !6, file: !6, line: 183, type: !47, isLocal: false, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: false, function: %struct.task* ()* @Wait, variables: !2)
!47 = !DISubroutineType(types: !48)
!48 = !{!4}
!49 = !DISubprogram(name: "holdself", scope: !6, file: !6, line: 188, type: !47, isLocal: false, isDefinition: true, scopeLine: 188, flags: DIFlagPrototyped, isOptimized: false, function: %struct.task* ()* @holdself, variables: !2)
!50 = !DISubprogram(name: "findtcb", scope: !6, file: !6, line: 194, type: !51, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: false, function: %struct.task* (i32)* @findtcb, variables: !2)
!51 = !DISubroutineType(types: !52)
!52 = !{!4, !10}
!53 = !DISubprogram(name: "release", scope: !6, file: !6, line: 204, type: !51, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: false, function: %struct.task* (i32)* @release, variables: !2)
!54 = !DISubprogram(name: "qpkt", scope: !6, file: !6, line: 218, type: !28, isLocal: false, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: false, function: %struct.task* (%struct.packet*)* @qpkt, variables: !2)
!55 = !DISubprogram(name: "idlefn", scope: !6, file: !6, line: 242, type: !28, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: false, function: %struct.task* (%struct.packet*)* @idlefn, variables: !2)
!56 = !DISubprogram(name: "workfn", scope: !6, file: !6, line: 256, type: !28, isLocal: false, isDefinition: true, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: false, function: %struct.task* (%struct.packet*)* @workfn, variables: !2)
!57 = !DISubprogram(name: "handlerfn", scope: !6, file: !6, line: 276, type: !28, isLocal: false, isDefinition: true, scopeLine: 276, flags: DIFlagPrototyped, isOptimized: false, function: %struct.task* (%struct.packet*)* @handlerfn, variables: !2)
!58 = !DISubprogram(name: "devfn", scope: !6, file: !6, line: 304, type: !28, isLocal: false, isDefinition: true, scopeLine: 304, flags: DIFlagPrototyped, isOptimized: false, function: %struct.task* (%struct.packet*)* @devfn, variables: !2)
!59 = !DISubprogram(name: "append", scope: !6, file: !6, line: 319, type: !60, isLocal: false, isDefinition: true, scopeLine: 319, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.packet*, %struct.packet*)* @append, variables: !2)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !13, !13}
