; ModuleID = '/home/gleison/tf/Benchmarks/Ptrdist/anagram/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.Letter = type { i32, i32, i32, i32 }
%struct.Word = type { [2 x i64], i8*, i32 }
%struct.__jmp_buf_tag = type { [8 x i64], i32, %struct.__sigset_t }
%struct.__sigset_t = type { [16 x i64] }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@cchMinLength = global i32 3, align 4
@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [24 x i8] c"Cannot stat dictionary\0A\00", align 1
@pchDictionary = common global i8* null, align 8
@.str.1 = private unnamed_addr constant [42 x i8] c"Unable to allocate memory for dictionary\0A\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.3 = private unnamed_addr constant [24 x i8] c"Cannot open dictionary\0A\00", align 1
@.str.4 = private unnamed_addr constant [32 x i8] c"main dictionary has %u entries\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !43, globals: !81)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/Ptrdist/anagram")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/gleison/tf/Benchmarks/Ptrdist/anagram")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "_ISupper", value: 256)
!7 = !DIEnumerator(name: "_ISlower", value: 512)
!8 = !DIEnumerator(name: "_ISalpha", value: 1024)
!9 = !DIEnumerator(name: "_ISdigit", value: 2048)
!10 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!11 = !DIEnumerator(name: "_ISspace", value: 8192)
!12 = !DIEnumerator(name: "_ISprint", value: 16384)
!13 = !DIEnumerator(name: "_ISgraph", value: 32768)
!14 = !DIEnumerator(name: "_ISblank", value: 1)
!15 = !DIEnumerator(name: "_IScntrl", value: 2)
!16 = !DIEnumerator(name: "_ISpunct", value: 4)
!17 = !DIEnumerator(name: "_ISalnum", value: 8)
!18 = !{!19, !20, !22, !23, !24, !25, !27, !38}
!19 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!23 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quad", file: !26, line: 151, baseType: !19)
!26 = !DIFile(filename: "/home/gleison/tf/Benchmarks/Ptrdist/anagram/tmp.c", directory: "/home/gleison/tf/Benchmarks/Ptrdist/anagram")
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "Word", file: !26, line: 206, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 202, size: 256, align: 64, elements: !30)
!30 = !{!31, !35, !36}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "aqMask", scope: !29, file: !26, line: 203, baseType: !32, size: 128, align: 64)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 128, align: 64, elements: !33)
!33 = !{!34}
!34 = !DISubrange(count: 2)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "pchWord", scope: !29, file: !26, line: 204, baseType: !20, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "cchLength", scope: !29, file: !26, line: 205, baseType: !37, size: 32, align: 32, offset: 192)
!37 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!23, !41, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!43 = !{!44, !48, !51, !52, !56, !57, !58, !59, !62, !63, !64, !70, !73, !74, !77}
!44 = !DISubprogram(name: "Fatal", scope: !26, file: !26, line: 247, type: !45, isLocal: false, isDefinition: true, scopeLine: 247, flags: DIFlagPrototyped, isOptimized: false, function: void (i8*, i32)* @Fatal, variables: !47)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !20, !37}
!47 = !{}
!48 = !DISubprogram(name: "ReadDict", scope: !26, file: !26, line: 264, type: !49, isLocal: false, isDefinition: true, scopeLine: 264, flags: DIFlagPrototyped, isOptimized: false, function: void (i8*)* @ReadDict, variables: !47)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !20}
!51 = !DISubprogram(name: "BuildMask", scope: !26, file: !26, line: 310, type: !49, isLocal: false, isDefinition: true, scopeLine: 310, flags: DIFlagPrototyped, isOptimized: false, function: void (i8*)* @BuildMask, variables: !47)
!52 = !DISubprogram(name: "NewWord", scope: !26, file: !26, line: 367, type: !53, isLocal: false, isDefinition: true, scopeLine: 367, flags: DIFlagPrototyped, isOptimized: false, function: %struct.Word* ()* @NewWord, variables: !47)
!53 = !DISubroutineType(types: !54)
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWord", file: !26, line: 207, baseType: !27)
!56 = !DISubprogram(name: "wprint", scope: !26, file: !26, line: 381, type: !49, isLocal: false, isDefinition: true, scopeLine: 381, flags: DIFlagPrototyped, isOptimized: false, function: void (i8*)* @wprint, variables: !47)
!57 = !DISubprogram(name: "NextWord", scope: !26, file: !26, line: 388, type: !53, isLocal: false, isDefinition: true, scopeLine: 388, flags: DIFlagPrototyped, isOptimized: false, function: %struct.Word* ()* @NextWord, variables: !47)
!58 = !DISubprogram(name: "BuildWord", scope: !26, file: !26, line: 402, type: !49, isLocal: false, isDefinition: true, scopeLine: 402, flags: DIFlagPrototyped, isOptimized: false, function: void (i8*)* @BuildWord, variables: !47)
!59 = !DISubprogram(name: "AddWords", scope: !26, file: !26, line: 443, type: !60, isLocal: false, isDefinition: true, scopeLine: 443, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @AddWords, variables: !47)
!60 = !DISubroutineType(types: !61)
!61 = !{null}
!62 = !DISubprogram(name: "DumpCandidates", scope: !26, file: !26, line: 457, type: !60, isLocal: false, isDefinition: true, scopeLine: 457, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @DumpCandidates, variables: !47)
!63 = !DISubprogram(name: "DumpWords", scope: !26, file: !26, line: 485, type: !60, isLocal: false, isDefinition: true, scopeLine: 485, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @DumpWords, variables: !47)
!64 = !DISubprogram(name: "FindAnagram", scope: !26, file: !26, line: 506, type: !65, isLocal: false, isDefinition: true, scopeLine: 506, flags: DIFlagPrototyped, isOptimized: false, function: void (i64*, %struct.Word**, i32)* @FindAnagram, variables: !47)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !67, !68, !23}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "PPWord", file: !26, line: 208, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!70 = !DISubprogram(name: "CompareFrequency", scope: !26, file: !26, line: 585, type: !71, isLocal: false, isDefinition: true, scopeLine: 585, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i8*, i8*)* @CompareFrequency, variables: !47)
!71 = !DISubroutineType(types: !72)
!72 = !{!23, !20, !20}
!73 = !DISubprogram(name: "SortCandidates", scope: !26, file: !26, line: 597, type: !60, isLocal: false, isDefinition: true, scopeLine: 597, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @SortCandidates, variables: !47)
!74 = !DISubprogram(name: "GetPhrase", scope: !26, file: !26, line: 614, type: !75, isLocal: false, isDefinition: true, scopeLine: 614, flags: DIFlagPrototyped, isOptimized: false, function: i8* (i8*, i32)* @GetPhrase, variables: !47)
!75 = !DISubroutineType(types: !76)
!76 = !{!20, !20, !23}
!77 = !DISubprogram(name: "main", scope: !26, file: !26, line: 630, type: !78, isLocal: false, isDefinition: true, scopeLine: 630, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !47)
!78 = !DISubroutineType(types: !79)
!79 = !{!23, !23, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!81 = !{!82, !83, !84, !88, !89, !100, !101, !102, !103, !105, !107, !108, !112, !113, !138, !139}
!82 = !DIGlobalVariable(name: "cchMinLength", scope: !0, file: !26, line: 233, type: !23, isLocal: false, isDefinition: true, variable: i32* @cchMinLength)
!83 = !DIGlobalVariable(name: "X", scope: !63, file: !26, line: 486, type: !23, isLocal: true, isDefinition: true, variable: i32* @DumpWords.X)
!84 = !DIGlobalVariable(name: "apwCand", scope: !0, file: !26, line: 210, type: !85, isLocal: false, isDefinition: true, variable: [5000 x %struct.Word*]* @apwCand)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 320000, align: 64, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 5000)
!88 = !DIGlobalVariable(name: "cpwCand", scope: !0, file: !26, line: 211, type: !37, isLocal: false, isDefinition: true, variable: i32* @cpwCand)
!89 = !DIGlobalVariable(name: "alPhrase", scope: !0, file: !26, line: 225, type: !90, isLocal: false, isDefinition: true, variable: [26 x %struct.Letter]* @alPhrase)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 3328, align: 32, elements: !98)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "Letter", file: !26, line: 222, baseType: !92)
!92 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 217, size: 128, align: 32, elements: !93)
!93 = !{!94, !95, !96, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "uFrequency", scope: !92, file: !26, line: 218, baseType: !37, size: 32, align: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "uShift", scope: !92, file: !26, line: 219, baseType: !37, size: 32, align: 32, offset: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "uBits", scope: !92, file: !26, line: 220, baseType: !37, size: 32, align: 32, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "iq", scope: !92, file: !26, line: 221, baseType: !37, size: 32, align: 32, offset: 96)
!98 = !{!99}
!99 = !DISubrange(count: 26)
!100 = !DIGlobalVariable(name: "cchPhraseLength", scope: !0, file: !26, line: 228, type: !23, isLocal: false, isDefinition: true, variable: i32* @cchPhraseLength)
!101 = !DIGlobalVariable(name: "aqMainMask", scope: !0, file: !26, line: 230, type: !32, isLocal: false, isDefinition: true, variable: [2 x i64]* @aqMainMask)
!102 = !DIGlobalVariable(name: "aqMainSign", scope: !0, file: !26, line: 231, type: !32, isLocal: false, isDefinition: true, variable: [2 x i64]* @aqMainSign)
!103 = !DIGlobalVariable(name: "auGlobalFrequency", scope: !0, file: !26, line: 239, type: !104, isLocal: false, isDefinition: true, variable: [26 x i32]* @auGlobalFrequency)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 832, align: 32, elements: !98)
!105 = !DIGlobalVariable(name: "achByFrequency", scope: !0, file: !26, line: 240, type: !106, isLocal: false, isDefinition: true, variable: [26 x i8]* @achByFrequency)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 208, align: 8, elements: !98)
!107 = !DIGlobalVariable(name: "pchDictionary", scope: !0, file: !26, line: 242, type: !20, isLocal: false, isDefinition: true, variable: i8** @pchDictionary)
!108 = !DIGlobalVariable(name: "apwSol", scope: !0, file: !26, line: 465, type: !109, isLocal: false, isDefinition: true, variable: [51 x %struct.Word*]* @apwSol)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 3264, align: 64, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 51)
!112 = !DIGlobalVariable(name: "cpwLast", scope: !0, file: !26, line: 466, type: !23, isLocal: false, isDefinition: true, variable: i32* @cpwLast)
!113 = !DIGlobalVariable(name: "jbAnagram", scope: !0, file: !26, line: 498, type: !114, isLocal: false, isDefinition: true, variable: [1 x %struct.__jmp_buf_tag]* @jbAnagram)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !115, line: 48, baseType: !116)
!115 = !DIFile(filename: "/usr/include/setjmp.h", directory: "/home/gleison/tf/Benchmarks/Ptrdist/anagram")
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 1600, align: 64, elements: !136)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !115, line: 34, size: 1600, align: 64, elements: !118)
!118 = !{!119, !126, !127}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !117, file: !115, line: 40, baseType: !120, size: 512, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !121, line: 31, baseType: !122)
!121 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "/home/gleison/tf/Benchmarks/Ptrdist/anagram")
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 512, align: 64, elements: !124)
!123 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!124 = !{!125}
!125 = !DISubrange(count: 8)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !117, file: !115, line: 41, baseType: !23, size: 32, align: 32, offset: 512)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !117, file: !115, line: 42, baseType: !128, size: 1024, align: 64, offset: 576)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !129, line: 30, baseType: !130)
!129 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigset.h", directory: "/home/gleison/tf/Benchmarks/Ptrdist/anagram")
!130 = !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 27, size: 1024, align: 64, elements: !131)
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !130, file: !129, line: 29, baseType: !133, size: 1024, align: 64)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 1024, align: 64, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 16)
!136 = !{!137}
!137 = !DISubrange(count: 1)
!138 = !DIGlobalVariable(name: "fInteractive", scope: !0, file: !26, line: 612, type: !23, isLocal: false, isDefinition: true, variable: i32* @fInteractive)
!139 = !DIGlobalVariable(name: "achPhrase", scope: !0, file: !26, line: 628, type: !140, isLocal: false, isDefinition: true, variable: [255 x i8]* @achPhrase)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2040, align: 8, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 255)
!143 = !{i32 2, !"Dwarf Version", i32 4}
!144 = !{i32 2, !"Debug Info Version", i32 3}
!145 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pchMsg", arg: 1, scope: !44, file: !26, line: 247, type: !20)
!147 = !DIExpression()
!148 = !DILocation(line: 247, column: 18, scope: !44)
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "u", arg: 2, scope: !44, file: !26, line: 247, type: !37)
!150 = !DILocation(line: 247, column: 35, scope: !44)
!151 = !DILocation(line: 248, column: 11, scope: !44)
!152 = !DILocation(line: 248, column: 19, scope: !44)
!153 = !DILocation(line: 248, column: 27, scope: !44)
!154 = !DILocation(line: 248, column: 3, scope: !44)
!155 = !DILocation(line: 249, column: 3, scope: !44)
!156 = !DILocation(line: 250, column: 1, scope: !44)
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pchFile", arg: 1, scope: !48, file: !26, line: 264, type: !20)
!158 = !DILocation(line: 264, column: 21, scope: !48)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !48, file: !26, line: 265, type: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !162, line: 48, baseType: !163)
!162 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/tf/Benchmarks/Ptrdist/anagram")
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !164, line: 241, size: 1728, align: 64, elements: !165)
!164 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/tf/Benchmarks/Ptrdist/anagram")
!165 = !{!166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !186, !187, !188, !189, !192, !193, !195, !197, !200, !202, !203, !204, !205, !206, !209, !210}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !163, file: !164, line: 242, baseType: !23, size: 32, align: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !163, file: !164, line: 247, baseType: !20, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !163, file: !164, line: 248, baseType: !20, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !163, file: !164, line: 249, baseType: !20, size: 64, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !163, file: !164, line: 250, baseType: !20, size: 64, align: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !163, file: !164, line: 251, baseType: !20, size: 64, align: 64, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !163, file: !164, line: 252, baseType: !20, size: 64, align: 64, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !163, file: !164, line: 253, baseType: !20, size: 64, align: 64, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !163, file: !164, line: 254, baseType: !20, size: 64, align: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !163, file: !164, line: 256, baseType: !20, size: 64, align: 64, offset: 576)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !163, file: !164, line: 257, baseType: !20, size: 64, align: 64, offset: 640)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !163, file: !164, line: 258, baseType: !20, size: 64, align: 64, offset: 704)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !163, file: !164, line: 260, baseType: !179, size: 64, align: 64, offset: 768)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !164, line: 156, size: 192, align: 64, elements: !181)
!181 = !{!182, !183, !185}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !180, file: !164, line: 157, baseType: !179, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !180, file: !164, line: 158, baseType: !184, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !180, file: !164, line: 162, baseType: !23, size: 32, align: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !163, file: !164, line: 262, baseType: !184, size: 64, align: 64, offset: 832)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !163, file: !164, line: 264, baseType: !23, size: 32, align: 32, offset: 896)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !163, file: !164, line: 268, baseType: !23, size: 32, align: 32, offset: 928)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !163, file: !164, line: 270, baseType: !190, size: 64, align: 64, offset: 960)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !191, line: 131, baseType: !123)
!191 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/tf/Benchmarks/Ptrdist/anagram")
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !163, file: !164, line: 274, baseType: !24, size: 16, align: 16, offset: 1024)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !163, file: !164, line: 275, baseType: !194, size: 8, align: 8, offset: 1040)
!194 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !163, file: !164, line: 276, baseType: !196, size: 8, align: 8, offset: 1048)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, align: 8, elements: !136)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !163, file: !164, line: 280, baseType: !198, size: 64, align: 64, offset: 1088)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !164, line: 150, baseType: null)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !163, file: !164, line: 289, baseType: !201, size: 64, align: 64, offset: 1152)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !191, line: 132, baseType: !123)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !163, file: !164, line: 297, baseType: !22, size: 64, align: 64, offset: 1216)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !163, file: !164, line: 298, baseType: !22, size: 64, align: 64, offset: 1280)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !163, file: !164, line: 299, baseType: !22, size: 64, align: 64, offset: 1344)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !163, file: !164, line: 300, baseType: !22, size: 64, align: 64, offset: 1408)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !163, file: !164, line: 302, baseType: !207, size: 64, align: 64, offset: 1472)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !208, line: 62, baseType: !19)
!208 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/tf/Benchmarks/Ptrdist/anagram")
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !163, file: !164, line: 303, baseType: !23, size: 32, align: 32, offset: 1536)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !163, file: !164, line: 305, baseType: !211, size: 160, align: 8, offset: 1568)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 160, align: 8, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 20)
!214 = !DILocation(line: 265, column: 9, scope: !48)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pch", scope: !48, file: !26, line: 266, type: !20)
!216 = !DILocation(line: 266, column: 9, scope: !48)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pchBase", scope: !48, file: !26, line: 267, type: !20)
!218 = !DILocation(line: 267, column: 9, scope: !48)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ulLen", scope: !48, file: !26, line: 268, type: !19)
!220 = !DILocation(line: 268, column: 17, scope: !48)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cWords", scope: !48, file: !26, line: 269, type: !37)
!222 = !DILocation(line: 269, column: 12, scope: !48)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cLetters", scope: !48, file: !26, line: 270, type: !37)
!224 = !DILocation(line: 270, column: 12, scope: !48)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch", scope: !48, file: !26, line: 271, type: !23)
!226 = !DILocation(line: 271, column: 7, scope: !48)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "statBuf", scope: !48, file: !26, line: 272, type: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !229, line: 46, size: 1152, align: 64, elements: !230)
!229 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/gleison/tf/Benchmarks/Ptrdist/anagram")
!230 = !{!231, !233, !235, !237, !239, !241, !243, !244, !245, !246, !248, !250, !258, !259, !260}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !228, file: !229, line: 48, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !191, line: 124, baseType: !19)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !228, file: !229, line: 53, baseType: !234, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !191, line: 127, baseType: !19)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !228, file: !229, line: 61, baseType: !236, size: 64, align: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !191, line: 130, baseType: !19)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !228, file: !229, line: 62, baseType: !238, size: 32, align: 32, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !191, line: 129, baseType: !37)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !228, file: !229, line: 64, baseType: !240, size: 32, align: 32, offset: 224)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !191, line: 125, baseType: !37)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !228, file: !229, line: 65, baseType: !242, size: 32, align: 32, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !191, line: 126, baseType: !37)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !228, file: !229, line: 67, baseType: !23, size: 32, align: 32, offset: 288)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !228, file: !229, line: 69, baseType: !232, size: 64, align: 64, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !228, file: !229, line: 74, baseType: !190, size: 64, align: 64, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !228, file: !229, line: 78, baseType: !247, size: 64, align: 64, offset: 448)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !191, line: 153, baseType: !123)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !228, file: !229, line: 80, baseType: !249, size: 64, align: 64, offset: 512)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !191, line: 158, baseType: !123)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !228, file: !229, line: 91, baseType: !251, size: 128, align: 64, offset: 576)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !252, line: 120, size: 128, align: 64, elements: !253)
!252 = !DIFile(filename: "/usr/include/time.h", directory: "/home/gleison/tf/Benchmarks/Ptrdist/anagram")
!253 = !{!254, !256}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !251, file: !252, line: 122, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !191, line: 139, baseType: !123)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !251, file: !252, line: 123, baseType: !257, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !191, line: 175, baseType: !123)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !228, file: !229, line: 92, baseType: !251, size: 128, align: 64, offset: 704)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !228, file: !229, line: 93, baseType: !251, size: 128, align: 64, offset: 832)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !228, file: !229, line: 106, baseType: !261, size: 192, align: 64, offset: 960)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 192, align: 64, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 3)
!264 = !DILocation(line: 272, column: 15, scope: !48)
!265 = !DILocation(line: 274, column: 12, scope: !266)
!266 = distinct !DILexicalBlock(scope: !48, file: !26, line: 274, column: 7)
!267 = !DILocation(line: 274, column: 7, scope: !266)
!268 = !DILocation(line: 274, column: 7, scope: !48)
!269 = !DILocation(line: 275, column: 5, scope: !266)
!270 = !DILocation(line: 277, column: 19, scope: !48)
!271 = !DILocation(line: 277, column: 27, scope: !48)
!272 = !DILocation(line: 277, column: 9, scope: !48)
!273 = !DILocation(line: 278, column: 44, scope: !48)
!274 = !DILocation(line: 278, column: 37, scope: !48)
!275 = !DILocation(line: 278, column: 27, scope: !48)
!276 = !DILocation(line: 278, column: 11, scope: !48)
!277 = !DILocation(line: 280, column: 7, scope: !278)
!278 = distinct !DILexicalBlock(scope: !48, file: !26, line: 280, column: 7)
!279 = !DILocation(line: 280, column: 21, scope: !278)
!280 = !DILocation(line: 280, column: 7, scope: !48)
!281 = !DILocation(line: 281, column: 5, scope: !278)
!282 = !DILocation(line: 283, column: 19, scope: !283)
!283 = distinct !DILexicalBlock(scope: !48, file: !26, line: 283, column: 7)
!284 = !DILocation(line: 283, column: 13, scope: !283)
!285 = !DILocation(line: 283, column: 11, scope: !283)
!286 = !DILocation(line: 283, column: 34, scope: !283)
!287 = !DILocation(line: 283, column: 7, scope: !48)
!288 = !DILocation(line: 284, column: 5, scope: !283)
!289 = !DILocation(line: 286, column: 3, scope: !48)
!290 = !DILocation(line: 286, column: 16, scope: !291)
!291 = !DILexicalBlockFile(scope: !292, file: !26, discriminator: 2)
!292 = !DILexicalBlockFile(scope: !48, file: !26, discriminator: 1)
!293 = !DILocation(line: 286, column: 11, scope: !48)
!294 = !DILocation(line: 286, column: 10, scope: !48)
!295 = !DILocation(line: 287, column: 11, scope: !296)
!296 = distinct !DILexicalBlock(scope: !48, file: !26, line: 286, column: 21)
!297 = !DILocation(line: 287, column: 19, scope: !296)
!298 = !DILocation(line: 287, column: 9, scope: !296)
!299 = !DILocation(line: 288, column: 14, scope: !296)
!300 = !DILocation(line: 289, column: 5, scope: !296)
!301 = !DILocation(line: 289, column: 24, scope: !302)
!302 = !DILexicalBlockFile(scope: !303, file: !26, discriminator: 4)
!303 = !DILexicalBlockFile(scope: !296, file: !26, discriminator: 1)
!304 = !DILocation(line: 289, column: 18, scope: !296)
!305 = !DILocation(line: 289, column: 16, scope: !296)
!306 = !DILocation(line: 289, column: 29, scope: !296)
!307 = !DILocation(line: 289, column: 37, scope: !296)
!308 = !DILocation(line: 289, column: 40, scope: !309)
!309 = !DILexicalBlockFile(scope: !296, file: !26, discriminator: 2)
!310 = !DILocation(line: 289, column: 43, scope: !296)
!311 = !DILocation(line: 289, column: 5, scope: !312)
!312 = !DILexicalBlockFile(scope: !296, file: !26, discriminator: 3)
!313 = !DILocation(line: 290, column: 11, scope: !314)
!314 = distinct !DILexicalBlock(scope: !315, file: !26, line: 290, column: 11)
!315 = distinct !DILexicalBlock(scope: !296, file: !26, line: 289, column: 51)
!316 = !DILocation(line: 290, column: 11, scope: !315)
!317 = !DILocation(line: 291, column: 17, scope: !314)
!318 = !DILocation(line: 291, column: 9, scope: !314)
!319 = !DILocation(line: 292, column: 16, scope: !315)
!320 = !DILocation(line: 292, column: 11, scope: !315)
!321 = !DILocation(line: 292, column: 14, scope: !315)
!322 = !DILocation(line: 294, column: 9, scope: !296)
!323 = !DILocation(line: 294, column: 12, scope: !296)
!324 = !DILocation(line: 295, column: 16, scope: !296)
!325 = !DILocation(line: 295, column: 22, scope: !296)
!326 = !DILocation(line: 295, column: 20, scope: !296)
!327 = !DILocation(line: 295, column: 6, scope: !296)
