; ModuleID = 'result.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.md5_context = type { [2 x i64], [4 x i64], [64 x i8] }

@md5_padding = internal global [64 x i8] c"\80\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00", align 16
@.str = private unnamed_addr constant [5 x i8] c"%02x\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1

; Function Attrs: nounwind uwtable
define void @md5_starts(%struct.md5_context* %ctx) #0 {
entry:
  call void @llvm.dbg.value(metadata %struct.md5_context* %ctx, i64 0, metadata !53, metadata !54), !dbg !55
  %total = getelementptr inbounds %struct.md5_context, %struct.md5_context* %ctx, i32 0, i32 0, !dbg !56
  %arrayidx = getelementptr inbounds [2 x i64], [2 x i64]* %total, i32 0, i64 0, !dbg !57
  store i64 0, i64* %arrayidx, align 8, !dbg !58
  %total1 = getelementptr inbounds %struct.md5_context, %struct.md5_context* %ctx, i32 0, i32 0, !dbg !59
  %arrayidx2 = getelementptr inbounds [2 x i64], [2 x i64]* %total1, i32 0, i64 1, !dbg !60
  store i64 0, i64* %arrayidx2, align 8, !dbg !61
  %state = getelementptr inbounds %struct.md5_context, %struct.md5_context* %ctx, i32 0, i32 1, !dbg !62
  %arrayidx3 = getelementptr inbounds [4 x i64], [4 x i64]* %state, i32 0, i64 0, !dbg !63

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !48)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/Trimaran/enc-md5")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!6 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!7 = !{!8, !29, !33, !36, !37, !42}
!8 = !DISubprogram(name: "md5_starts", scope: !9, file: !9, line: 38, type: !10, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.md5_context*)* @md5_starts, variables: !2)
!9 = !DIFile(filename: "/home/gleison/tf/Benchmarks/Trimaran/enc-md5/tmp.c", directory: "/home/gleison/tf/Benchmarks/Trimaran/enc-md5")
!10 = !DISubroutineType(types: !11)
!11 = !{null, !12}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "md5_context", file: !14, line: 18, baseType: !15)
!14 = !DIFile(filename: "./md5.h", directory: "/home/gleison/tf/Benchmarks/Trimaran/enc-md5")
!15 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 12, size: 896, align: 64, elements: !16)
!16 = !{!17, !21, !25}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !15, file: !14, line: 14, baseType: !18, size: 128, align: 64)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, align: 64, elements: !19)
!19 = !{!20}
!20 = !DISubrange(count: 2)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !15, file: !14, line: 15, baseType: !22, size: 256, align: 64, offset: 128)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, align: 64, elements: !23)
!23 = !{!24}
!24 = !DISubrange(count: 4)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !15, file: !14, line: 16, baseType: !26, size: 512, align: 8, offset: 384)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 512, align: 8, elements: !27)
!27 = !{!28}
!28 = !DISubrange(count: 64)
!29 = !DISubprogram(name: "md5_process", scope: !9, file: !9, line: 48, type: !30, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.md5_context*, i8*)* @md5_process, variables: !2)
!30 = !DISubroutineType(types: !31)
!31 = !{null, !12, !32}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!33 = !DISubprogram(name: "md5_update", scope: !9, file: !9, line: 171, type: !34, isLocal: false, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.md5_context*, i8*, i64)* @md5_update, variables: !2)
!34 = !DISubroutineType(types: !35)
!35 = !{null, !12, !32, !4}
!36 = !DISubprogram(name: "md5_finish", scope: !9, file: !9, line: 214, type: !30, isLocal: false, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.md5_context*, i8*)* @md5_finish, variables: !2)
!37 = !DISubprogram(name: "my_rand_r", scope: !9, file: !9, line: 241, type: !38, isLocal: false, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32*)* @my_rand_r, variables: !2)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !41}
!40 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!42 = !DISubprogram(name: "main", scope: !9, file: !9, line: 248, type: !43, isLocal: false, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !2)
!43 = !DISubroutineType(types: !44)
!44 = !{!40, !40, !45}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!48 = !{!49}
!49 = !DIGlobalVariable(name: "md5_padding", scope: !0, file: !9, line: 207, type: !26, isLocal: true, isDefinition: true, variable: [64 x i8]* @md5_padding)
!50 = !{i32 2, !"Dwarf Version", i32 4}
!51 = !{i32 2, !"Debug Info Version", i32 3}
!52 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !8, file: !9, line: 38, type: !12)
!54 = !DIExpression()
!55 = !DILocation(line: 38, column: 30, scope: !8)
!56 = !DILocation(line: 39, column: 8, scope: !8)
!57 = !DILocation(line: 39, column: 3, scope: !8)
!58 = !DILocation(line: 39, column: 17, scope: !8)
!59 = !DILocation(line: 40, column: 8, scope: !8)
!60 = !DILocation(line: 40, column: 3, scope: !8)
!61 = !DILocation(line: 40, column: 17, scope: !8)
!62 = !DILocation(line: 42, column: 8, scope: !8)
!63 = !DILocation(line: 42, column: 3, scope: !8)
!64 = !DILocation(line: 42, column: 17, scope: !8)
!65 = !DILocation(line: 43, column: 8, scope: !8)
!66 = !DILocation(line: 43, column: 3, scope: !8)
!67 = !DILocation(line: 43, column: 17, scope: !8)
!68 = !DILocation(line: 44, column: 8, scope: !8)
!69 = !DILocation(line: 44, column: 3, scope: !8)
!70 = !DILocation(line: 44, column: 17, scope: !8)
!71 = !DILocation(line: 45, column: 8, scope: !8)
!72 = !DILocation(line: 45, column: 3, scope: !8)
!73 = !DILocation(line: 45, column: 17, scope: !8)
!74 = !DILocation(line: 46, column: 1, scope: !8)
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !29, file: !9, line: 48, type: !12)
!76 = !DILocation(line: 48, column: 31, scope: !29)
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 2, scope: !29, file: !9, line: 48, type: !32)
!78 = !DILocation(line: 48, column: 42, scope: !29)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "X", scope: !29, file: !9, line: 49, type: !80)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, align: 64, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 16)
!83 = !DILocation(line: 49, column: 10, scope: !29)
!84 = !DILocation(line: 51, column: 3, scope: !85)
!85 = distinct !DILexicalBlock(scope: !29, file: !9, line: 51, column: 3)
!86 = !DILocation(line: 52, column: 3, scope: !87)
!87 = distinct !DILexicalBlock(scope: !29, file: !9, line: 52, column: 3)
!88 = !DILocation(line: 53, column: 3, scope: !89)
!89 = distinct !DILexicalBlock(scope: !29, file: !9, line: 53, column: 3)
!90 = !DILocation(line: 54, column: 3, scope: !91)
!91 = distinct !DILexicalBlock(scope: !29, file: !9, line: 54, column: 3)
!92 = !DILocation(line: 55, column: 3, scope: !93)
!93 = distinct !DILexicalBlock(scope: !29, file: !9, line: 55, column: 3)
!94 = !DILocation(line: 56, column: 3, scope: !95)
!95 = distinct !DILexicalBlock(scope: !29, file: !9, line: 56, column: 3)
!96 = !DILocation(line: 57, column: 3, scope: !97)
!97 = distinct !DILexicalBlock(scope: !29, file: !9, line: 57, column: 3)
!98 = !DILocation(line: 58, column: 3, scope: !99)
!99 = distinct !DILexicalBlock(scope: !29, file: !9, line: 58, column: 3)
!100 = !DILocation(line: 59, column: 3, scope: !101)
!101 = distinct !DILexicalBlock(scope: !29, file: !9, line: 59, column: 3)
!102 = !DILocation(line: 60, column: 3, scope: !103)
!103 = distinct !DILexicalBlock(scope: !29, file: !9, line: 60, column: 3)
!104 = !DILocation(line: 61, column: 3, scope: !105)
!105 = distinct !DILexicalBlock(scope: !29, file: !9, line: 61, column: 3)
!106 = !DILocation(line: 62, column: 3, scope: !107)
!107 = distinct !DILexicalBlock(scope: !29, file: !9, line: 62, column: 3)
!108 = !DILocation(line: 63, column: 3, scope: !109)
!109 = distinct !DILexicalBlock(scope: !29, file: !9, line: 63, column: 3)
!110 = !DILocation(line: 64, column: 3, scope: !111)
!111 = distinct !DILexicalBlock(scope: !29, file: !9, line: 64, column: 3)
!112 = !DILocation(line: 65, column: 3, scope: !113)
!113 = distinct !DILexicalBlock(scope: !29, file: !9, line: 65, column: 3)
!114 = !DILocation(line: 66, column: 3, scope: !115)
!115 = distinct !DILexicalBlock(scope: !29, file: !9, line: 66, column: 3)
!116 = !DILocation(line: 76, column: 12, scope: !29)
!117 = !DILocation(line: 76, column: 7, scope: !29)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "A", scope: !29, file: !9, line: 49, type: !4)
!119 = !DILocation(line: 49, column: 17, scope: !29)
!120 = !DILocation(line: 77, column: 12, scope: !29)
!121 = !DILocation(line: 77, column: 7, scope: !29)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "B", scope: !29, file: !9, line: 49, type: !4)
!123 = !DILocation(line: 49, column: 20, scope: !29)
!124 = !DILocation(line: 78, column: 12, scope: !29)
!125 = !DILocation(line: 78, column: 7, scope: !29)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "C", scope: !29, file: !9, line: 49, type: !4)
!127 = !DILocation(line: 49, column: 23, scope: !29)
!128 = !DILocation(line: 79, column: 12, scope: !29)
!129 = !DILocation(line: 79, column: 7, scope: !29)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "D", scope: !29, file: !9, line: 49, type: !4)
!131 = !DILocation(line: 49, column: 26, scope: !29)
!132 = !DILocation(line: 83, column: 3, scope: !133)
!133 = distinct !DILexicalBlock(scope: !29, file: !9, line: 83, column: 3)
!134 = !DILocation(line: 84, column: 3, scope: !135)
!135 = distinct !DILexicalBlock(scope: !29, file: !9, line: 84, column: 3)
!136 = !DILocation(line: 85, column: 3, scope: !137)
!137 = distinct !DILexicalBlock(scope: !29, file: !9, line: 85, column: 3)
!138 = !DILocation(line: 86, column: 3, scope: !139)
!139 = distinct !DILexicalBlock(scope: !29, file: !9, line: 86, column: 3)
!140 = !DILocation(line: 87, column: 3, scope: !141)
!141 = distinct !DILexicalBlock(scope: !29, file: !9, line: 87, column: 3)
!142 = !DILocation(line: 88, column: 3, scope: !143)
!143 = distinct !DILexicalBlock(scope: !29, file: !9, line: 88, column: 3)
!144 = !DILocation(line: 89, column: 3, scope: !145)
!145 = distinct !DILexicalBlock(scope: !29, file: !9, line: 89, column: 3)
!146 = !DILocation(line: 90, column: 3, scope: !147)
!147 = distinct !DILexicalBlock(scope: !29, file: !9, line: 90, column: 3)
!148 = !DILocation(line: 91, column: 3, scope: !149)
!149 = distinct !DILexicalBlock(scope: !29, file: !9, line: 91, column: 3)
!150 = !DILocation(line: 92, column: 3, scope: !151)
!151 = distinct !DILexicalBlock(scope: !29, file: !9, line: 92, column: 3)
!152 = !DILocation(line: 93, column: 3, scope: !153)
!153 = distinct !DILexicalBlock(scope: !29, file: !9, line: 93, column: 3)
!154 = !DILocation(line: 94, column: 3, scope: !155)
!155 = distinct !DILexicalBlock(scope: !29, file: !9, line: 94, column: 3)
!156 = !DILocation(line: 95, column: 3, scope: !157)
!157 = distinct !DILexicalBlock(scope: !29, file: !9, line: 95, column: 3)
!158 = !DILocation(line: 96, column: 3, scope: !159)
!159 = distinct !DILexicalBlock(scope: !29, file: !9, line: 96, column: 3)
!160 = !DILocation(line: 97, column: 3, scope: !161)
!161 = distinct !DILexicalBlock(scope: !29, file: !9, line: 97, column: 3)
!162 = !DILocation(line: 98, column: 3, scope: !163)
!163 = distinct !DILexicalBlock(scope: !29, file: !9, line: 98, column: 3)
!164 = !DILocation(line: 104, column: 3, scope: !165)
!165 = distinct !DILexicalBlock(scope: !29, file: !9, line: 104, column: 3)
!166 = !DILocation(line: 105, column: 3, scope: !167)
!167 = distinct !DILexicalBlock(scope: !29, file: !9, line: 105, column: 3)
!168 = !DILocation(line: 106, column: 3, scope: !169)
!169 = distinct !DILexicalBlock(scope: !29, file: !9, line: 106, column: 3)
!170 = !DILocation(line: 107, column: 3, scope: !171)
!171 = distinct !DILexicalBlock(scope: !29, file: !9, line: 107, column: 3)
!172 = !DILocation(line: 108, column: 3, scope: !173)
!173 = distinct !DILexicalBlock(scope: !29, file: !9, line: 108, column: 3)
!174 = !DILocation(line: 109, column: 3, scope: !175)
!175 = distinct !DILexicalBlock(scope: !29, file: !9, line: 109, column: 3)
!176 = !DILocation(line: 110, column: 3, scope: !177)
!177 = distinct !DILexicalBlock(scope: !29, file: !9, line: 110, column: 3)
!178 = !DILocation(line: 111, column: 3, scope: !179)
!179 = distinct !DILexicalBlock(scope: !29, file: !9, line: 111, column: 3)
!180 = !DILocation(line: 112, column: 3, scope: !181)
!181 = distinct !DILexicalBlock(scope: !29, file: !9, line: 112, column: 3)
!182 = !DILocation(line: 113, column: 3, scope: !183)
!183 = distinct !DILexicalBlock(scope: !29, file: !9, line: 113, column: 3)
!184 = !DILocation(line: 114, column: 3, scope: !185)
!185 = distinct !DILexicalBlock(scope: !29, file: !9, line: 114, column: 3)
!186 = !DILocation(line: 115, column: 3, scope: !187)
!187 = distinct !DILexicalBlock(scope: !29, file: !9, line: 115, column: 3)
!188 = !DILocation(line: 116, column: 3, scope: !189)
!189 = distinct !DILexicalBlock(scope: !29, file: !9, line: 116, column: 3)
!190 = !DILocation(line: 117, column: 3, scope: !191)
!191 = distinct !DILexicalBlock(scope: !29, file: !9, line: 117, column: 3)
!192 = !DILocation(line: 118, column: 3, scope: !193)
!193 = distinct !DILexicalBlock(scope: !29, file: !9, line: 118, column: 3)
!194 = !DILocation(line: 119, column: 3, scope: !195)
!195 = distinct !DILexicalBlock(scope: !29, file: !9, line: 119, column: 3)
!196 = !DILocation(line: 125, column: 3, scope: !197)
!197 = distinct !DILexicalBlock(scope: !29, file: !9, line: 125, column: 3)
!198 = !DILocation(line: 126, column: 3, scope: !199)
!199 = distinct !DILexicalBlock(scope: !29, file: !9, line: 126, column: 3)
!200 = !DILocation(line: 127, column: 3, scope: !201)
!201 = distinct !DILexicalBlock(scope: !29, file: !9, line: 127, column: 3)
!202 = !DILocation(line: 128, column: 3, scope: !203)
!203 = distinct !DILexicalBlock(scope: !29, file: !9, line: 128, column: 3)
!204 = !DILocation(line: 129, column: 3, scope: !205)
!205 = distinct !DILexicalBlock(scope: !29, file: !9, line: 129, column: 3)
!206 = !DILocation(line: 130, column: 3, scope: !207)
!207 = distinct !DILexicalBlock(scope: !29, file: !9, line: 130, column: 3)
!208 = !DILocation(line: 131, column: 3, scope: !209)
!209 = distinct !DILexicalBlock(scope: !29, file: !9, line: 131, column: 3)
!210 = !DILocation(line: 132, column: 3, scope: !211)
!211 = distinct !DILexicalBlock(scope: !29, file: !9, line: 132, column: 3)
!212 = !DILocation(line: 133, column: 3, scope: !213)
!213 = distinct !DILexicalBlock(scope: !29, file: !9, line: 133, column: 3)
!214 = !DILocation(line: 134, column: 3, scope: !215)
!215 = distinct !DILexicalBlock(scope: !29, file: !9, line: 134, column: 3)
!216 = !DILocation(line: 135, column: 3, scope: !217)
!217 = distinct !DILexicalBlock(scope: !29, file: !9, line: 135, column: 3)
!218 = !DILocation(line: 136, column: 3, scope: !219)
!219 = distinct !DILexicalBlock(scope: !29, file: !9, line: 136, column: 3)
!220 = !DILocation(line: 137, column: 3, scope: !221)
!221 = distinct !DILexicalBlock(scope: !29, file: !9, line: 137, column: 3)
!222 = !DILocation(line: 138, column: 3, scope: !223)
!223 = distinct !DILexicalBlock(scope: !29, file: !9, line: 138, column: 3)
!224 = !DILocation(line: 139, column: 3, scope: !225)
!225 = distinct !DILexicalBlock(scope: !29, file: !9, line: 139, column: 3)
!226 = !DILocation(line: 140, column: 3, scope: !227)
!227 = distinct !DILexicalBlock(scope: !29, file: !9, line: 140, column: 3)
!228 = !DILocation(line: 146, column: 3, scope: !229)
!229 = distinct !DILexicalBlock(scope: !29, file: !9, line: 146, column: 3)
!230 = !DILocation(line: 147, column: 3, scope: !231)
!231 = distinct !DILexicalBlock(scope: !29, file: !9, line: 147, column: 3)
!232 = !DILocation(line: 148, column: 3, scope: !233)
!233 = distinct !DILexicalBlock(scope: !29, file: !9, line: 148, column: 3)
!234 = !DILocation(line: 149, column: 3, scope: !235)
!235 = distinct !DILexicalBlock(scope: !29, file: !9, line: 149, column: 3)
!236 = !DILocation(line: 150, column: 3, scope: !237)
!237 = distinct !DILexicalBlock(scope: !29, file: !9, line: 150, column: 3)
!238 = !DILocation(line: 151, column: 3, scope: !239)
!239 = distinct !DILexicalBlock(scope: !29, file: !9, line: 151, column: 3)
!240 = !DILocation(line: 152, column: 3, scope: !241)
!241 = distinct !DILexicalBlock(scope: !29, file: !9, line: 152, column: 3)
!242 = !DILocation(line: 153, column: 3, scope: !243)
!243 = distinct !DILexicalBlock(scope: !29, file: !9, line: 153, column: 3)
!244 = !DILocation(line: 154, column: 3, scope: !245)
!245 = distinct !DILexicalBlock(scope: !29, file: !9, line: 154, column: 3)
!246 = !DILocation(line: 155, column: 3, scope: !247)
!247 = distinct !DILexicalBlock(scope: !29, file: !9, line: 155, column: 3)
!248 = !DILocation(line: 156, column: 3, scope: !249)
!249 = distinct !DILexicalBlock(scope: !29, file: !9, line: 156, column: 3)
!250 = !DILocation(line: 157, column: 3, scope: !251)
!251 = distinct !DILexicalBlock(scope: !29, file: !9, line: 157, column: 3)
!252 = !DILocation(line: 158, column: 3, scope: !253)
!253 = distinct !DILexicalBlock(scope: !29, file: !9, line: 158, column: 3)
!254 = !DILocation(line: 159, column: 3, scope: !255)
!255 = distinct !DILexicalBlock(scope: !29, file: !9, line: 159, column: 3)
!256 = !DILocation(line: 160, column: 3, scope: !257)
!257 = distinct !DILexicalBlock(scope: !29, file: !9, line: 160, column: 3)
!258 = !DILocation(line: 161, column: 3, scope: !259)
!259 = distinct !DILexicalBlock(scope: !29, file: !9, line: 161, column: 3)
!260 = !DILocation(line: 165, column: 8, scope: !29)
!261 = !DILocation(line: 165, column: 3, scope: !29)
!262 = !DILocation(line: 165, column: 17, scope: !29)
!263 = !DILocation(line: 166, column: 8, scope: !29)
!264 = !DILocation(line: 166, column: 3, scope: !29)
!265 = !DILocation(line: 166, column: 17, scope: !29)
!266 = !DILocation(line: 167, column: 8, scope: !29)
!267 = !DILocation(line: 167, column: 3, scope: !29)
!268 = !DILocation(line: 167, column: 17, scope: !29)
!269 = !DILocation(line: 168, column: 8, scope: !29)
!270 = !DILocation(line: 168, column: 3, scope: !29)
!271 = !DILocation(line: 168, column: 17, scope: !29)
!272 = !DILocation(line: 169, column: 1, scope: !29)
!273 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !33, file: !9, line: 171, type: !12)
!274 = !DILocation(line: 171, column: 30, scope: !33)
!275 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 2, scope: !33, file: !9, line: 171, type: !32)
!276 = !DILocation(line: 171, column: 42, scope: !33)
!277 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 3, scope: !33, file: !9, line: 171, type: !4)
!278 = !DILocation(line: 171, column: 56, scope: !33)
!279 = !DILocation(line: 174, column: 8, scope: !280)
!280 = distinct !DILexicalBlock(scope: !33, file: !9, line: 174, column: 7)
!281 = !DILocation(line: 174, column: 7, scope: !33)
!282 = !DILocation(line: 175, column: 5, scope: !280)
!283 = !DILocation(line: 177, column: 15, scope: !33)
!284 = !DILocation(line: 177, column: 10, scope: !33)
!285 = !DILocation(line: 177, column: 24, scope: !33)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left", scope: !33, file: !9, line: 172, type: !4)
!287 = !DILocation(line: 172, column: 10, scope: !33)
!288 = !DILocation(line: 178, column: 13, scope: !33)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fill", scope: !33, file: !9, line: 172, type: !4)
!290 = !DILocation(line: 172, column: 16, scope: !33)
!291 = !DILocation(line: 180, column: 8, scope: !33)
!292 = !DILocation(line: 180, column: 3, scope: !33)
!293 = !DILocation(line: 180, column: 17, scope: !33)
!294 = !DILocation(line: 181, column: 8, scope: !33)
!295 = !DILocation(line: 181, column: 3, scope: !33)
!296 = !DILocation(line: 181, column: 17, scope: !33)
!297 = !DILocation(line: 183, column: 12, scope: !298)
!298 = distinct !DILexicalBlock(scope: !33, file: !9, line: 183, column: 7)
!299 = !DILocation(line: 183, column: 7, scope: !298)
!300 = !DILocation(line: 183, column: 21, scope: !298)
!301 = !DILocation(line: 183, column: 7, scope: !33)
!302 = !DILocation(line: 184, column: 10, scope: !298)
!303 = !DILocation(line: 184, column: 5, scope: !298)
!304 = !DILocation(line: 184, column: 18, scope: !298)
!305 = !DILocation(line: 186, column: 7, scope: !306)
!306 = distinct !DILexicalBlock(scope: !33, file: !9, line: 186, column: 7)
!307 = !DILocation(line: 186, column: 12, scope: !306)
!308 = !DILocation(line: 186, column: 22, scope: !306)
!309 = !DILocation(line: 186, column: 7, scope: !33)
!310 = !DILocation(line: 187, column: 26, scope: !311)
!311 = distinct !DILexicalBlock(scope: !306, file: !9, line: 186, column: 31)
!312 = !DILocation(line: 187, column: 21, scope: !311)
!313 = !DILocation(line: 187, column: 33, scope: !311)
!314 = !DILocation(line: 187, column: 5, scope: !311)
!315 = !DILocation(line: 189, column: 27, scope: !311)
!316 = !DILocation(line: 189, column: 22, scope: !311)
!317 = !DILocation(line: 189, column: 5, scope: !311)
!318 = !DILocation(line: 190, column: 12, scope: !311)
!319 = !DILocation(line: 191, column: 11, scope: !311)
!320 = !DILocation(line: 193, column: 3, scope: !311)
!321 = !DILocation(line: 195, column: 3, scope: !33)
!322 = !DILocation(line: 195, column: 17, scope: !33)
!323 = !DILocation(line: 196, column: 5, scope: !324)
!324 = distinct !DILexicalBlock(scope: !33, file: !9, line: 195, column: 24)
!325 = !DILocation(line: 197, column: 12, scope: !324)
!326 = !DILocation(line: 198, column: 11, scope: !324)
!327 = !DILocation(line: 201, column: 7, scope: !328)
!328 = distinct !DILexicalBlock(scope: !33, file: !9, line: 201, column: 7)
!329 = !DILocation(line: 201, column: 7, scope: !33)
!330 = !DILocation(line: 202, column: 26, scope: !331)
!331 = distinct !DILexicalBlock(scope: !328, file: !9, line: 201, column: 15)
!332 = !DILocation(line: 202, column: 21, scope: !331)
!333 = !DILocation(line: 202, column: 33, scope: !331)
!334 = !DILocation(line: 202, column: 5, scope: !331)
!335 = !DILocation(line: 204, column: 3, scope: !331)
!336 = !DILocation(line: 205, column: 1, scope: !33)
!337 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !36, file: !9, line: 214, type: !12)
!338 = !DILocation(line: 214, column: 30, scope: !36)
!339 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "digest", arg: 2, scope: !36, file: !9, line: 214, type: !32)
!340 = !DILocation(line: 214, column: 41, scope: !36)
!341 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msglen", scope: !36, file: !9, line: 217, type: !342)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, align: 8, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 8)
!345 = !DILocation(line: 217, column: 9, scope: !36)
!346 = !DILocation(line: 219, column: 16, scope: !36)
!347 = !DILocation(line: 219, column: 11, scope: !36)
!348 = !DILocation(line: 219, column: 25, scope: !36)
!349 = !DILocation(line: 219, column: 40, scope: !36)
!350 = !DILocation(line: 219, column: 35, scope: !36)
!351 = !DILocation(line: 219, column: 49, scope: !36)
!352 = !DILocation(line: 219, column: 32, scope: !36)
!353 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "high", scope: !36, file: !9, line: 216, type: !4)
!354 = !DILocation(line: 216, column: 10, scope: !36)
!355 = !DILocation(line: 220, column: 15, scope: !36)
!356 = !DILocation(line: 220, column: 10, scope: !36)
!357 = !DILocation(line: 220, column: 24, scope: !36)
!358 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "low", scope: !36, file: !9, line: 216, type: !4)
!359 = !DILocation(line: 216, column: 16, scope: !36)
!360 = !DILocation(line: 222, column: 3, scope: !361)
!361 = distinct !DILexicalBlock(scope: !36, file: !9, line: 222, column: 3)
!362 = !DILocation(line: 223, column: 3, scope: !363)
!363 = distinct !DILexicalBlock(scope: !36, file: !9, line: 223, column: 3)
!364 = !DILocation(line: 225, column: 15, scope: !36)
!365 = !DILocation(line: 225, column: 10, scope: !36)
!366 = !DILocation(line: 225, column: 24, scope: !36)
!367 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "last", scope: !36, file: !9, line: 215, type: !4)
!368 = !DILocation(line: 215, column: 10, scope: !36)
!369 = !DILocation(line: 226, column: 16, scope: !36)
!370 = !DILocation(line: 226, column: 10, scope: !36)
!371 = !DILocation(line: 226, column: 28, scope: !36)
!372 = !DILocation(line: 226, column: 43, scope: !36)
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padn", scope: !36, file: !9, line: 215, type: !4)
!374 = !DILocation(line: 215, column: 16, scope: !36)
!375 = !DILocation(line: 228, column: 3, scope: !36)
!376 = !DILocation(line: 229, column: 19, scope: !36)
!377 = !DILocation(line: 229, column: 3, scope: !36)
!378 = !DILocation(line: 231, column: 3, scope: !379)
!379 = distinct !DILexicalBlock(scope: !36, file: !9, line: 231, column: 3)
!380 = !DILocation(line: 232, column: 3, scope: !381)
!381 = distinct !DILexicalBlock(scope: !36, file: !9, line: 232, column: 3)
!382 = !DILocation(line: 233, column: 3, scope: !383)
!383 = distinct !DILexicalBlock(scope: !36, file: !9, line: 233, column: 3)
!384 = !DILocation(line: 234, column: 3, scope: !385)
!385 = distinct !DILexicalBlock(scope: !36, file: !9, line: 234, column: 3)
!386 = !DILocation(line: 235, column: 1, scope: !36)
!387 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seedp", arg: 1, scope: !37, file: !9, line: 241, type: !41)
!388 = !DILocation(line: 241, column: 20, scope: !37)
!389 = !DILocation(line: 243, column: 16, scope: !37)
!390 = !DILocation(line: 243, column: 23, scope: !37)
!391 = !DILocation(line: 243, column: 33, scope: !37)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !37, file: !9, line: 243, type: !393)
!393 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!394 = !DILocation(line: 243, column: 12, scope: !37)
!395 = !DILocation(line: 244, column: 10, scope: !37)
!396 = !DILocation(line: 245, column: 13, scope: !37)
!397 = !DILocation(line: 245, column: 20, scope: !37)
!398 = !DILocation(line: 245, column: 3, scope: !37)
!399 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !42, file: !9, line: 248, type: !40)
!400 = !DILocation(line: 248, column: 14, scope: !42)
!401 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !42, file: !9, line: 248, type: !45)
!402 = !DILocation(line: 248, column: 26, scope: !42)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !42, file: !9, line: 249, type: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !406, line: 48, baseType: !407)
!406 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/tf/Benchmarks/Trimaran/enc-md5")
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !408, line: 241, size: 1728, align: 64, elements: !409)
!408 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/tf/Benchmarks/Trimaran/enc-md5")
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !430, !431, !432, !433, !437, !439, !441, !445, !448, !450, !451, !452, !453, !454, !457, !458}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !407, file: !408, line: 242, baseType: !40, size: 32, align: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !407, file: !408, line: 247, baseType: !46, size: 64, align: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !407, file: !408, line: 248, baseType: !46, size: 64, align: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !407, file: !408, line: 249, baseType: !46, size: 64, align: 64, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !407, file: !408, line: 250, baseType: !46, size: 64, align: 64, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !407, file: !408, line: 251, baseType: !46, size: 64, align: 64, offset: 320)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !407, file: !408, line: 252, baseType: !46, size: 64, align: 64, offset: 384)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !407, file: !408, line: 253, baseType: !46, size: 64, align: 64, offset: 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !407, file: !408, line: 254, baseType: !46, size: 64, align: 64, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !407, file: !408, line: 256, baseType: !46, size: 64, align: 64, offset: 576)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !407, file: !408, line: 257, baseType: !46, size: 64, align: 64, offset: 640)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !407, file: !408, line: 258, baseType: !46, size: 64, align: 64, offset: 704)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !407, file: !408, line: 260, baseType: !423, size: 64, align: 64, offset: 768)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !408, line: 156, size: 192, align: 64, elements: !425)
!425 = !{!426, !427, !429}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !424, file: !408, line: 157, baseType: !423, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !424, file: !408, line: 158, baseType: !428, size: 64, align: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !424, file: !408, line: 162, baseType: !40, size: 32, align: 32, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !407, file: !408, line: 262, baseType: !428, size: 64, align: 64, offset: 832)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !407, file: !408, line: 264, baseType: !40, size: 32, align: 32, offset: 896)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !407, file: !408, line: 268, baseType: !40, size: 32, align: 32, offset: 928)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !407, file: !408, line: 270, baseType: !434, size: 64, align: 64, offset: 960)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !435, line: 131, baseType: !436)
!435 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/tf/Benchmarks/Trimaran/enc-md5")
!436 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !407, file: !408, line: 274, baseType: !438, size: 16, align: 16, offset: 1024)
!438 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !407, file: !408, line: 275, baseType: !440, size: 8, align: 8, offset: 1040)
!440 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !407, file: !408, line: 276, baseType: !442, size: 8, align: 8, offset: 1048)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8, align: 8, elements: !443)
!443 = !{!444}
!444 = !DISubrange(count: 1)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !407, file: !408, line: 280, baseType: !446, size: 64, align: 64, offset: 1088)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !408, line: 150, baseType: null)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !407, file: !408, line: 289, baseType: !449, size: 64, align: 64, offset: 1152)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !435, line: 132, baseType: !436)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !407, file: !408, line: 297, baseType: !5, size: 64, align: 64, offset: 1216)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !407, file: !408, line: 298, baseType: !5, size: 64, align: 64, offset: 1280)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !407, file: !408, line: 299, baseType: !5, size: 64, align: 64, offset: 1344)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !407, file: !408, line: 300, baseType: !5, size: 64, align: 64, offset: 1408)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !407, file: !408, line: 302, baseType: !455, size: 64, align: 64, offset: 1472)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !456, line: 62, baseType: !4)
!456 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/tf/Benchmarks/Trimaran/enc-md5")
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !407, file: !408, line: 303, baseType: !40, size: 32, align: 32, offset: 1536)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !407, file: !408, line: 305, baseType: !459, size: 160, align: 8, offset: 1568)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 160, align: 8, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 20)
!462 = !DILocation(line: 249, column: 9, scope: !42)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "output", scope: !42, file: !9, line: 252, type: !464)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 264, align: 8, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 33)
!467 = !DILocation(line: 252, column: 8, scope: !42)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctx", scope: !42, file: !9, line: 253, type: !13)
!469 = !DILocation(line: 253, column: 15, scope: !42)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !42, file: !9, line: 254, type: !471)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 800000, align: 8, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 100000)
!474 = !DILocation(line: 254, column: 17, scope: !42)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "md5sum", scope: !42, file: !9, line: 255, type: !476)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 128, align: 8, elements: !81)
!477 = !DILocation(line: 255, column: 17, scope: !42)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "random_seed", scope: !42, file: !9, line: 258, type: !40)
!479 = !DILocation(line: 258, column: 7, scope: !42)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !42, file: !9, line: 250, type: !40)
!481 = !DILocation(line: 250, column: 7, scope: !42)
!482 = !DILocation(line: 259, column: 8, scope: !483)
!483 = distinct !DILexicalBlock(scope: !42, file: !9, line: 259, column: 3)
!484 = !DILocation(line: 259, column: 15, scope: !485)
!485 = !DILexicalBlockFile(scope: !486, file: !9, discriminator: 2)
!486 = !DILexicalBlockFile(scope: !487, file: !9, discriminator: 1)
!487 = distinct !DILexicalBlock(scope: !483, file: !9, line: 259, column: 3)
!488 = !DILocation(line: 259, column: 17, scope: !487)
!489 = !DILocation(line: 259, column: 3, scope: !483)
!490 = !DILocation(line: 260, column: 14, scope: !487)
!491 = !DILocation(line: 260, column: 5, scope: !487)
!492 = !DILocation(line: 260, column: 12, scope: !487)
!493 = !DILocation(line: 259, column: 32, scope: !487)
!494 = !DILocation(line: 259, column: 3, scope: !487)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "repeat", scope: !42, file: !9, line: 251, type: !40)
!496 = !DILocation(line: 251, column: 7, scope: !42)
!497 = !DILocation(line: 263, column: 12, scope: !498)
!498 = distinct !DILexicalBlock(scope: !42, file: !9, line: 263, column: 7)
!499 = !DILocation(line: 263, column: 7, scope: !42)
!500 = !DILocation(line: 264, column: 19, scope: !498)
!501 = !DILocation(line: 264, column: 14, scope: !498)
!502 = !DILocation(line: 264, column: 5, scope: !498)
!503 = !DILocation(line: 266, column: 3, scope: !42)
!504 = !DILocation(line: 266, column: 3, scope: !505)
!505 = distinct !DILexicalBlock(scope: !42, file: !9, line: 266, column: 3)
!506 = !DILocation(line: 267, column: 5, scope: !507)
!507 = distinct !DILexicalBlock(scope: !508, file: !9, line: 266, column: 28)
!508 = distinct !DILexicalBlock(scope: !505, file: !9, line: 266, column: 3)
!509 = !DILocation(line: 268, column: 10, scope: !510)
!510 = distinct !DILexicalBlock(scope: !507, file: !9, line: 268, column: 5)
!511 = !DILocation(line: 268, column: 19, scope: !512)
!512 = distinct !DILexicalBlock(scope: !510, file: !9, line: 268, column: 5)
!513 = !DILocation(line: 268, column: 5, scope: !510)
!514 = !DILocation(line: 269, column: 24, scope: !512)
!515 = !DILocation(line: 269, column: 28, scope: !512)
!516 = !DILocation(line: 269, column: 52, scope: !512)
!517 = !DILocation(line: 269, column: 50, scope: !512)
!518 = !DILocation(line: 269, column: 7, scope: !512)
