; ModuleID = '/home/gleison/tf/Benchmarks/TSVC/ControlLoops-dbl/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GlobalData = type { [32000 x double], [3 x i32], [20 x i8], [32000 x double], [5 x i32], [12 x i8], [32000 x double], [7 x i32], [32000 x double], [11 x i32], [20 x i8], [32000 x double], [13 x i32], [12 x i8], [256 x [256 x double]], [17 x i32], [28 x i8], [256 x [256 x double]], [19 x i32], [20 x i8], [256 x [256 x double]], [23 x i32], [256 x [256 x double]] }

@global_data = common global %struct.GlobalData zeroinitializer, align 32
@a = constant double* getelementptr inbounds (%struct.GlobalData, %struct.GlobalData* @global_data, i32 0, i32 0, i32 0), align 32
@b = constant double* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 256032) to double*), align 32
@c = constant double* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 512064) to double*), align 32
@d = constant double* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 768096) to double*), align 32
@e = constant double* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 1024160) to double*), align 32
@aa = constant [256 x double]* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 1280224) to [256 x double]*), align 32

!48 = !DISubprogram(name: "vpv", scope: !9, file: !9, line: 5275, type: !39, isLocal: false, isDefinition: true, scopeLine: 5276, isOptimized: false, function: i32 ()* @vpv, variables: !2)
!49 = !DISubprogram(name: "vtv", scope: !9, file: !9, line: 5302, type: !39, isLocal: false, isDefinition: true, scopeLine: 5303, isOptimized: false, function: i32 ()* @vtv, variables: !2)
!50 = !DISubprogram(name: "vpvtv", scope: !9, file: !9, line: 5330, type: !39, isLocal: false, isDefinition: true, scopeLine: 5331, isOptimized: false, function: i32 ()* @vpvtv, variables: !2)
!51 = !DISubprogram(name: "vpvts", scope: !9, file: !9, line: 5357, type: !52, isLocal: false, isDefinition: true, scopeLine: 5358, flags: DIFlagPrototyped, isOptimized: false, function: i32 (double)* @vpvts, variables: !2)
!52 = !DISubroutineType(types: !53)
!53 = !{!12, !4}
!54 = !DISubprogram(name: "vpvpv", scope: !9, file: !9, line: 5384, type: !39, isLocal: false, isDefinition: true, scopeLine: 5385, isOptimized: false, function: i32 ()* @vpvpv, variables: !2)
!55 = !DISubprogram(name: "vtvtv", scope: !9, file: !9, line: 5411, type: !39, isLocal: false, isDefinition: true, scopeLine: 5412, isOptimized: false, function: i32 ()* @vtvtv, variables: !2)
!56 = !DISubprogram(name: "vsumr", scope: !9, file: !9, line: 5438, type: !39, isLocal: false, isDefinition: true, scopeLine: 5439, isOptimized: false, function: i32 ()* @vsumr, variables: !2)
!57 = !DISubprogram(name: "vdotr", scope: !9, file: !9, line: 5467, type: !39, isLocal: false, isDefinition: true, scopeLine: 5468, isOptimized: false, function: i32 ()* @vdotr, variables: !2)
!58 = !DISubprogram(name: "vbor", scope: !9, file: !9, line: 5497, type: !39, isLocal: false, isDefinition: true, scopeLine: 5498, isOptimized: false, function: i32 ()* @vbor, variables: !2)
!59 = !DISubprogram(name: "set", scope: !9, file: !9, line: 5543, type: !60, isLocal: false, isDefinition: true, scopeLine: 5543, flags: DIFlagPrototyped, isOptimized: false, function: void (i32*, double*, double*)* @set, variables: !2)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !45, !13, !13}
!62 = !DISubprogram(name: "main", scope: !9, file: !9, line: 5572, type: !63, isLocal: false, isDefinition: true, scopeLine: 5572, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !2)
!63 = !DISubroutineType(types: !64)
!64 = !{!12, !12, !65}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!66 = !{!67, !69, !70, !71, !72, !73, !75, !76, !77, !78, !82, !83, !84, !85, !86, !90, !91, !92, !93, !139, !141, !143, !144, !145}
!67 = !DIGlobalVariable(name: "a", scope: !0, file: !9, line: 100, type: !68, isLocal: false, isDefinition: true, variable: double** @a)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!69 = !DIGlobalVariable(name: "b", scope: !0, file: !9, line: 101, type: !68, isLocal: false, isDefinition: true, variable: double** @b)
!70 = !DIGlobalVariable(name: "c", scope: !0, file: !9, line: 102, type: !68, isLocal: false, isDefinition: true, variable: double** @c)
!71 = !DIGlobalVariable(name: "d", scope: !0, file: !9, line: 103, type: !68, isLocal: false, isDefinition: true, variable: double** @d)
!72 = !DIGlobalVariable(name: "e", scope: !0, file: !9, line: 104, type: !68, isLocal: false, isDefinition: true, variable: double** @e)
!73 = !DIGlobalVariable(name: "aa", scope: !0, file: !9, line: 105, type: !74, isLocal: false, isDefinition: true, variable: [256 x double]** @aa)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!75 = !DIGlobalVariable(name: "bb", scope: !0, file: !9, line: 106, type: !74, isLocal: false, isDefinition: true, variable: [256 x double]** @bb)
!76 = !DIGlobalVariable(name: "cc", scope: !0, file: !9, line: 107, type: !74, isLocal: false, isDefinition: true, variable: [256 x double]** @cc)
!77 = !DIGlobalVariable(name: "tt", scope: !0, file: !9, line: 108, type: !74, isLocal: false, isDefinition: true, variable: [256 x double]** @tt)
!78 = !DIGlobalVariable(name: "X", scope: !0, file: !9, line: 59, type: !79, isLocal: false, isDefinition: true, variable: [32000 x double]* @X)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048000, align: 64, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 32000)
!82 = !DIGlobalVariable(name: "Y", scope: !0, file: !9, line: 59, type: !79, isLocal: false, isDefinition: true, variable: [32000 x double]* @Y)
!83 = !DIGlobalVariable(name: "Z", scope: !0, file: !9, line: 59, type: !79, isLocal: false, isDefinition: true, variable: [32000 x double]* @Z)
!84 = !DIGlobalVariable(name: "U", scope: !0, file: !9, line: 59, type: !79, isLocal: false, isDefinition: true, variable: [32000 x double]* @U)
!85 = !DIGlobalVariable(name: "V", scope: !0, file: !9, line: 59, type: !79, isLocal: false, isDefinition: true, variable: [32000 x double]* @V)
!86 = !DIGlobalVariable(name: "array", scope: !0, file: !9, line: 63, type: !87, isLocal: false, isDefinition: true, variable: [65536 x double]* @array)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4194304, align: 64, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 65536)
!90 = !DIGlobalVariable(name: "x", scope: !0, file: !9, line: 65, type: !79, isLocal: false, isDefinition: true, variable: [32000 x double]* @x)
!91 = !DIGlobalVariable(name: "temp", scope: !0, file: !9, line: 66, type: !4, isLocal: false, isDefinition: true, variable: double* @temp)
!92 = !DIGlobalVariable(name: "temp_int", scope: !0, file: !9, line: 67, type: !12, isLocal: false, isDefinition: true, variable: i32* @temp_int)
!93 = !DIGlobalVariable(name: "global_data", scope: !0, file: !9, line: 98, type: !94, isLocal: false, isDefinition: true, variable: %struct.GlobalData* @global_data)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalData", file: !9, line: 79, size: 27021312, align: 256, elements: !95)
!95 = !{!96, !97, !101, !102, !106, !107, !111, !112, !116, !117, !121, !124, !128, !129, !133, !134, !138}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !94, file: !9, line: 80, baseType: !79, size: 2048000, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !94, file: !9, line: 81, baseType: !98, size: 96, align: 32, offset: 2048000)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 96, align: 32, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 3)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !94, file: !9, line: 82, baseType: !79, size: 2048000, align: 64, offset: 2048256)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !94, file: !9, line: 83, baseType: !103, size: 160, align: 32, offset: 4096256)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, align: 32, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 5)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !94, file: !9, line: 84, baseType: !79, size: 2048000, align: 64, offset: 4096512)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !94, file: !9, line: 85, baseType: !108, size: 224, align: 32, offset: 6144512)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 224, align: 32, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 7)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !94, file: !9, line: 86, baseType: !79, size: 2048000, align: 64, offset: 6144768)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !94, file: !9, line: 87, baseType: !113, size: 352, align: 32, offset: 8192768)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 352, align: 32, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 11)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !94, file: !9, line: 88, baseType: !79, size: 2048000, align: 64, offset: 8193280)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !94, file: !9, line: 90, baseType: !118, size: 416, align: 32, offset: 10241280)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 416, align: 32, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 13)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !94, file: !9, line: 91, baseType: !122, size: 4194304, align: 64, offset: 10241792)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4194304, align: 64, elements: !123)
!123 = !{!23, !23}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "pad6", scope: !94, file: !9, line: 92, baseType: !125, size: 544, align: 32, offset: 14436096)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 544, align: 32, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 17)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !94, file: !9, line: 93, baseType: !122, size: 4194304, align: 64, offset: 14436864)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "pad7", scope: !94, file: !9, line: 94, baseType: !130, size: 608, align: 32, offset: 18631168)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 608, align: 32, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 19)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "cc", scope: !94, file: !9, line: 95, baseType: !122, size: 4194304, align: 64, offset: 18631936)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "pad8", scope: !94, file: !9, line: 96, baseType: !135, size: 736, align: 32, offset: 22826240)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 736, align: 32, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 23)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !94, file: !9, line: 97, baseType: !122, size: 4194304, align: 64, offset: 22827008)
!139 = !DIGlobalVariable(name: "indx", scope: !0, file: !9, line: 110, type: !140, isLocal: false, isDefinition: true, variable: [32000 x i32]* @indx)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 1024000, align: 32, elements: !80)
!141 = !DIGlobalVariable(name: "xx", scope: !0, file: !9, line: 113, type: !142, isLocal: false, isDefinition: true, variable: double** @xx)
!142 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !13)
!143 = !DIGlobalVariable(name: "yy", scope: !0, file: !9, line: 114, type: !13, isLocal: false, isDefinition: true, variable: double** @yy)
!144 = !DIGlobalVariable(name: "digits", scope: !0, file: !9, line: 40, type: !12, isLocal: true, isDefinition: true, variable: i32* @digits)
!145 = !DIGlobalVariable(name: "ntimes", scope: !0, file: !9, line: 39, type: !12, isLocal: true, isDefinition: true, variable: i32* @ntimes)
!146 = !{i32 2, !"Dwarf Version", i32 4}
!147 = !{i32 2, !"Debug Info Version", i32 3}
!148 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arr", arg: 1, scope: !8, file: !9, line: 120, type: !13)
!150 = !DIExpression()
!151 = !DILocation(line: 120, column: 16, scope: !8)
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !8, file: !9, line: 120, type: !4)
!153 = !DILocation(line: 120, column: 31, scope: !8)
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stride", arg: 3, scope: !8, file: !9, line: 120, type: !12)
!155 = !DILocation(line: 120, column: 42, scope: !8)
!156 = !DILocation(line: 122, column: 6, scope: !157)
!157 = distinct !DILexicalBlock(scope: !8, file: !9, line: 122, column: 6)
!158 = !DILocation(line: 122, column: 13, scope: !157)
!159 = !DILocation(line: 122, column: 6, scope: !8)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !161, file: !9, line: 123, type: !12)
!161 = distinct !DILexicalBlock(scope: !162, file: !9, line: 123, column: 3)
!162 = distinct !DILexicalBlock(scope: !157, file: !9, line: 122, column: 20)
!163 = !DILocation(line: 123, column: 12, scope: !161)
!164 = !DILocation(line: 123, column: 8, scope: !161)
!165 = !DILocation(line: 123, column: 19, scope: !166)
!166 = !DILexicalBlockFile(scope: !167, file: !9, discriminator: 2)
!167 = !DILexicalBlockFile(scope: !168, file: !9, discriminator: 1)
!168 = distinct !DILexicalBlock(scope: !161, file: !9, line: 123, column: 3)
!169 = !DILocation(line: 123, column: 21, scope: !168)
!170 = !DILocation(line: 123, column: 3, scope: !161)
!171 = !DILocation(line: 124, column: 26, scope: !172)
!172 = distinct !DILexicalBlock(scope: !168, file: !9, line: 123, column: 33)
!173 = !DILocation(line: 124, column: 27, scope: !172)
!174 = !DILocation(line: 124, column: 18, scope: !172)
!175 = !DILocation(line: 124, column: 16, scope: !172)
!176 = !DILocation(line: 124, column: 8, scope: !172)
!177 = !DILocation(line: 124, column: 4, scope: !172)
!178 = !DILocation(line: 124, column: 11, scope: !172)
!179 = !DILocation(line: 125, column: 3, scope: !172)
!180 = !DILocation(line: 123, column: 29, scope: !168)
!181 = !DILocation(line: 123, column: 3, scope: !168)
!182 = !DILocation(line: 126, column: 2, scope: !162)
!183 = !DILocation(line: 126, column: 13, scope: !184)
!184 = distinct !DILexicalBlock(scope: !157, file: !9, line: 126, column: 13)
!185 = !DILocation(line: 126, column: 20, scope: !184)
!186 = !DILocation(line: 126, column: 13, scope: !157)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !188, file: !9, line: 127, type: !12)
!188 = distinct !DILexicalBlock(scope: !189, file: !9, line: 127, column: 3)
!189 = distinct !DILexicalBlock(scope: !184, file: !9, line: 126, column: 27)
!190 = !DILocation(line: 127, column: 12, scope: !188)
!191 = !DILocation(line: 127, column: 8, scope: !188)
