; ModuleID = 'result.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.djpeg_dest_struct = type { void (%struct.jpeg_decompress_struct*, %struct.djpeg_dest_struct*)*, void (%struct.jpeg_decompress_struct*, %struct.djpeg_dest_struct*, i32)*, void (%struct.jpeg_decompress_struct*, %struct.djpeg_dest_struct*)*, %struct._IO_FILE*, i8**, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

!148 = !DIEnumerator(name: "JTRC_APP0", value: 76)
!149 = !DIEnumerator(name: "JTRC_APP14", value: 77)
!150 = !DIEnumerator(name: "JTRC_DAC", value: 78)
!151 = !DIEnumerator(name: "JTRC_DHT", value: 79)
!152 = !DIEnumerator(name: "JTRC_DQT", value: 80)
!153 = !DIEnumerator(name: "JTRC_DRI", value: 81)
!154 = !DIEnumerator(name: "JTRC_EMS_CLOSE", value: 82)
!155 = !DIEnumerator(name: "JTRC_EMS_OPEN", value: 83)
!156 = !DIEnumerator(name: "JTRC_EOI", value: 84)
!157 = !DIEnumerator(name: "JTRC_HUFFBITS", value: 85)
!158 = !DIEnumerator(name: "JTRC_JFIF", value: 86)
!159 = !DIEnumerator(name: "JTRC_JFIF_BADTHUMBNAILSIZE", value: 87)
!160 = !DIEnumerator(name: "JTRC_JFIF_MINOR", value: 88)
!161 = !DIEnumerator(name: "JTRC_JFIF_THUMBNAIL", value: 89)
!162 = !DIEnumerator(name: "JTRC_MISC_MARKER", value: 90)
!163 = !DIEnumerator(name: "JTRC_PARMLESS_MARKER", value: 91)
!164 = !DIEnumerator(name: "JTRC_QUANTVALS", value: 92)
!165 = !DIEnumerator(name: "JTRC_QUANT_3_NCOLORS", value: 93)
!166 = !DIEnumerator(name: "JTRC_QUANT_NCOLORS", value: 94)
!167 = !DIEnumerator(name: "JTRC_QUANT_SELECTED", value: 95)
!168 = !DIEnumerator(name: "JTRC_RECOVERY_ACTION", value: 96)
!169 = !DIEnumerator(name: "JTRC_RST", value: 97)
!170 = !DIEnumerator(name: "JTRC_SMOOTH_NOTIMPL", value: 98)
!171 = !DIEnumerator(name: "JTRC_SOF", value: 99)
!172 = !DIEnumerator(name: "JTRC_SOF_COMPONENT", value: 100)
!173 = !DIEnumerator(name: "JTRC_SOI", value: 101)
!174 = !DIEnumerator(name: "JTRC_SOS", value: 102)
!175 = !DIEnumerator(name: "JTRC_SOS_COMPONENT", value: 103)
!176 = !DIEnumerator(name: "JTRC_SOS_PARAMS", value: 104)
!177 = !DIEnumerator(name: "JTRC_TFILE_CLOSE", value: 105)
!178 = !DIEnumerator(name: "JTRC_TFILE_OPEN", value: 106)
!179 = !DIEnumerator(name: "JTRC_UNKNOWN_IDS", value: 107)
!180 = !DIEnumerator(name: "JTRC_XMS_CLOSE", value: 108)
!181 = !DIEnumerator(name: "JTRC_XMS_OPEN", value: 109)
!182 = !DIEnumerator(name: "JWRN_ADOBE_XFORM", value: 110)
!183 = !DIEnumerator(name: "JWRN_BOGUS_PROGRESSION", value: 111)
!184 = !DIEnumerator(name: "JWRN_EXTRANEOUS_DATA", value: 112)
!185 = !DIEnumerator(name: "JWRN_HIT_MARKER", value: 113)
!186 = !DIEnumerator(name: "JWRN_HUFF_BAD_CODE", value: 114)
!187 = !DIEnumerator(name: "JWRN_JFIF_MAJOR", value: 115)
!188 = !DIEnumerator(name: "JWRN_JPEG_EOF", value: 116)
!189 = !DIEnumerator(name: "JWRN_MUST_RESYNC", value: 117)
!190 = !DIEnumerator(name: "JWRN_NOT_SEQUENTIAL", value: 118)
!191 = !DIEnumerator(name: "JWRN_TOO_MUCH_DATA", value: 119)
!192 = !DIEnumerator(name: "JMSG_LASTMSGCODE", value: 120)
!193 = !{!194, !220, !235, !314, !250, !535, !234, !233, !315, !601}
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "tga_dest_ptr", file: !195, line: 48, baseType: !196)
!195 = !DIFile(filename: "/home/gleison/tf/Benchmarks/MiBench/consumer-jpeg/tmp.c", directory: "/home/gleison/tf/Benchmarks/MiBench/consumer-jpeg")
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "tga_dest_struct", file: !195, line: 46, baseType: !198)
!198 = !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 41, size: 512, align: 64, elements: !199)
!199 = !{!200, !599, !600}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !198, file: !195, line: 42, baseType: !201, size: 384, align: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "djpeg_dest_struct", file: !202, line: 47, size: 384, align: 64, elements: !203)
!202 = !DIFile(filename: "./cdjpeg.h", directory: "/home/gleison/tf/Benchmarks/MiBench/consumer-jpeg")
!203 = !{!204, !537, !541, !542, !597, !598}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "start_output", scope: !201, file: !202, line: 51, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !208, !535}
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_decompress_ptr", file: !4, line: 250, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decompress_struct", file: !4, line: 394, size: 4928, align: 64, elements: !211)
!211 = !{!212, !340, !341, !342, !343, !344, !370, !371, !372, !373, !375, !376, !377, !378, !380, !381, !382, !384, !385, !386, !387, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !409, !422, !438, !439, !440, !466, !467, !468, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !490, !491, !492, !493, !497, !498, !499, !500, !501, !502, !505, !508, !511, !514, !517, !520, !523, !526, !529, !532}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !210, file: !4, line: 395, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !4, line: 618, size: 1344, align: 64, elements: !215)
!215 = !{!216, !308, !309, !310, !316, !317, !318, !329, !330, !331, !336, !337, !338, !339}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !214, file: !4, line: 620, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !220}
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !4, line: 248, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !4, line: 240, size: 256, align: 64, elements: !223)
!223 = !{!224, !225, !297, !306, !307}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !222, file: !4, line: 241, baseType: !213, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !222, file: !4, line: 241, baseType: !226, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !4, line: 731, size: 768, align: 64, elements: !228)
!228 = !{!229, !238, !239, !252, !266, !274, !281, !282, !286, !290, !294, !295}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !227, file: !4, line: 733, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!233, !220, !234, !235}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!234 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !236, line: 62, baseType: !237)
!236 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/tf/Benchmarks/MiBench/consumer-jpeg")
!237 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !227, file: !4, line: 735, baseType: !230, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !227, file: !4, line: 737, baseType: !240, size: 64, align: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!243, !220, !234, !250, !250}
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !4, line: 67, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !4, line: 66, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !248, line: 59, baseType: !249)
!248 = !DIFile(filename: "./jmorecfg.h", directory: "/home/gleison/tf/Benchmarks/MiBench/consumer-jpeg")
!249 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !248, line: 171, baseType: !251)
!251 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !227, file: !4, line: 740, baseType: !253, size: 64, align: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!256, !220, !234, !250, !250}
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !4, line: 72, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !4, line: 71, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !4, line: 70, baseType: !261)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 1024, align: 16, elements: !264)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !248, line: 99, baseType: !263)
!263 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!264 = !{!265}
!265 = !DISubrange(count: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !227, file: !4, line: 743, baseType: !267, size: 64, align: 64, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!270, !220, !234, !273, !250, !250, !250}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !4, line: 727, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !4, line: 727, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !248, line: 227, baseType: !234)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !227, file: !4, line: 749, baseType: !275, size: 64, align: 64, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!278, !220, !234, !273, !250, !250, !250}
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !4, line: 728, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !4, line: 728, flags: DIFlagFwdDecl)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !227, file: !4, line: 755, baseType: !217, size: 64, align: 64, offset: 384)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !227, file: !4, line: 756, baseType: !283, size: 64, align: 64, offset: 448)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!243, !220, !270, !250, !250, !273}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !227, file: !4, line: 761, baseType: !287, size: 64, align: 64, offset: 512)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!256, !220, !278, !250, !250, !273}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !227, file: !4, line: 766, baseType: !291, size: 64, align: 64, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !220, !234}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !227, file: !4, line: 767, baseType: !217, size: 64, align: 64, offset: 640)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !227, file: !4, line: 774, baseType: !296, size: 64, align: 64, offset: 704)
!296 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !222, file: !4, line: 241, baseType: !298, size: 64, align: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !4, line: 676, size: 256, align: 64, elements: !300)
!300 = !{!301, !302, !303, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !299, file: !4, line: 677, baseType: !217, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !299, file: !4, line: 679, baseType: !296, size: 64, align: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !299, file: !4, line: 680, baseType: !296, size: 64, align: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !299, file: !4, line: 681, baseType: !234, size: 32, align: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !299, file: !4, line: 682, baseType: !234, size: 32, align: 32, offset: 224)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !222, file: !4, line: 241, baseType: !273, size: 32, align: 32, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !222, file: !4, line: 241, baseType: !234, size: 32, align: 32, offset: 224)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !214, file: !4, line: 622, baseType: !291, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !214, file: !4, line: 624, baseType: !217, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !214, file: !4, line: 626, baseType: !311, size: 64, align: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !220, !314}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !214, file: !4, line: 629, baseType: !217, size: 64, align: 64, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !214, file: !4, line: 634, baseType: !234, size: 32, align: 32, offset: 320)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !214, file: !4, line: 639, baseType: !319, size: 640, align: 32, offset: 352)
!319 = !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !4, line: 636, size: 640, align: 32, elements: !320)
!320 = !{!321, !325}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !319, file: !4, line: 637, baseType: !322, size: 256, align: 32)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 256, align: 32, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 8)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !319, file: !4, line: 638, baseType: !326, size: 640, align: 8)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 640, align: 8, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 80)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !214, file: !4, line: 643, baseType: !234, size: 32, align: 32, offset: 992)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !214, file: !4, line: 651, baseType: !296, size: 64, align: 64, offset: 1024)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !214, file: !4, line: 663, baseType: !332, size: 64, align: 64, offset: 1088)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !214, file: !4, line: 664, baseType: !234, size: 32, align: 32, offset: 1152)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !214, file: !4, line: 668, baseType: !332, size: 64, align: 64, offset: 1216)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !214, file: !4, line: 669, baseType: !234, size: 32, align: 32, offset: 1280)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !214, file: !4, line: 670, baseType: !234, size: 32, align: 32, offset: 1312)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !210, file: !4, line: 395, baseType: !226, size: 64, align: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !210, file: !4, line: 395, baseType: !298, size: 64, align: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !210, file: !4, line: 395, baseType: !273, size: 32, align: 32, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !210, file: !4, line: 395, baseType: !234, size: 32, align: 32, offset: 224)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !210, file: !4, line: 398, baseType: !345, size: 64, align: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_source_mgr", file: !4, line: 700, size: 448, align: 64, elements: !347)
!347 = !{!348, !352, !353, !357, !361, !365, !369}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "next_input_byte", scope: !346, file: !4, line: 701, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !248, line: 110, baseType: !249)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_buffer", scope: !346, file: !4, line: 702, baseType: !235, size: 64, align: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "init_source", scope: !346, file: !4, line: 704, baseType: !354, size: 64, align: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !208}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "fill_input_buffer", scope: !346, file: !4, line: 705, baseType: !358, size: 64, align: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!273, !208}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "skip_input_data", scope: !346, file: !4, line: 706, baseType: !362, size: 64, align: 64, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !208, !296}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "resync_to_restart", scope: !346, file: !4, line: 707, baseType: !366, size: 64, align: 64, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!273, !208, !234}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "term_source", scope: !346, file: !4, line: 708, baseType: !354, size: 64, align: 64, offset: 384)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !210, file: !4, line: 403, baseType: !250, size: 32, align: 32, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !210, file: !4, line: 404, baseType: !250, size: 32, align: 32, offset: 352)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !210, file: !4, line: 405, baseType: !234, size: 32, align: 32, offset: 384)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !210, file: !4, line: 406, baseType: !374, size: 32, align: 32, offset: 416)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !4, line: 201, baseType: !3)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_space", scope: !210, file: !4, line: 413, baseType: !374, size: 32, align: 32, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "scale_num", scope: !210, file: !4, line: 415, baseType: !251, size: 32, align: 32, offset: 480)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "scale_denom", scope: !210, file: !4, line: 415, baseType: !251, size: 32, align: 32, offset: 512)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "output_gamma", scope: !210, file: !4, line: 417, baseType: !379, size: 64, align: 64, offset: 576)
!379 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_image", scope: !210, file: !4, line: 419, baseType: !273, size: 32, align: 32, offset: 640)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_out", scope: !210, file: !4, line: 420, baseType: !273, size: 32, align: 32, offset: 672)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !210, file: !4, line: 422, baseType: !383, size: 32, align: 32, offset: 704)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !4, line: 209, baseType: !12)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "do_fancy_upsampling", scope: !210, file: !4, line: 423, baseType: !273, size: 32, align: 32, offset: 736)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "do_block_smoothing", scope: !210, file: !4, line: 424, baseType: !273, size: 32, align: 32, offset: 768)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_colors", scope: !210, file: !4, line: 426, baseType: !273, size: 32, align: 32, offset: 800)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "dither_mode", scope: !210, file: !4, line: 428, baseType: !388, size: 32, align: 32, offset: 832)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DITHER_MODE", file: !4, line: 224, baseType: !17)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "two_pass_quantize", scope: !210, file: !4, line: 429, baseType: !273, size: 32, align: 32, offset: 864)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "desired_number_of_colors", scope: !210, file: !4, line: 430, baseType: !234, size: 32, align: 32, offset: 896)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "enable_1pass_quant", scope: !210, file: !4, line: 432, baseType: !273, size: 32, align: 32, offset: 928)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "enable_external_quant", scope: !210, file: !4, line: 433, baseType: !273, size: 32, align: 32, offset: 960)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "enable_2pass_quant", scope: !210, file: !4, line: 434, baseType: !273, size: 32, align: 32, offset: 992)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "output_width", scope: !210, file: !4, line: 442, baseType: !250, size: 32, align: 32, offset: 1024)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "output_height", scope: !210, file: !4, line: 443, baseType: !250, size: 32, align: 32, offset: 1056)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_components", scope: !210, file: !4, line: 444, baseType: !234, size: 32, align: 32, offset: 1088)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "output_components", scope: !210, file: !4, line: 445, baseType: !234, size: 32, align: 32, offset: 1120)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "rec_outbuf_height", scope: !210, file: !4, line: 449, baseType: !234, size: 32, align: 32, offset: 1152)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "actual_number_of_colors", scope: !210, file: !4, line: 461, baseType: !234, size: 32, align: 32, offset: 1184)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !210, file: !4, line: 462, baseType: !243, size: 64, align: 64, offset: 1216)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "output_scanline", scope: !210, file: !4, line: 472, baseType: !250, size: 32, align: 32, offset: 1280)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "input_scan_number", scope: !210, file: !4, line: 477, baseType: !234, size: 32, align: 32, offset: 1312)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "input_iMCU_row", scope: !210, file: !4, line: 478, baseType: !250, size: 32, align: 32, offset: 1344)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "output_scan_number", scope: !210, file: !4, line: 484, baseType: !234, size: 32, align: 32, offset: 1376)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "output_iMCU_row", scope: !210, file: !4, line: 485, baseType: !250, size: 32, align: 32, offset: 1408)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "coef_bits", scope: !210, file: !4, line: 494, baseType: !407, size: 64, align: 64, offset: 1472)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 2048, align: 32, elements: !264)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !210, file: !4, line: 505, baseType: !410, size: 256, align: 64, offset: 1536)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 256, align: 64, elements: !420)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !4, line: 95, baseType: !413)
!413 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 83, size: 1056, align: 32, elements: !414)
!414 = !{!415, !419}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !413, file: !4, line: 88, baseType: !416, size: 1024, align: 16)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 1024, align: 16, elements: !264)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !248, line: 147, baseType: !418)
!418 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !413, file: !4, line: 94, baseType: !273, size: 32, align: 32, offset: 1024)
!420 = !{!421}
!421 = !DISubrange(count: 4)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !210, file: !4, line: 508, baseType: !423, size: 256, align: 64, offset: 1792)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 256, align: 64, elements: !420)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !4, line: 111, baseType: !426)
!426 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 100, size: 2240, align: 32, elements: !427)
!427 = !{!428, !433, !437}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !426, file: !4, line: 102, baseType: !429, size: 136, align: 8)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 136, align: 8, elements: !431)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !248, line: 135, baseType: !249)
!431 = !{!432}
!432 = !DISubrange(count: 17)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !426, file: !4, line: 104, baseType: !434, size: 2048, align: 8, offset: 136)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 2048, align: 8, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !426, file: !4, line: 110, baseType: !273, size: 32, align: 32, offset: 2208)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !210, file: !4, line: 509, baseType: !423, size: 256, align: 64, offset: 2048)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !210, file: !4, line: 516, baseType: !234, size: 32, align: 32, offset: 2304)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !210, file: !4, line: 518, baseType: !441, size: 64, align: 64, offset: 2368)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !4, line: 179, baseType: !443)
!443 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 116, size: 768, align: 64, elements: !444)
!444 = !{!445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !443, file: !4, line: 120, baseType: !234, size: 32, align: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !443, file: !4, line: 121, baseType: !234, size: 32, align: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !443, file: !4, line: 122, baseType: !234, size: 32, align: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !443, file: !4, line: 123, baseType: !234, size: 32, align: 32, offset: 96)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !443, file: !4, line: 124, baseType: !234, size: 32, align: 32, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !443, file: !4, line: 129, baseType: !234, size: 32, align: 32, offset: 160)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !443, file: !4, line: 130, baseType: !234, size: 32, align: 32, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !443, file: !4, line: 139, baseType: !250, size: 32, align: 32, offset: 224)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !443, file: !4, line: 140, baseType: !250, size: 32, align: 32, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !443, file: !4, line: 147, baseType: !234, size: 32, align: 32, offset: 288)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !443, file: !4, line: 154, baseType: !250, size: 32, align: 32, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !443, file: !4, line: 155, baseType: !250, size: 32, align: 32, offset: 352)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !443, file: !4, line: 160, baseType: !273, size: 32, align: 32, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !443, file: !4, line: 164, baseType: !234, size: 32, align: 32, offset: 416)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !443, file: !4, line: 165, baseType: !234, size: 32, align: 32, offset: 448)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !443, file: !4, line: 166, baseType: !234, size: 32, align: 32, offset: 480)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !443, file: !4, line: 167, baseType: !234, size: 32, align: 32, offset: 512)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !443, file: !4, line: 168, baseType: !234, size: 32, align: 32, offset: 544)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !443, file: !4, line: 169, baseType: !234, size: 32, align: 32, offset: 576)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !443, file: !4, line: 175, baseType: !411, size: 64, align: 64, offset: 640)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !443, file: !4, line: 178, baseType: !233, size: 64, align: 64, offset: 704)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !210, file: !4, line: 521, baseType: !273, size: 32, align: 32, offset: 2432)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !210, file: !4, line: 522, baseType: !273, size: 32, align: 32, offset: 2464)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !210, file: !4, line: 524, baseType: !469, size: 128, align: 8, offset: 2496)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 128, align: 8, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 16)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !210, file: !4, line: 525, baseType: !469, size: 128, align: 8, offset: 2624)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !210, file: !4, line: 526, baseType: !469, size: 128, align: 8, offset: 2752)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !210, file: !4, line: 528, baseType: !251, size: 32, align: 32, offset: 2880)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "saw_JFIF_marker", scope: !210, file: !4, line: 533, baseType: !273, size: 32, align: 32, offset: 2912)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !210, file: !4, line: 535, baseType: !430, size: 8, align: 8, offset: 2944)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !210, file: !4, line: 536, baseType: !417, size: 16, align: 16, offset: 2960)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !210, file: !4, line: 537, baseType: !417, size: 16, align: 16, offset: 2976)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "saw_Adobe_marker", scope: !210, file: !4, line: 538, baseType: !273, size: 32, align: 32, offset: 3008)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Adobe_transform", scope: !210, file: !4, line: 539, baseType: !430, size: 8, align: 8, offset: 3040)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !210, file: !4, line: 541, baseType: !273, size: 32, align: 32, offset: 3072)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !210, file: !4, line: 550, baseType: !234, size: 32, align: 32, offset: 3104)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !210, file: !4, line: 551, baseType: !234, size: 32, align: 32, offset: 3136)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "min_DCT_scaled_size", scope: !210, file: !4, line: 553, baseType: !234, size: 32, align: 32, offset: 3168)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !210, file: !4, line: 555, baseType: !250, size: 32, align: 32, offset: 3200)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sample_range_limit", scope: !210, file: !4, line: 564, baseType: !246, size: 64, align: 64, offset: 3264)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !210, file: !4, line: 571, baseType: !234, size: 32, align: 32, offset: 3328)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !210, file: !4, line: 572, baseType: !489, size: 256, align: 64, offset: 3392)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 256, align: 64, elements: !420)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !210, file: !4, line: 575, baseType: !250, size: 32, align: 32, offset: 3648)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !210, file: !4, line: 576, baseType: !250, size: 32, align: 32, offset: 3680)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !210, file: !4, line: 578, baseType: !234, size: 32, align: 32, offset: 3712)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !210, file: !4, line: 579, baseType: !494, size: 320, align: 32, offset: 3744)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 320, align: 32, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 10)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !210, file: !4, line: 583, baseType: !234, size: 32, align: 32, offset: 4064)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !210, file: !4, line: 583, baseType: !234, size: 32, align: 32, offset: 4096)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !210, file: !4, line: 583, baseType: !234, size: 32, align: 32, offset: 4128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !210, file: !4, line: 583, baseType: !234, size: 32, align: 32, offset: 4160)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "unread_marker", scope: !210, file: !4, line: 589, baseType: !234, size: 32, align: 32, offset: 4192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !210, file: !4, line: 594, baseType: !503, size: 64, align: 64, offset: 4224)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decomp_master", file: !4, line: 594, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !210, file: !4, line: 595, baseType: !506, size: 64, align: 64, offset: 4288)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64, align: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_main_controller", file: !4, line: 595, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !210, file: !4, line: 596, baseType: !509, size: 64, align: 64, offset: 4352)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_coef_controller", file: !4, line: 596, flags: DIFlagFwdDecl)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !210, file: !4, line: 597, baseType: !512, size: 64, align: 64, offset: 4416)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64, align: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_post_controller", file: !4, line: 597, flags: DIFlagFwdDecl)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "inputctl", scope: !210, file: !4, line: 598, baseType: !515, size: 64, align: 64, offset: 4480)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64, align: 64)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_input_controller", file: !4, line: 598, flags: DIFlagFwdDecl)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !210, file: !4, line: 599, baseType: !518, size: 64, align: 64, offset: 4544)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64, align: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_reader", file: !4, line: 599, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !210, file: !4, line: 600, baseType: !521, size: 64, align: 64, offset: 4608)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_decoder", file: !4, line: 600, flags: DIFlagFwdDecl)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !210, file: !4, line: 601, baseType: !524, size: 64, align: 64, offset: 4672)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_inverse_dct", file: !4, line: 601, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !210, file: !4, line: 602, baseType: !527, size: 64, align: 64, offset: 4736)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_upsampler", file: !4, line: 602, flags: DIFlagFwdDecl)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !210, file: !4, line: 603, baseType: !530, size: 64, align: 64, offset: 4800)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_deconverter", file: !4, line: 603, flags: DIFlagFwdDecl)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "cquantize", scope: !210, file: !4, line: 604, baseType: !533, size: 64, align: 64, offset: 4864)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_quantizer", file: !4, line: 604, flags: DIFlagFwdDecl)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "djpeg_dest_ptr", file: !202, line: 45, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "put_pixel_rows", scope: !201, file: !202, line: 54, baseType: !538, size: 64, align: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64, align: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{null, !208, !535, !250}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "finish_output", scope: !201, file: !202, line: 58, baseType: !205, size: 64, align: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "output_file", scope: !201, file: !202, line: 62, baseType: !543, size: 64, align: 64, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !545, line: 48, baseType: !546)
!545 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/tf/Benchmarks/MiBench/consumer-jpeg")
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !547, line: 241, size: 1728, align: 64, elements: !548)
!547 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/tf/Benchmarks/MiBench/consumer-jpeg")
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !569, !570, !571, !572, !575, !576, !578, !582, !585, !587, !588, !589, !590, !591, !592, !593}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !546, file: !547, line: 242, baseType: !234, size: 32, align: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !546, file: !547, line: 247, baseType: !314, size: 64, align: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !546, file: !547, line: 248, baseType: !314, size: 64, align: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !546, file: !547, line: 249, baseType: !314, size: 64, align: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !546, file: !547, line: 250, baseType: !314, size: 64, align: 64, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !546, file: !547, line: 251, baseType: !314, size: 64, align: 64, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !546, file: !547, line: 252, baseType: !314, size: 64, align: 64, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !546, file: !547, line: 253, baseType: !314, size: 64, align: 64, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !546, file: !547, line: 254, baseType: !314, size: 64, align: 64, offset: 512)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !546, file: !547, line: 256, baseType: !314, size: 64, align: 64, offset: 576)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !546, file: !547, line: 257, baseType: !314, size: 64, align: 64, offset: 640)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !546, file: !547, line: 258, baseType: !314, size: 64, align: 64, offset: 704)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !546, file: !547, line: 260, baseType: !562, size: 64, align: 64, offset: 768)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !547, line: 156, size: 192, align: 64, elements: !564)
!564 = !{!565, !566, !568}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !563, file: !547, line: 157, baseType: !562, size: 64, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !563, file: !547, line: 158, baseType: !567, size: 64, align: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !563, file: !547, line: 162, baseType: !234, size: 32, align: 32, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !546, file: !547, line: 262, baseType: !567, size: 64, align: 64, offset: 832)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !546, file: !547, line: 264, baseType: !234, size: 32, align: 32, offset: 896)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !546, file: !547, line: 268, baseType: !234, size: 32, align: 32, offset: 928)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !546, file: !547, line: 270, baseType: !573, size: 64, align: 64, offset: 960)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !574, line: 131, baseType: !296)
!574 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/tf/Benchmarks/MiBench/consumer-jpeg")
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !546, file: !547, line: 274, baseType: !418, size: 16, align: 16, offset: 1024)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !546, file: !547, line: 275, baseType: !577, size: 8, align: 8, offset: 1040)
!577 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !546, file: !547, line: 276, baseType: !579, size: 8, align: 8, offset: 1048)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 8, align: 8, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 1)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !546, file: !547, line: 280, baseType: !583, size: 64, align: 64, offset: 1088)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64, align: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !547, line: 150, baseType: null)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !546, file: !547, line: 289, baseType: !586, size: 64, align: 64, offset: 1152)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !574, line: 132, baseType: !296)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !546, file: !547, line: 297, baseType: !233, size: 64, align: 64, offset: 1216)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !546, file: !547, line: 298, baseType: !233, size: 64, align: 64, offset: 1280)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !546, file: !547, line: 299, baseType: !233, size: 64, align: 64, offset: 1344)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !546, file: !547, line: 300, baseType: !233, size: 64, align: 64, offset: 1408)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !546, file: !547, line: 302, baseType: !235, size: 64, align: 64, offset: 1472)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !546, file: !547, line: 303, baseType: !234, size: 32, align: 32, offset: 1536)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !546, file: !547, line: 305, baseType: !594, size: 160, align: 8, offset: 1568)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 160, align: 8, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 20)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !201, file: !202, line: 68, baseType: !243, size: 64, align: 64, offset: 256)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_height", scope: !201, file: !202, line: 69, baseType: !250, size: 32, align: 32, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "iobuffer", scope: !198, file: !195, line: 44, baseType: !314, size: 64, align: 64, offset: 384)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_width", scope: !198, file: !195, line: 45, baseType: !250, size: 32, align: 32, offset: 448)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!603 = !{!604, !608, !609, !612, !613, !614, !615}
!604 = !DISubprogram(name: "jinit_write_targa", scope: !195, file: !195, line: 214, type: !605, isLocal: false, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: false, function: %struct.djpeg_dest_struct* (%struct.jpeg_decompress_struct*)* @jinit_write_targa, variables: !607)
!605 = !DISubroutineType(types: !606)
!606 = !{!535, !208}
!607 = !{}
!608 = !DISubprogram(name: "start_output_tga", scope: !195, file: !195, line: 160, type: !206, isLocal: true, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.jpeg_decompress_struct*, %struct.djpeg_dest_struct*)* @start_output_tga, variables: !607)
!609 = !DISubprogram(name: "write_header", scope: !195, file: !195, line: 51, type: !610, isLocal: true, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.jpeg_decompress_struct*, %struct.djpeg_dest_struct*, i32)* @write_header, variables: !607)
!610 = !DISubroutineType(types: !611)
!611 = !{null, !208, !535, !234}
!612 = !DISubprogram(name: "put_demapped_gray", scope: !195, file: !195, line: 139, type: !539, isLocal: true, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.jpeg_decompress_struct*, %struct.djpeg_dest_struct*, i32)* @put_demapped_gray, variables: !607)
!613 = !DISubprogram(name: "put_gray_rows", scope: !195, file: !195, line: 116, type: !539, isLocal: true, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.jpeg_decompress_struct*, %struct.djpeg_dest_struct*, i32)* @put_gray_rows, variables: !607)
!614 = !DISubprogram(name: "put_pixel_rows", scope: !195, file: !195, line: 95, type: !539, isLocal: true, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.jpeg_decompress_struct*, %struct.djpeg_dest_struct*, i32)* @put_pixel_rows, variables: !607)
!615 = !DISubprogram(name: "finish_output_tga", scope: !195, file: !195, line: 202, type: !206, isLocal: true, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.jpeg_decompress_struct*, %struct.djpeg_dest_struct*)* @finish_output_tga, variables: !607)
!616 = !{i32 2, !"Dwarf Version", i32 4}
!617 = !{i32 2, !"Debug Info Version", i32 3}
!618 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!619 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cinfo", arg: 1, scope: !604, file: !195, line: 214, type: !208)
!620 = !DIExpression()
!621 = !DILocation(line: 214, column: 36, scope: !604)
!622 = !DILocation(line: 218, column: 34, scope: !604)
!623 = !DILocation(line: 218, column: 39, scope: !604)
!624 = !DILocation(line: 218, column: 52, scope: !604)
!625 = !DILocation(line: 218, column: 25, scope: !604)
!626 = !DILocation(line: 218, column: 10, scope: !604)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !604, file: !195, line: 215, type: !194)
!628 = !DILocation(line: 215, column: 16, scope: !604)
!629 = !DILocation(line: 220, column: 9, scope: !604)
!630 = !DILocation(line: 220, column: 13, scope: !604)
!631 = !DILocation(line: 220, column: 26, scope: !604)
!632 = !DILocation(line: 221, column: 9, scope: !604)
!633 = !DILocation(line: 221, column: 13, scope: !604)
!634 = !DILocation(line: 221, column: 27, scope: !604)
!635 = !DILocation(line: 224, column: 3, scope: !604)
!636 = !DILocation(line: 227, column: 31, scope: !604)
!637 = !DILocation(line: 227, column: 53, scope: !604)
!638 = !DILocation(line: 227, column: 44, scope: !604)
!639 = !DILocation(line: 227, column: 9, scope: !604)
