; ModuleID = '/home/gleison/tf/Benchmarks/McCat/09-vor/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Knode = type { %struct.point, i32, i32, i32 }
%struct.point = type { i32, i32 }
%struct.Enode = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.splay_node = type { %struct.splay_element, %struct.splay_node*, %struct.splay_node*, %struct.splay_node* }
%struct.splay_element = type { i64, %struct.point }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.CHsplay_node = type { %struct.CHsplay_element, %struct.CHsplay_node*, %struct.CHsplay_node*, %struct.CHsplay_node* }
%struct.CHsplay_element = type { %struct.key, %struct.CHpoints* }
%struct.key = type { double, double, i32 }
%struct.CHpoints = type { i32, %struct.point, i32, %struct.CHpoints*, %struct.CHpoints* }
%struct.dpoint = type { double, double }

@CHno = global i32 0, align 4
@Kcount = global i32 1, align 4
@Ecount = global i32 1, align 4
@K = common global %struct.Knode* null, align 8
@E = common global %struct.Enode* null, align 8
@Splaytree = common global %struct.splay_node* null, align 8
@stdin = external global %struct._IO_FILE*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !32, globals: !73)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/McCat/09-vor")
!2 = !{}
!3 = !{!4, !5, !19, !31}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "Knode", file: !7, line: 18, baseType: !8)
!7 = !DIFile(filename: "./struktur.h", directory: "/home/gleison/tf/Benchmarks/McCat/09-vor")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "Knode", file: !7, line: 15, size: 160, align: 32, elements: !9)
!9 = !{!10, !16, !17, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !8, file: !7, line: 16, baseType: !11, size: 64, align: 32)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "point", file: !7, line: 3, baseType: !12)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "point", file: !7, line: 1, size: 64, align: 32, elements: !13)
!13 = !{!14, !15}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !12, file: !7, line: 2, baseType: !4, size: 32, align: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !12, file: !7, line: 2, baseType: !4, size: 32, align: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "e1", scope: !8, file: !7, line: 17, baseType: !4, size: 32, align: 32, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "e2", scope: !8, file: !7, line: 17, baseType: !4, size: 32, align: 32, offset: 96)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "e3", scope: !8, file: !7, line: 17, baseType: !4, size: 32, align: 32, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "Enode", file: !7, line: 24, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "Enode", file: !7, line: 20, size: 256, align: 32, elements: !22)
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !21, file: !7, line: 21, baseType: !4, size: 32, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !21, file: !7, line: 21, baseType: !4, size: 32, align: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !21, file: !7, line: 22, baseType: !4, size: 32, align: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "p2", scope: !21, file: !7, line: 22, baseType: !4, size: 32, align: 32, offset: 96)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "q1", scope: !21, file: !7, line: 22, baseType: !4, size: 32, align: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "q2", scope: !21, file: !7, line: 22, baseType: !4, size: 32, align: 32, offset: 160)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !21, file: !7, line: 23, baseType: !4, size: 32, align: 32, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !21, file: !7, line: 23, baseType: !4, size: 32, align: 32, offset: 224)
!31 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!32 = !{!33, !37, !40, !41, !44, !57, !60, !61, !64, !65, !66, !67}
!33 = !DISubprogram(name: "clean_up", scope: !34, file: !34, line: 35, type: !35, isLocal: false, isDefinition: true, scopeLine: 35, isOptimized: false, function: void ()* @clean_up, variables: !2)
!34 = !DIFile(filename: "/home/gleison/tf/Benchmarks/McCat/09-vor/tmp.c", directory: "/home/gleison/tf/Benchmarks/McCat/09-vor")
!35 = !DISubroutineType(types: !36)
!36 = !{null}
!37 = !DISubprogram(name: "getpoint", scope: !34, file: !34, line: 45, type: !38, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, function: void (i32, i32)* @getpoint, variables: !2)
!38 = !DISubroutineType(types: !39)
!39 = !{null, !4, !4}
!40 = !DISubprogram(name: "get_file", scope: !34, file: !34, line: 56, type: !35, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @get_file, variables: !2)
!41 = !DISubprogram(name: "add_point", scope: !34, file: !34, line: 70, type: !42, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, function: void (i64)* @add_point, variables: !2)
!42 = !DISubroutineType(types: !43)
!43 = !{null, !11}
!44 = !DISubprogram(name: "compute_v", scope: !34, file: !34, line: 82, type: !45, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, function: i64 (%struct.CHpoints*)* @compute_v, variables: !2)
!45 = !DISubroutineType(types: !46)
!46 = !{!11, !47}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHpoints", file: !7, line: 41, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "CHpoints", file: !7, line: 36, size: 256, align: 64, elements: !50)
!50 = !{!51, !52, !53, !54, !56}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !49, file: !7, line: 37, baseType: !4, size: 32, align: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !49, file: !7, line: 38, baseType: !11, size: 64, align: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !49, file: !7, line: 39, baseType: !4, size: 32, align: 32, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !49, file: !7, line: 40, baseType: !55, size: 64, align: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !49, file: !7, line: 40, baseType: !55, size: 64, align: 64, offset: 192)
!57 = !DISubprogram(name: "add_infinit_points_to_K", scope: !34, file: !34, line: 159, type: !58, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.CHpoints*)* @add_infinit_points_to_K, variables: !2)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !47}
!60 = !DISubprogram(name: "add_edge", scope: !34, file: !34, line: 189, type: !38, isLocal: false, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: false, function: void (i32, i32)* @add_edge, variables: !2)
!61 = !DISubprogram(name: "maximize_radius_and_angle", scope: !34, file: !34, line: 244, type: !62, isLocal: false, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: false, function: %struct.CHpoints* (%struct.CHpoints*)* @maximize_radius_and_angle, variables: !2)
!62 = !DISubroutineType(types: !63)
!63 = !{!47, !47}
!64 = !DISubprogram(name: "draw_sec", scope: !34, file: !34, line: 266, type: !58, isLocal: false, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.CHpoints*)* @draw_sec, variables: !2)
!65 = !DISubprogram(name: "alg2", scope: !34, file: !34, line: 301, type: !35, isLocal: false, isDefinition: true, scopeLine: 301, isOptimized: false, function: void ()* @alg2, variables: !2)
!66 = !DISubprogram(name: "construct_vor", scope: !34, file: !34, line: 343, type: !35, isLocal: false, isDefinition: true, scopeLine: 343, isOptimized: false, function: void ()* @construct_vor, variables: !2)
!67 = !DISubprogram(name: "main", scope: !34, file: !34, line: 353, type: !68, isLocal: false, isDefinition: true, scopeLine: 353, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !2)
!68 = !DISubroutineType(types: !69)
!69 = !{!4, !4, !70}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!73 = !{!74, !75, !76, !77, !93, !114, !115, !116, !117}
!74 = !DIGlobalVariable(name: "CHno", scope: !0, file: !34, line: 26, type: !4, isLocal: false, isDefinition: true, variable: i32* @CHno)
!75 = !DIGlobalVariable(name: "Kcount", scope: !0, file: !34, line: 29, type: !4, isLocal: false, isDefinition: true, variable: i32* @Kcount)
!76 = !DIGlobalVariable(name: "Ecount", scope: !0, file: !34, line: 30, type: !4, isLocal: false, isDefinition: true, variable: i32* @Ecount)
!77 = !DIGlobalVariable(name: "Splaytree", scope: !0, file: !34, line: 22, type: !78, isLocal: false, isDefinition: true, variable: %struct.splay_node** @Splaytree)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_node", file: !7, line: 34, baseType: !80)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "splay_node", file: !7, line: 31, size: 320, align: 64, elements: !81)
!81 = !{!82, !89, !91, !92}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !80, file: !7, line: 32, baseType: !83, size: 128, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_element", file: !7, line: 29, baseType: !84)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "splay_element", file: !7, line: 26, size: 128, align: 64, elements: !85)
!85 = !{!86, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !84, file: !7, line: 27, baseType: !87, size: 64, align: 64)
!87 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !84, file: !7, line: 28, baseType: !11, size: 64, align: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "father", scope: !80, file: !7, line: 33, baseType: !90, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !80, file: !7, line: 33, baseType: !90, size: 64, align: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !80, file: !7, line: 33, baseType: !90, size: 64, align: 64, offset: 256)
!93 = !DIGlobalVariable(name: "CHSplaytree", scope: !0, file: !34, line: 23, type: !94, isLocal: false, isDefinition: true, variable: %struct.CHsplay_node** @CHSplaytree)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHsplay_node", file: !7, line: 57, baseType: !96)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "CHsplay_node", file: !7, line: 54, size: 448, align: 64, elements: !97)
!97 = !{!98, !110, !112, !113}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !96, file: !7, line: 55, baseType: !99, size: 256, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHsplay_element", file: !7, line: 52, baseType: !100)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "CHsplay_element", file: !7, line: 49, size: 256, align: 64, elements: !101)
!101 = !{!102, !109}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !100, file: !7, line: 50, baseType: !103, size: 192, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "key", file: !7, line: 47, baseType: !104)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !7, line: 43, size: 192, align: 64, elements: !105)
!105 = !{!106, !107, !108}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !104, file: !7, line: 44, baseType: !31, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !104, file: !7, line: 45, baseType: !31, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !104, file: !7, line: 46, baseType: !4, size: 32, align: 32, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "point", scope: !100, file: !7, line: 51, baseType: !47, size: 64, align: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "father", scope: !96, file: !7, line: 56, baseType: !111, size: 64, align: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !96, file: !7, line: 56, baseType: !111, size: 64, align: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !96, file: !7, line: 56, baseType: !111, size: 64, align: 64, offset: 384)
!114 = !DIGlobalVariable(name: "S", scope: !0, file: !34, line: 24, type: !47, isLocal: false, isDefinition: true, variable: %struct.CHpoints** @S)
!115 = !DIGlobalVariable(name: "default_radius", scope: !0, file: !34, line: 25, type: !4, isLocal: false, isDefinition: true, variable: i32* @default_radius)
!116 = !DIGlobalVariable(name: "K", scope: !0, file: !34, line: 27, type: !5, isLocal: false, isDefinition: true, variable: %struct.Knode** @K)
!117 = !DIGlobalVariable(name: "E", scope: !0, file: !34, line: 28, type: !19, isLocal: false, isDefinition: true, variable: %struct.Enode** @E)
!118 = !{i32 2, !"Dwarf Version", i32 4}
!119 = !{i32 2, !"Debug Info Version", i32 3}
!120 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!121 = !DILocation(line: 36, column: 8, scope: !33)
!122 = !DILocation(line: 36, column: 3, scope: !33)
!123 = !DILocation(line: 37, column: 8, scope: !33)
!124 = !DILocation(line: 37, column: 3, scope: !33)
!125 = !DILocation(line: 38, column: 10, scope: !33)
!126 = !DILocation(line: 39, column: 10, scope: !33)
!127 = !DILocation(line: 40, column: 1, scope: !33)
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !37, file: !34, line: 45, type: !4)
!129 = !DIExpression()
!130 = !DILocation(line: 45, column: 19, scope: !37)
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !37, file: !34, line: 45, type: !4)
!132 = !DILocation(line: 45, column: 26, scope: !37)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !37, file: !34, line: 46, type: !11)
!134 = !DILocation(line: 46, column: 9, scope: !37)
!135 = !DILocation(line: 48, column: 9, scope: !37)
!136 = !DILocation(line: 48, column: 5, scope: !37)
!137 = !DILocation(line: 48, column: 7, scope: !37)
!138 = !DILocation(line: 49, column: 9, scope: !37)
!139 = !DILocation(line: 49, column: 5, scope: !37)
!140 = !DILocation(line: 49, column: 7, scope: !37)
!141 = !DILocation(line: 50, column: 3, scope: !37)
!142 = !DILocation(line: 51, column: 1, scope: !37)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !40, file: !34, line: 57, type: !4)
!144 = !DILocation(line: 57, column: 7, scope: !40)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !40, file: !34, line: 57, type: !4)
!146 = !DILocation(line: 57, column: 10, scope: !40)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !40, file: !34, line: 57, type: !4)
!148 = !DILocation(line: 57, column: 13, scope: !40)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "no_p", scope: !40, file: !34, line: 57, type: !4)
!150 = !DILocation(line: 57, column: 16, scope: !40)
!151 = !DILocation(line: 59, column: 15, scope: !40)
!152 = !DILocation(line: 59, column: 13, scope: !40)
!153 = !DILocation(line: 60, column: 10, scope: !40)
!154 = !DILocation(line: 60, column: 3, scope: !40)
!155 = !DILocation(line: 61, column: 10, scope: !156)
!156 = distinct !DILexicalBlock(scope: !40, file: !34, line: 61, column: 3)
!157 = !DILocation(line: 61, column: 8, scope: !156)
!158 = !DILocation(line: 61, column: 15, scope: !159)
!159 = !DILexicalBlockFile(scope: !160, file: !34, discriminator: 2)
!160 = !DILexicalBlockFile(scope: !161, file: !34, discriminator: 1)
!161 = distinct !DILexicalBlock(scope: !156, file: !34, line: 61, column: 3)
!162 = !DILocation(line: 61, column: 20, scope: !161)
!163 = !DILocation(line: 61, column: 17, scope: !161)
!164 = !DILocation(line: 61, column: 3, scope: !156)
!165 = !DILocation(line: 62, column: 12, scope: !166)
!166 = distinct !DILexicalBlock(scope: !161, file: !34, line: 61, column: 31)
!167 = !DILocation(line: 62, column: 5, scope: !166)
!168 = !DILocation(line: 63, column: 14, scope: !166)
!169 = !DILocation(line: 63, column: 17, scope: !166)
!170 = !DILocation(line: 63, column: 5, scope: !166)
!171 = !DILocation(line: 64, column: 3, scope: !166)
!172 = !DILocation(line: 61, column: 27, scope: !161)
!173 = !DILocation(line: 61, column: 3, scope: !161)
!174 = !DILocation(line: 65, column: 1, scope: !40)
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !41, file: !34, line: 70, type: !11)
!176 = !DILocation(line: 70, column: 22, scope: !41)
!177 = !DILocation(line: 71, column: 5, scope: !41)
!178 = !DILocation(line: 71, column: 3, scope: !41)
!179 = !DILocation(line: 71, column: 13, scope: !41)
!180 = !DILocation(line: 71, column: 17, scope: !41)
!181 = !DILocation(line: 72, column: 5, scope: !41)
!182 = !DILocation(line: 72, column: 3, scope: !41)
!183 = !DILocation(line: 72, column: 13, scope: !41)
!184 = !DILocation(line: 72, column: 16, scope: !41)
!185 = !DILocation(line: 73, column: 5, scope: !41)
!186 = !DILocation(line: 73, column: 3, scope: !41)
!187 = !DILocation(line: 73, column: 13, scope: !41)
!188 = !DILocation(line: 73, column: 16, scope: !41)
!189 = !DILocation(line: 74, column: 5, scope: !41)
!190 = !DILocation(line: 74, column: 3, scope: !41)
!191 = !DILocation(line: 74, column: 13, scope: !41)
!192 = !DILocation(line: 74, column: 16, scope: !41)
!193 = !DILocation(line: 75, column: 9, scope: !41)
!194 = !DILocation(line: 76, column: 1, scope: !41)
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "P", arg: 1, scope: !44, file: !34, line: 82, type: !47)
!196 = !DILocation(line: 82, column: 27, scope: !44)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "An", scope: !44, file: !34, line: 92, type: !11)
!198 = !DILocation(line: 92, column: 9, scope: !44)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Bn", scope: !44, file: !34, line: 92, type: !11)
!200 = !DILocation(line: 92, column: 13, scope: !44)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Cn", scope: !44, file: !34, line: 92, type: !11)
!202 = !DILocation(line: 92, column: 17, scope: !44)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Dn", scope: !44, file: !34, line: 92, type: !11)
!204 = !DILocation(line: 92, column: 21, scope: !44)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !44, file: !34, line: 93, type: !11)
!206 = !DILocation(line: 93, column: 9, scope: !44)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !44, file: !34, line: 94, type: !31)
!208 = !DILocation(line: 94, column: 10, scope: !44)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !44, file: !34, line: 96, type: !11)
!210 = !DILocation(line: 96, column: 9, scope: !44)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "di", scope: !44, file: !34, line: 97, type: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "dpoint", file: !7, line: 7, baseType: !213)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "dpoint", file: !7, line: 5, size: 128, align: 64, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !213, file: !7, line: 6, baseType: !31, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !213, file: !7, line: 6, baseType: !31, size: 64, align: 64, offset: 64)
!217 = !DILocation(line: 97, column: 10, scope: !44)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !44, file: !34, line: 100, type: !11)
!219 = !DILocation(line: 100, column: 9, scope: !44)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "np", scope: !44, file: !34, line: 100, type: !11)
!221 = !DILocation(line: 100, column: 12, scope: !44)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minX", scope: !44, file: !34, line: 101, type: !31)
!223 = !DILocation(line: 101, column: 10, scope: !44)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minY", scope: !44, file: !34, line: 101, type: !31)
!225 = !DILocation(line: 101, column: 16, scope: !44)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxX", scope: !44, file: !34, line: 101, type: !31)
!227 = !DILocation(line: 101, column: 22, scope: !44)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxY", scope: !44, file: !34, line: 101, type: !31)
!229 = !DILocation(line: 101, column: 28, scope: !44)
!230 = !DILocation(line: 103, column: 8, scope: !44)
!231 = !DILocation(line: 104, column: 8, scope: !44)
!232 = !DILocation(line: 105, column: 8, scope: !44)
!233 = !DILocation(line: 106, column: 8, scope: !44)
!234 = !DILocation(line: 107, column: 6, scope: !44)
!235 = !DILocation(line: 107, column: 8, scope: !44)
!236 = !DILocation(line: 108, column: 6, scope: !44)
!237 = !DILocation(line: 108, column: 8, scope: !44)
!238 = !DILocation(line: 109, column: 6, scope: !44)
!239 = !DILocation(line: 109, column: 8, scope: !44)
!240 = !DILocation(line: 110, column: 6, scope: !44)
!241 = !DILocation(line: 110, column: 8, scope: !44)
!242 = !DILocation(line: 111, column: 6, scope: !44)
!243 = !DILocation(line: 111, column: 8, scope: !44)
!244 = !DILocation(line: 112, column: 6, scope: !44)
!245 = !DILocation(line: 112, column: 8, scope: !44)
!246 = !DILocation(line: 113, column: 6, scope: !44)
!247 = !DILocation(line: 113, column: 8, scope: !44)
!248 = !DILocation(line: 114, column: 6, scope: !44)
!249 = !DILocation(line: 114, column: 8, scope: !44)
!250 = !DILocation(line: 116, column: 7, scope: !44)
!251 = !DILocation(line: 116, column: 10, scope: !44)
!252 = !DILocation(line: 117, column: 13, scope: !44)
!253 = !DILocation(line: 117, column: 8, scope: !44)
!254 = !DILocation(line: 117, column: 17, scope: !44)
!255 = !DILocation(line: 119, column: 7, scope: !44)
!256 = !DILocation(line: 120, column: 22, scope: !44)
!257 = !DILocation(line: 120, column: 7, scope: !44)
!258 = !DILocation(line: 120, column: 5, scope: !44)
!259 = !DILocation(line: 122, column: 10, scope: !260)
!260 = distinct !DILexicalBlock(scope: !44, file: !34, line: 122, column: 7)
!261 = !DILocation(line: 122, column: 17, scope: !260)
!262 = !DILocation(line: 122, column: 12, scope: !260)
!263 = !DILocation(line: 122, column: 20, scope: !260)
!264 = !DILocation(line: 122, column: 26, scope: !265)
!265 = !DILexicalBlockFile(scope: !260, file: !34, discriminator: 1)
!266 = !DILocation(line: 122, column: 33, scope: !260)
!267 = !DILocation(line: 122, column: 28, scope: !260)
!268 = !DILocation(line: 122, column: 7, scope: !44)
!269 = !DILocation(line: 123, column: 27, scope: !270)
!270 = distinct !DILexicalBlock(scope: !260, file: !34, line: 122, column: 37)
!271 = !DILocation(line: 123, column: 30, scope: !270)
!272 = !DILocation(line: 123, column: 10, scope: !270)
!273 = !DILocation(line: 124, column: 10, scope: !274)
!274 = distinct !DILexicalBlock(scope: !270, file: !34, line: 124, column: 9)
!275 = !DILocation(line: 124, column: 20, scope: !274)
!276 = !DILocation(line: 124, column: 15, scope: !274)
!277 = !DILocation(line: 124, column: 23, scope: !274)
!278 = !DILocation(line: 124, column: 30, scope: !279)
!279 = !DILexicalBlockFile(scope: !274, file: !34, discriminator: 1)
!280 = !DILocation(line: 124, column: 34, scope: !274)
