; ModuleID = '/home/gleison/tf/Benchmarks/Prolangs-C/unix-smail/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.alias_node = type { i8*, %struct.alias_node*, %struct.alias_node* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@nargc = internal global i32 0, align 4
@.str = private unnamed_addr constant [10 x i8] c":include:\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [6 x i8] c"%s/%s\00", align 1
@.str.3 = private unnamed_addr constant [9 x i8] c".forward\00", align 1
@alias.t_dom = internal global [512 x i8] zeroinitializer, align 16
@alias.t_unam = internal global [512 x i8] zeroinitializer, align 16
@nargv = internal global [500 x i8*] zeroinitializer, align 16
@v_search.loaded = internal global i32 0, align 4
@aliases = internal global %struct.alias_node { i8* getelementptr inbounds ([1 x i8], [1 x i8]* @.str.7, i32 0, i32 0), %struct.alias_node* null, %struct.alias_node* null }, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !22, globals: !50)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/unix-smail")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "edebug", file: !4, line: 303, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./defs.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/unix-smail")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "NO", value: 0)
!7 = !DIEnumerator(name: "VERBOSE", value: 1)
!8 = !DIEnumerator(name: "YES", value: 2)
!9 = !{!10, !20, !21}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "node", file: !12, line: 37, baseType: !13)
!12 = !DIFile(filename: "/home/gleison/tf/Benchmarks/Prolangs-C/unix-smail/tmp.c", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/unix-smail")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "alias_node", file: !12, line: 39, size: 192, align: 64, elements: !14)
!14 = !{!15, !18, !19}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !13, file: !12, line: 40, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "horz", scope: !13, file: !12, line: 41, baseType: !10, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !13, file: !12, line: 42, baseType: !10, size: 64, align: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!21 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!22 = !{!23, !30, !33, !36, !39, !42, !45, !46, !47}
!23 = !DISubprogram(name: "alias", scope: !12, file: !12, line: 87, type: !24, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, function: i8** (i32*, i8**)* @alias, variables: !29)
!24 = !DISubroutineType(types: !25)
!25 = !{!26, !27, !26}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!29 = !{}
!30 = !DISubprogram(name: "v_search", scope: !12, file: !12, line: 300, type: !31, isLocal: false, isDefinition: true, scopeLine: 300, flags: DIFlagPrototyped, isOptimized: false, function: %struct.alias_node* (i8*)* @v_search, variables: !29)
!31 = !DISubroutineType(types: !32)
!32 = !{!10, !16}
!33 = !DISubprogram(name: "h_search", scope: !12, file: !12, line: 332, type: !34, isLocal: false, isDefinition: true, scopeLine: 332, flags: DIFlagPrototyped, isOptimized: false, function: %struct.alias_node* (%struct.alias_node*, i8*)* @h_search, variables: !29)
!34 = !DISubroutineType(types: !35)
!35 = !{!10, !10, !16}
!36 = !DISubprogram(name: "load_alias", scope: !12, file: !12, line: 354, type: !37, isLocal: false, isDefinition: true, scopeLine: 354, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.alias_node*, i8*)* @load_alias, variables: !29)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !10, !16}
!39 = !DISubprogram(name: "recipients", scope: !12, file: !12, line: 437, type: !40, isLocal: false, isDefinition: true, scopeLine: 437, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.alias_node*, i8*)* @recipients, variables: !29)
!40 = !DISubroutineType(types: !41)
!41 = !{!28, !10, !16}
!42 = !DISubprogram(name: "strip_comments", scope: !12, file: !12, line: 484, type: !43, isLocal: false, isDefinition: true, scopeLine: 484, flags: DIFlagPrototyped, isOptimized: false, function: void (i8*)* @strip_comments, variables: !29)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !16}
!45 = !DISubprogram(name: "add_vert", scope: !12, file: !12, line: 503, type: !34, isLocal: false, isDefinition: true, scopeLine: 503, flags: DIFlagPrototyped, isOptimized: false, function: %struct.alias_node* (%struct.alias_node*, i8*)* @add_vert, variables: !29)
!46 = !DISubprogram(name: "add_horz", scope: !12, file: !12, line: 533, type: !37, isLocal: false, isDefinition: true, scopeLine: 533, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.alias_node*, i8*)* @add_horz, variables: !29)
!47 = !DISubprogram(name: "pop", scope: !12, file: !12, line: 550, type: !48, isLocal: false, isDefinition: true, scopeLine: 550, flags: DIFlagPrototyped, isOptimized: false, function: %struct.alias_node* (%struct.alias_node*)* @pop, variables: !29)
!48 = !DISubroutineType(types: !49)
!49 = !{!10, !10}
!50 = !{!51, !55, !56, !57, !61, !62}
!51 = !DIGlobalVariable(name: "t_dom", scope: !23, file: !12, line: 261, type: !52, isLocal: true, isDefinition: true, variable: [512 x i8]* @alias.t_dom)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 4096, align: 8, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 512)
!55 = !DIGlobalVariable(name: "t_unam", scope: !23, file: !12, line: 261, type: !52, isLocal: true, isDefinition: true, variable: [512 x i8]* @alias.t_unam)
!56 = !DIGlobalVariable(name: "loaded", scope: !30, file: !12, line: 303, type: !28, isLocal: true, isDefinition: true, variable: i32* @v_search.loaded)
!57 = !DIGlobalVariable(name: "nargv", scope: !0, file: !12, line: 67, type: !58, isLocal: true, isDefinition: true, variable: [500 x i8*]* @nargv)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 32000, align: 64, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 500)
!61 = !DIGlobalVariable(name: "nargc", scope: !0, file: !12, line: 66, type: !28, isLocal: true, isDefinition: true, variable: i32* @nargc)
!62 = !DIGlobalVariable(name: "aliases", scope: !0, file: !12, line: 46, type: !11, isLocal: true, isDefinition: true, variable: %struct.alias_node* @aliases)
!63 = !{i32 2, !"Dwarf Version", i32 4}
!64 = !{i32 2, !"Debug Info Version", i32 3}
!65 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pargc", arg: 1, scope: !23, file: !12, line: 87, type: !27)
!67 = !DIExpression()
!68 = !DILocation(line: 87, column: 19, scope: !23)
!69 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !23, file: !12, line: 87, type: !26)
!70 = !DILocation(line: 87, column: 33, scope: !23)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !23, file: !12, line: 91, type: !28)
!72 = !DILocation(line: 91, column: 7, scope: !23)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domain", scope: !23, file: !12, line: 92, type: !52)
!74 = !DILocation(line: 92, column: 8, scope: !23)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ubuf", scope: !23, file: !12, line: 92, type: !52)
!76 = !DILocation(line: 92, column: 24, scope: !23)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "user", scope: !23, file: !12, line: 92, type: !16)
!78 = !DILocation(line: 92, column: 39, scope: !23)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "addr", scope: !23, file: !12, line: 93, type: !10)
!80 = !DILocation(line: 93, column: 9, scope: !23)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "addrstk", scope: !23, file: !12, line: 93, type: !11)
!82 = !DILocation(line: 93, column: 15, scope: !23)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flist", scope: !23, file: !12, line: 94, type: !10)
!84 = !DILocation(line: 94, column: 9, scope: !23)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fliststk", scope: !23, file: !12, line: 94, type: !11)
!86 = !DILocation(line: 94, column: 16, scope: !23)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !23, file: !12, line: 94, type: !10)
!88 = !DILocation(line: 94, column: 27, scope: !23)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !23, file: !12, line: 97, type: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !92, line: 48, baseType: !93)
!92 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/unix-smail")
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !94, line: 241, size: 1728, align: 64, elements: !95)
!94 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/unix-smail")
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !116, !117, !118, !119, !123, !125, !127, !131, !134, !136, !137, !138, !139, !140, !144, !145}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !93, file: !94, line: 242, baseType: !28, size: 32, align: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !93, file: !94, line: 247, baseType: !16, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !93, file: !94, line: 248, baseType: !16, size: 64, align: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !93, file: !94, line: 249, baseType: !16, size: 64, align: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !93, file: !94, line: 250, baseType: !16, size: 64, align: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !93, file: !94, line: 251, baseType: !16, size: 64, align: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !93, file: !94, line: 252, baseType: !16, size: 64, align: 64, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !93, file: !94, line: 253, baseType: !16, size: 64, align: 64, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !93, file: !94, line: 254, baseType: !16, size: 64, align: 64, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !93, file: !94, line: 256, baseType: !16, size: 64, align: 64, offset: 576)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !93, file: !94, line: 257, baseType: !16, size: 64, align: 64, offset: 640)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !93, file: !94, line: 258, baseType: !16, size: 64, align: 64, offset: 704)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !93, file: !94, line: 260, baseType: !109, size: 64, align: 64, offset: 768)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !94, line: 156, size: 192, align: 64, elements: !111)
!111 = !{!112, !113, !115}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !110, file: !94, line: 157, baseType: !109, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !110, file: !94, line: 158, baseType: !114, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !110, file: !94, line: 162, baseType: !28, size: 32, align: 32, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !93, file: !94, line: 262, baseType: !114, size: 64, align: 64, offset: 832)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !93, file: !94, line: 264, baseType: !28, size: 32, align: 32, offset: 896)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !93, file: !94, line: 268, baseType: !28, size: 32, align: 32, offset: 928)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !93, file: !94, line: 270, baseType: !120, size: 64, align: 64, offset: 960)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !121, line: 131, baseType: !122)
!121 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/unix-smail")
!122 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !93, file: !94, line: 274, baseType: !124, size: 16, align: 16, offset: 1024)
!124 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !93, file: !94, line: 275, baseType: !126, size: 8, align: 8, offset: 1040)
!126 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !93, file: !94, line: 276, baseType: !128, size: 8, align: 8, offset: 1048)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, align: 8, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 1)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !93, file: !94, line: 280, baseType: !132, size: 64, align: 64, offset: 1088)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !94, line: 150, baseType: null)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !93, file: !94, line: 289, baseType: !135, size: 64, align: 64, offset: 1152)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !121, line: 132, baseType: !122)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !93, file: !94, line: 297, baseType: !20, size: 64, align: 64, offset: 1216)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !93, file: !94, line: 298, baseType: !20, size: 64, align: 64, offset: 1280)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !93, file: !94, line: 299, baseType: !20, size: 64, align: 64, offset: 1344)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !93, file: !94, line: 300, baseType: !20, size: 64, align: 64, offset: 1408)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !93, file: !94, line: 302, baseType: !141, size: 64, align: 64, offset: 1472)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !142, line: 62, baseType: !143)
!142 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/unix-smail")
!143 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !93, file: !94, line: 303, baseType: !28, size: 32, align: 32, offset: 1536)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !93, file: !94, line: 305, baseType: !146, size: 160, align: 8, offset: 1568)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 160, align: 8, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 20)
!149 = !DILocation(line: 97, column: 9, scope: !23)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !23, file: !12, line: 98, type: !10)
!151 = !DILocation(line: 98, column: 9, scope: !23)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "home", scope: !23, file: !12, line: 99, type: !16)
!153 = !DILocation(line: 99, column: 9, scope: !23)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !23, file: !12, line: 99, type: !52)
!155 = !DILocation(line: 99, column: 15, scope: !23)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aliased", scope: !23, file: !12, line: 100, type: !28)
!157 = !DILocation(line: 100, column: 7, scope: !23)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !23, file: !12, line: 101, type: !159)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !160, line: 46, size: 1152, align: 64, elements: !161)
!160 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/unix-smail")
!161 = !{!162, !164, !166, !168, !170, !172, !174, !175, !176, !177, !179, !181, !189, !190, !191}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !159, file: !160, line: 48, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !121, line: 124, baseType: !143)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !159, file: !160, line: 53, baseType: !165, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !121, line: 127, baseType: !143)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !159, file: !160, line: 61, baseType: !167, size: 64, align: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !121, line: 130, baseType: !143)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !159, file: !160, line: 62, baseType: !169, size: 32, align: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !121, line: 129, baseType: !21)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !159, file: !160, line: 64, baseType: !171, size: 32, align: 32, offset: 224)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !121, line: 125, baseType: !21)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !159, file: !160, line: 65, baseType: !173, size: 32, align: 32, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !121, line: 126, baseType: !21)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !159, file: !160, line: 67, baseType: !28, size: 32, align: 32, offset: 288)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !159, file: !160, line: 69, baseType: !163, size: 64, align: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !159, file: !160, line: 74, baseType: !120, size: 64, align: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !159, file: !160, line: 78, baseType: !178, size: 64, align: 64, offset: 448)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !121, line: 153, baseType: !122)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !159, file: !160, line: 80, baseType: !180, size: 64, align: 64, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !121, line: 158, baseType: !122)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !159, file: !160, line: 91, baseType: !182, size: 128, align: 64, offset: 576)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !183, line: 120, size: 128, align: 64, elements: !184)
!183 = !DIFile(filename: "/usr/include/time.h", directory: "/home/gleison/tf/Benchmarks/Prolangs-C/unix-smail")
!184 = !{!185, !187}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !182, file: !183, line: 122, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !121, line: 139, baseType: !122)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !182, file: !183, line: 123, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !121, line: 175, baseType: !122)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !159, file: !160, line: 92, baseType: !182, size: 128, align: 64, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !159, file: !160, line: 93, baseType: !182, size: 128, align: 64, offset: 832)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !159, file: !160, line: 106, baseType: !192, size: 192, align: 64, offset: 960)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 192, align: 64, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 3)
!195 = !DILocation(line: 101, column: 15, scope: !23)
!196 = !DILocation(line: 108, column: 8, scope: !23)
!197 = !DILocation(line: 109, column: 9, scope: !23)
!198 = !DILocation(line: 110, column: 10, scope: !23)
!199 = !DILocation(line: 110, column: 8, scope: !23)
!200 = !DILocation(line: 112, column: 3, scope: !23)
!201 = !DILocation(line: 112, column: 9, scope: !23)
!202 = !DILocation(line: 112, column: 14, scope: !23)
!203 = !DILocation(line: 113, column: 3, scope: !23)
!204 = !DILocation(line: 113, column: 10, scope: !23)
!205 = !DILocation(line: 113, column: 15, scope: !23)
!206 = !DILocation(line: 118, column: 10, scope: !207)
!207 = distinct !DILexicalBlock(scope: !23, file: !12, line: 118, column: 3)
!208 = !DILocation(line: 118, column: 8, scope: !207)
!209 = !DILocation(line: 118, column: 15, scope: !210)
!210 = !DILexicalBlockFile(scope: !211, file: !12, discriminator: 2)
!211 = !DILexicalBlockFile(scope: !212, file: !12, discriminator: 1)
!212 = distinct !DILexicalBlock(scope: !207, file: !12, line: 118, column: 3)
!213 = !DILocation(line: 118, column: 20, scope: !212)
!214 = !DILocation(line: 118, column: 19, scope: !212)
!215 = !DILocation(line: 118, column: 17, scope: !212)
!216 = !DILocation(line: 118, column: 3, scope: !207)
!217 = !DILocation(line: 119, column: 10, scope: !218)
!218 = distinct !DILexicalBlock(scope: !212, file: !12, line: 118, column: 32)
!219 = !DILocation(line: 119, column: 21, scope: !218)
!220 = !DILocation(line: 119, column: 16, scope: !218)
!221 = !DILocation(line: 119, column: 5, scope: !218)
!222 = !DILocation(line: 120, column: 3, scope: !218)
!223 = !DILocation(line: 118, column: 28, scope: !212)
!224 = !DILocation(line: 118, column: 3, scope: !212)
!225 = !DILocation(line: 127, column: 3, scope: !23)
!226 = !DILocation(line: 127, column: 11, scope: !227)
!227 = !DILexicalBlockFile(scope: !228, file: !12, discriminator: 4)
!228 = !DILexicalBlockFile(scope: !23, file: !12, discriminator: 1)
!229 = !DILocation(line: 127, column: 17, scope: !23)
!230 = !DILocation(line: 127, column: 28, scope: !23)
!231 = !DILocation(line: 127, column: 41, scope: !232)
!232 = !DILexicalBlockFile(scope: !23, file: !12, discriminator: 2)
!233 = !DILocation(line: 127, column: 37, scope: !23)
!234 = !DILocation(line: 127, column: 35, scope: !23)
!235 = !DILocation(line: 127, column: 48, scope: !23)
!236 = !DILocation(line: 127, column: 3, scope: !237)
!237 = !DILexicalBlockFile(scope: !23, file: !12, discriminator: 3)
!238 = !DILocation(line: 129, column: 19, scope: !239)
!239 = distinct !DILexicalBlock(scope: !240, file: !12, line: 129, column: 9)
!240 = distinct !DILexicalBlock(scope: !23, file: !12, line: 127, column: 59)
!241 = !DILocation(line: 129, column: 22, scope: !239)
!242 = !DILocation(line: 129, column: 9, scope: !239)
!243 = !DILocation(line: 129, column: 46, scope: !239)
!244 = !DILocation(line: 129, column: 9, scope: !240)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !246, file: !12, line: 135, type: !16)
!246 = distinct !DILexicalBlock(scope: !239, file: !12, line: 129, column: 52)
!247 = !DILocation(line: 135, column: 13, scope: !246)
!248 = !DILocation(line: 135, column: 17, scope: !246)
!249 = !DILocation(line: 135, column: 20, scope: !246)
!250 = !DILocation(line: 135, column: 27, scope: !246)
!251 = !DILocation(line: 137, column: 13, scope: !252)
!252 = distinct !DILexicalBlock(scope: !246, file: !12, line: 137, column: 11)
!253 = !DILocation(line: 137, column: 12, scope: !252)
!254 = !DILocation(line: 137, column: 15, scope: !252)
!255 = !DILocation(line: 137, column: 23, scope: !252)
!256 = !DILocation(line: 137, column: 36, scope: !257)
