; ModuleID = '/home/gleison/tf/Benchmarks/bots/serial/health/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.Village = type { i32, %struct.Village*, %struct.Village*, %struct.Village*, %struct.Patient*, %struct.Hosp, i32, i32 }
%struct.Patient = type { i32, i32, i32, i32, i32, %struct.Village*, %struct.Patient*, %struct.Patient* }
%struct.Hosp = type { i32, i32, %struct.Patient*, %struct.Patient*, %struct.Patient*, %struct.Patient* }

@bots_sequential_flag = global i32 0, align 4
@bots_check_flag = global i32 0, align 4
@bots_verbose_mode = global i32 1, align 4
@bots_result = global i32 3, align 4
@bots_output_format = global i32 1, align 4
@bots_print_header = global i32 0, align 4
@bots_repetitions = global i32 1, align 4
@bots_time_program = global double 0.000000e+00, align 8
@bots_time_sequential = global double 0.000000e+00, align 8
@bots_number_of_tasks = global i64 0, align 8
@bots_arg_file = global [255 x i8] zeroinitializer, align 16
@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [2 x i8] c"\0A\00", align 1

!205 = !DILocation(line: 343, column: 9, scope: !148)
!206 = !DILocation(line: 344, column: 9, scope: !148)
!207 = !DILocation(line: 382, column: 14, scope: !148)
!208 = !DILocation(line: 382, column: 9, scope: !148)
!209 = !DILocation(line: 382, column: 20, scope: !148)
!210 = !DILocation(line: 383, column: 10, scope: !148)
!211 = !DILocation(line: 384, column: 13, scope: !212)
!212 = distinct !DILexicalBlock(scope: !148, file: !14, line: 384, column: 13)
!213 = !DILocation(line: 384, column: 21, scope: !212)
!214 = !DILocation(line: 384, column: 18, scope: !212)
!215 = !DILocation(line: 384, column: 13, scope: !148)
!216 = !DILocation(line: 385, column: 11, scope: !217)
!217 = distinct !DILexicalBlock(scope: !212, file: !14, line: 384, column: 24)
!218 = !DILocation(line: 386, column: 11, scope: !217)
!219 = !DILocation(line: 388, column: 40, scope: !148)
!220 = !DILocation(line: 388, column: 35, scope: !148)
!221 = !DILocation(line: 388, column: 30, scope: !148)
!222 = !DILocation(line: 388, column: 28, scope: !148)
!223 = !DILocation(line: 389, column: 9, scope: !148)
!224 = !DILocation(line: 411, column: 14, scope: !148)
!225 = !DILocation(line: 411, column: 9, scope: !148)
!226 = !DILocation(line: 411, column: 20, scope: !148)
!227 = !DILocation(line: 412, column: 10, scope: !148)
!228 = !DILocation(line: 413, column: 13, scope: !229)
!229 = distinct !DILexicalBlock(scope: !148, file: !14, line: 413, column: 13)
!230 = !DILocation(line: 413, column: 21, scope: !229)
!231 = !DILocation(line: 413, column: 18, scope: !229)
!232 = !DILocation(line: 413, column: 13, scope: !148)
!233 = !DILocation(line: 414, column: 11, scope: !234)
!234 = distinct !DILexicalBlock(scope: !229, file: !14, line: 413, column: 24)
!235 = !DILocation(line: 415, column: 11, scope: !234)
!236 = !DILocation(line: 417, column: 60, scope: !148)
!237 = !DILocation(line: 417, column: 55, scope: !148)
!238 = !DILocation(line: 417, column: 50, scope: !148)
!239 = !DILocation(line: 417, column: 27, scope: !148)
!240 = !DILocation(line: 424, column: 9, scope: !148)
!241 = !DILocation(line: 448, column: 14, scope: !148)
!242 = !DILocation(line: 448, column: 9, scope: !148)
!243 = !DILocation(line: 448, column: 20, scope: !148)
!244 = !DILocation(line: 449, column: 27, scope: !148)
!245 = !DILocation(line: 450, column: 9, scope: !148)
!246 = !DILocation(line: 456, column: 17, scope: !148)
!247 = !DILocation(line: 456, column: 9, scope: !148)
!248 = !DILocation(line: 457, column: 9, scope: !148)
!249 = !DILocation(line: 458, column: 9, scope: !148)
!250 = !DILocation(line: 460, column: 5, scope: !144)
!251 = !DILocation(line: 465, column: 15, scope: !252)
!252 = distinct !DILexicalBlock(scope: !138, file: !14, line: 460, column: 12)
!253 = !DILocation(line: 465, column: 7, scope: !252)
!254 = !DILocation(line: 466, column: 7, scope: !252)
!255 = !DILocation(line: 467, column: 7, scope: !252)
!256 = !DILocation(line: 469, column: 3, scope: !139)
!257 = !DILocation(line: 280, column: 26, scope: !133)
!258 = !DILocation(line: 280, column: 3, scope: !133)
!259 = !DILocation(line: 470, column: 1, scope: !18)
!260 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !25, file: !14, line: 474, type: !21)
!261 = !DILocation(line: 474, column: 26, scope: !25)
!262 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !25, file: !14, line: 474, type: !22)
!263 = !DILocation(line: 474, column: 39, scope: !25)
!264 = !DILocation(line: 475, column: 26, scope: !25)
!265 = !DILocation(line: 475, column: 32, scope: !25)
!266 = !DILocation(line: 475, column: 3, scope: !25)
!267 = !DILocation(line: 477, column: 1, scope: !25)
!268 = !DILocation(line: 484, column: 3, scope: !26)
!269 = !DILocation(line: 485, column: 3, scope: !26)
!270 = !DILocation(line: 486, column: 3, scope: !26)
!271 = !DILocation(line: 487, column: 3, scope: !26)
!272 = !DILocation(line: 490, column: 3, scope: !26)
!273 = !DILocation(line: 491, column: 3, scope: !26)
!274 = !DILocation(line: 492, column: 3, scope: !26)
!275 = !DILocation(line: 493, column: 3, scope: !26)
!276 = !DILocation(line: 494, column: 3, scope: !26)
!277 = !DILocation(line: 495, column: 3, scope: !26)
!278 = !DILocation(line: 504, column: 3, scope: !26)
!279 = !DILocation(line: 506, column: 1, scope: !26)
!280 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !27, file: !14, line: 511, type: !21)
!281 = !DILocation(line: 511, column: 14, scope: !27)
!282 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !27, file: !14, line: 511, type: !22)
!283 = !DILocation(line: 511, column: 26, scope: !27)
!284 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bots_t_start", scope: !27, file: !14, line: 513, type: !285)
!285 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!286 = !DILocation(line: 513, column: 8, scope: !27)
!287 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bots_t_end", scope: !27, file: !14, line: 514, type: !285)
!288 = !DILocation(line: 514, column: 8, scope: !27)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ri", scope: !27, file: !14, line: 516, type: !21)
!290 = !DILocation(line: 516, column: 7, scope: !27)
!291 = !DILocation(line: 518, column: 19, scope: !27)
!292 = !DILocation(line: 518, column: 25, scope: !27)
!293 = !DILocation(line: 518, column: 3, scope: !27)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "top", scope: !27, file: !14, line: 519, type: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "Village", file: !297, line: 61, size: 704, align: 64, elements: !298)
!297 = !DIFile(filename: "./health.h", directory: "/home/gleison/tf/Benchmarks/bots/serial/health")
!298 = !{!299, !300, !301, !302, !303, !317, !326, !327}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !296, file: !297, line: 62, baseType: !21, size: 32, align: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !296, file: !297, line: 63, baseType: !295, size: 64, align: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !296, file: !297, line: 64, baseType: !295, size: 64, align: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !296, file: !297, line: 65, baseType: !295, size: 64, align: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "population", scope: !296, file: !297, line: 66, baseType: !304, size: 64, align: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "Patient", file: !297, line: 42, size: 384, align: 64, elements: !306)
!306 = !{!307, !308, !311, !312, !313, !314, !315, !316}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !305, file: !297, line: 43, baseType: !21, size: 32, align: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !305, file: !297, line: 44, baseType: !309, size: 32, align: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !310, line: 196, baseType: !21)
!310 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/gleison/tf/Benchmarks/bots/serial/health")
!311 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !305, file: !297, line: 45, baseType: !21, size: 32, align: 32, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "time_left", scope: !305, file: !297, line: 46, baseType: !21, size: 32, align: 32, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "hosps_visited", scope: !305, file: !297, line: 47, baseType: !21, size: 32, align: 32, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "home_village", scope: !305, file: !297, line: 48, baseType: !295, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !305, file: !297, line: 49, baseType: !304, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !305, file: !297, line: 50, baseType: !304, size: 64, align: 64, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "hosp", scope: !296, file: !297, line: 67, baseType: !318, size: 320, align: 64, offset: 320)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "Hosp", file: !297, line: 52, size: 320, align: 64, elements: !319)
!319 = !{!320, !321, !322, !323, !324, !325}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "personnel", scope: !318, file: !297, line: 53, baseType: !21, size: 32, align: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "free_personnel", scope: !318, file: !297, line: 54, baseType: !21, size: 32, align: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !318, file: !297, line: 55, baseType: !304, size: 64, align: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "assess", scope: !318, file: !297, line: 56, baseType: !304, size: 64, align: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "inside", scope: !318, file: !297, line: 57, baseType: !304, size: 64, align: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !318, file: !297, line: 58, baseType: !304, size: 64, align: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !296, file: !297, line: 68, baseType: !21, size: 32, align: 32, offset: 640)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !296, file: !297, line: 69, baseType: !309, size: 32, align: 32, offset: 672)
!328 = !DILocation(line: 519, column: 3, scope: !27)
!329 = !DILocation(line: 520, column: 3, scope: !27)
!330 = !DILocation(line: 545, column: 11, scope: !331)
!331 = distinct !DILexicalBlock(scope: !27, file: !14, line: 545, column: 3)
!332 = !DILocation(line: 545, column: 8, scope: !331)
!333 = !DILocation(line: 545, column: 16, scope: !334)
!334 = !DILexicalBlockFile(scope: !335, file: !14, discriminator: 2)
!335 = !DILexicalBlockFile(scope: !336, file: !14, discriminator: 1)
!336 = distinct !DILexicalBlock(scope: !331, file: !14, line: 545, column: 3)
!337 = !DILocation(line: 545, column: 21, scope: !336)
!338 = !DILocation(line: 545, column: 19, scope: !336)
!339 = !DILocation(line: 545, column: 3, scope: !331)
!340 = !DILocation(line: 546, column: 5, scope: !341)
!341 = distinct !DILexicalBlock(scope: !336, file: !14, line: 545, column: 45)
!342 = !DILocation(line: 550, column: 20, scope: !341)
!343 = !DILocation(line: 550, column: 18, scope: !341)
!344 = !DILocation(line: 551, column: 5, scope: !341)
!345 = !DILocation(line: 552, column: 18, scope: !341)
!346 = !DILocation(line: 552, column: 16, scope: !341)
!347 = !DILocation(line: 553, column: 36, scope: !341)
!348 = !DILocation(line: 553, column: 49, scope: !341)
!349 = !DILocation(line: 553, column: 47, scope: !341)
!350 = !DILocation(line: 553, column: 27, scope: !341)
!351 = !DILocation(line: 553, column: 64, scope: !341)
!352 = !DILocation(line: 553, column: 23, scope: !341)
!353 = !DILocation(line: 556, column: 3, scope: !341)
!354 = !DILocation(line: 545, column: 39, scope: !336)
!355 = !DILocation(line: 545, column: 3, scope: !336)
!356 = !DILocation(line: 559, column: 7, scope: !357)
!357 = distinct !DILexicalBlock(scope: !27, file: !14, line: 559, column: 7)
!358 = !DILocation(line: 559, column: 7, scope: !27)
!359 = !DILocation(line: 560, column: 19, scope: !360)
!360 = distinct !DILexicalBlock(scope: !357, file: !14, line: 559, column: 24)
!361 = !DILocation(line: 560, column: 17, scope: !360)
!362 = !DILocation(line: 561, column: 3, scope: !360)
!363 = !DILocation(line: 566, column: 3, scope: !27)
!364 = !DILocation(line: 567, column: 3, scope: !27)
