; ModuleID = 'result.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.in_addr = type { i32 }
%struct.ptree = type { i64, %struct.ptree_mask*, i8, i8, %struct.ptree*, %struct.ptree* }
%struct.ptree_mask = type { i64, i8* }
%struct.MyNode = type { i32, double }

@.str = private unnamed_addr constant [24 x i8] c"Usage: %s <TCP stream>\0A\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [31 x i8] c"File %s doesn't seem to exist\0A\00", align 1
@.str.3 = private unnamed_addr constant [23 x i8] c"Allocating p-trie node\00", align 1
@.str.4 = private unnamed_addr constant [28 x i8] c"Allocating p-trie mask data\00", align 1
@.str.5 = private unnamed_addr constant [35 x i8] c"Allocating p-trie mask's node data\00", align 1
@.str.6 = private unnamed_addr constant [6 x i8] c"%f %d\00", align 1
@.str.7 = private unnamed_addr constant [10 x i8] c"%f %08x: \00", align 1
@.str.8 = private unnamed_addr constant [8 x i8] c"Found.\0A\00", align 1
@stderr = external global %struct._IO_FILE*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !33)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/MiBench/network-patricia")
!2 = !{}
!3 = !{!4, !5, !12, !23, !31}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptree", file: !7, line: 43, size: 320, align: 64, elements: !8)
!7 = !DIFile(filename: "./patricia.h", directory: "/home/gleison/tf/Benchmarks/MiBench/network-patricia")
!8 = !{!9, !11, !17, !19, !21, !22}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "p_key", scope: !6, file: !7, line: 44, baseType: !10, size: 64, align: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "p_m", scope: !6, file: !7, line: 45, baseType: !12, size: 64, align: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptree_mask", file: !7, line: 34, size: 128, align: 64, elements: !14)
!14 = !{!15, !16}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "pm_mask", scope: !13, file: !7, line: 35, baseType: !10, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "pm_data", scope: !13, file: !7, line: 36, baseType: !4, size: 64, align: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "p_mlen", scope: !6, file: !7, line: 46, baseType: !18, size: 8, align: 8, offset: 128)
!18 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "p_b", scope: !6, file: !7, line: 47, baseType: !20, size: 8, align: 8, offset: 136)
!20 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "p_left", scope: !6, file: !7, line: 48, baseType: !5, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "p_right", scope: !6, file: !7, line: 49, baseType: !5, size: 64, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "MyNode", file: !25, line: 51, size: 128, align: 64, elements: !26)
!25 = !DIFile(filename: "/home/gleison/tf/Benchmarks/MiBench/network-patricia/tmp.c", directory: "/home/gleison/tf/Benchmarks/MiBench/network-patricia")
!26 = !{!27, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "foo", scope: !24, file: !25, line: 52, baseType: !28, size: 32, align: 32)
!28 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "bar", scope: !24, file: !25, line: 53, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!33 = !{!34}
!34 = !DISubprogram(name: "main", scope: !25, file: !25, line: 56, type: !35, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !2)
!35 = !DISubroutineType(types: !36)
!36 = !{!28, !28, !37}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!39 = !{i32 2, !"Dwarf Version", i32 4}
!40 = !{i32 2, !"Debug Info Version", i32 3}
!41 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!42 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !34, file: !25, line: 56, type: !28)
!43 = !DIExpression()
!44 = !DILocation(line: 56, column: 14, scope: !34)
!45 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !34, file: !25, line: 56, type: !37)
!46 = !DILocation(line: 56, column: 27, scope: !34)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !34, file: !25, line: 61, type: !48)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1024, align: 8, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 128)
!51 = !DILocation(line: 61, column: 8, scope: !34)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "addr_str", scope: !34, file: !25, line: 62, type: !53)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, align: 8, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 16)
!56 = !DILocation(line: 62, column: 8, scope: !34)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "addr", scope: !34, file: !25, line: 63, type: !58)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !59, line: 31, size: 32, align: 32, elements: !60)
!59 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/gleison/tf/Benchmarks/MiBench/network-patricia")
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !58, file: !59, line: 33, baseType: !62, size: 32, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !59, line: 30, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !64, line: 51, baseType: !32)
!64 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/gleison/tf/Benchmarks/MiBench/network-patricia")
!65 = !DILocation(line: 63, column: 18, scope: !34)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mask", scope: !34, file: !25, line: 64, type: !10)
!67 = !DILocation(line: 64, column: 17, scope: !34)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "time", scope: !34, file: !25, line: 65, type: !69)
!69 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!70 = !DILocation(line: 65, column: 9, scope: !34)
!71 = !DILocation(line: 67, column: 12, scope: !72)
!72 = distinct !DILexicalBlock(scope: !34, file: !25, line: 67, column: 7)
!73 = !DILocation(line: 67, column: 7, scope: !34)
!74 = !DILocation(line: 68, column: 40, scope: !75)
!75 = distinct !DILexicalBlock(scope: !72, file: !25, line: 67, column: 17)
!76 = !DILocation(line: 68, column: 5, scope: !75)
!77 = !DILocation(line: 69, column: 5, scope: !75)
!78 = !DILocation(line: 76, column: 19, scope: !79)
!79 = distinct !DILexicalBlock(scope: !34, file: !25, line: 76, column: 7)
!80 = !DILocation(line: 76, column: 13, scope: !79)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !34, file: !25, line: 60, type: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !84, line: 48, baseType: !85)
!84 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/tf/Benchmarks/MiBench/network-patricia")
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !86, line: 241, size: 1728, align: 64, elements: !87)
!86 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/tf/Benchmarks/MiBench/network-patricia")
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !108, !109, !110, !111, !115, !117, !119, !123, !126, !128, !129, !130, !131, !132, !135, !136}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !85, file: !86, line: 242, baseType: !28, size: 32, align: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !85, file: !86, line: 247, baseType: !38, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !85, file: !86, line: 248, baseType: !38, size: 64, align: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !85, file: !86, line: 249, baseType: !38, size: 64, align: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !85, file: !86, line: 250, baseType: !38, size: 64, align: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !85, file: !86, line: 251, baseType: !38, size: 64, align: 64, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !85, file: !86, line: 252, baseType: !38, size: 64, align: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !85, file: !86, line: 253, baseType: !38, size: 64, align: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !85, file: !86, line: 254, baseType: !38, size: 64, align: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !85, file: !86, line: 256, baseType: !38, size: 64, align: 64, offset: 576)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !85, file: !86, line: 257, baseType: !38, size: 64, align: 64, offset: 640)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !85, file: !86, line: 258, baseType: !38, size: 64, align: 64, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !85, file: !86, line: 260, baseType: !101, size: 64, align: 64, offset: 768)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !86, line: 156, size: 192, align: 64, elements: !103)
!103 = !{!104, !105, !107}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !102, file: !86, line: 157, baseType: !101, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !102, file: !86, line: 158, baseType: !106, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !102, file: !86, line: 162, baseType: !28, size: 32, align: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !85, file: !86, line: 262, baseType: !106, size: 64, align: 64, offset: 832)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !85, file: !86, line: 264, baseType: !28, size: 32, align: 32, offset: 896)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !85, file: !86, line: 268, baseType: !28, size: 32, align: 32, offset: 928)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !85, file: !86, line: 270, baseType: !112, size: 64, align: 64, offset: 960)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !113, line: 131, baseType: !114)
!113 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/tf/Benchmarks/MiBench/network-patricia")
!114 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !85, file: !86, line: 274, baseType: !116, size: 16, align: 16, offset: 1024)
!116 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !85, file: !86, line: 275, baseType: !118, size: 8, align: 8, offset: 1040)
!118 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !85, file: !86, line: 276, baseType: !120, size: 8, align: 8, offset: 1048)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, align: 8, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 1)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !85, file: !86, line: 280, baseType: !124, size: 64, align: 64, offset: 1088)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !86, line: 150, baseType: null)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !85, file: !86, line: 289, baseType: !127, size: 64, align: 64, offset: 1152)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !113, line: 132, baseType: !114)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !85, file: !86, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !85, file: !86, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !85, file: !86, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !85, file: !86, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !85, file: !86, line: 302, baseType: !133, size: 64, align: 64, offset: 1472)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !134, line: 62, baseType: !10)
!134 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/tf/Benchmarks/MiBench/network-patricia")
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !85, file: !86, line: 303, baseType: !28, size: 32, align: 32, offset: 1536)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !85, file: !86, line: 305, baseType: !137, size: 160, align: 8, offset: 1568)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 160, align: 8, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 20)
!140 = !DILocation(line: 60, column: 9, scope: !34)
!141 = !DILocation(line: 76, column: 34, scope: !79)
!142 = !DILocation(line: 76, column: 7, scope: !34)
!143 = !DILocation(line: 77, column: 47, scope: !144)
!144 = distinct !DILexicalBlock(scope: !79, file: !25, line: 76, column: 43)
!145 = !DILocation(line: 77, column: 5, scope: !144)
!146 = !DILocation(line: 78, column: 5, scope: !144)
!147 = !DILocation(line: 91, column: 27, scope: !34)
!148 = !DILocation(line: 91, column: 11, scope: !34)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "phead", scope: !34, file: !25, line: 57, type: !5)
!150 = !DILocation(line: 57, column: 17, scope: !34)
!151 = !DILocation(line: 92, column: 8, scope: !152)
!152 = distinct !DILexicalBlock(scope: !34, file: !25, line: 92, column: 7)
!153 = !DILocation(line: 92, column: 7, scope: !34)
!154 = !DILocation(line: 93, column: 5, scope: !155)
!155 = distinct !DILexicalBlock(scope: !152, file: !25, line: 92, column: 15)
!156 = !DILocation(line: 94, column: 5, scope: !155)
!157 = !DILocation(line: 96, column: 3, scope: !34)
!158 = !DILocation(line: 97, column: 37, scope: !34)
!159 = !DILocation(line: 97, column: 16, scope: !34)
!160 = !DILocation(line: 97, column: 10, scope: !34)
!161 = !DILocation(line: 97, column: 14, scope: !34)
!162 = !DILocation(line: 99, column: 15, scope: !163)
!163 = distinct !DILexicalBlock(scope: !34, file: !25, line: 99, column: 7)
!164 = !DILocation(line: 99, column: 8, scope: !163)
!165 = !DILocation(line: 99, column: 7, scope: !34)
!166 = !DILocation(line: 100, column: 5, scope: !167)
!167 = distinct !DILexicalBlock(scope: !163, file: !25, line: 99, column: 20)
!168 = !DILocation(line: 101, column: 5, scope: !167)
!169 = !DILocation(line: 103, column: 16, scope: !34)
!170 = !DILocation(line: 103, column: 3, scope: !34)
!171 = !DILocation(line: 104, column: 15, scope: !34)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pm", scope: !34, file: !25, line: 59, type: !12)
!173 = !DILocation(line: 59, column: 22, scope: !34)
!174 = !DILocation(line: 105, column: 34, scope: !34)
!175 = !DILocation(line: 105, column: 17, scope: !34)
!176 = !DILocation(line: 105, column: 7, scope: !34)
!177 = !DILocation(line: 105, column: 15, scope: !34)
!178 = !DILocation(line: 106, column: 12, scope: !179)
!179 = distinct !DILexicalBlock(scope: !34, file: !25, line: 106, column: 7)
!180 = !DILocation(line: 106, column: 8, scope: !179)
!181 = !DILocation(line: 106, column: 7, scope: !34)
!182 = !DILocation(line: 107, column: 5, scope: !183)
!183 = distinct !DILexicalBlock(scope: !179, file: !25, line: 106, column: 21)
!184 = !DILocation(line: 108, column: 5, scope: !183)
!185 = !DILocation(line: 110, column: 13, scope: !34)
!186 = !DILocation(line: 110, column: 3, scope: !34)
!187 = !DILocation(line: 116, column: 10, scope: !34)
!188 = !DILocation(line: 116, column: 17, scope: !34)
!189 = !DILocation(line: 117, column: 26, scope: !34)
!190 = !DILocation(line: 117, column: 34, scope: !34)
!191 = !DILocation(line: 117, column: 10, scope: !34)
!192 = !DILocation(line: 117, column: 17, scope: !34)
!193 = !DILocation(line: 122, column: 3, scope: !34)
!194 = !DILocation(line: 122, column: 16, scope: !195)
!195 = !DILexicalBlockFile(scope: !196, file: !25, discriminator: 2)
!196 = !DILexicalBlockFile(scope: !34, file: !25, discriminator: 1)
!197 = !DILocation(line: 122, column: 10, scope: !34)
!198 = !DILocation(line: 127, column: 12, scope: !199)
!199 = distinct !DILexicalBlock(scope: !34, file: !25, line: 122, column: 32)
!200 = !DILocation(line: 127, column: 34, scope: !199)
!201 = !DILocation(line: 127, column: 5, scope: !199)
!202 = !DILocation(line: 133, column: 25, scope: !199)
