; ModuleID = '/home/gleison/tf/Benchmarks/MiBench/network-patricia/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.ptree = type { i64, %struct.ptree_mask*, i8, i8, %struct.ptree*, %struct.ptree* }
%struct.ptree_mask = type { i64, i8* }
%struct.in_addr = type { i32 }
%struct.MyNode = type { i32, double }

@.str = private unnamed_addr constant [24 x i8] c"Usage: %s <TCP stream>\0A\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [31 x i8] c"File %s doesn't seem to exist\0A\00", align 1
@.str.3 = private unnamed_addr constant [23 x i8] c"Allocating p-trie node\00", align 1
@.str.4 = private unnamed_addr constant [28 x i8] c"Allocating p-trie mask data\00", align 1
@.str.5 = private unnamed_addr constant [35 x i8] c"Allocating p-trie mask's node data\00", align 1
@.str.6 = private unnamed_addr constant [6 x i8] c"%f %d\00", align 1
@.str.7 = private unnamed_addr constant [10 x i8] c"%f %08x: \00", align 1
@.str.8 = private unnamed_addr constant [8 x i8] c"Found.\0A\00", align 1
@stderr = external global %struct._IO_FILE*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !33)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/MiBench/network-patricia")
!2 = !{}
!3 = !{!4, !5, !12, !23, !31}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptree", file: !7, line: 43, size: 320, align: 64, elements: !8)
!7 = !DIFile(filename: "./patricia.h", directory: "/home/gleison/tf/Benchmarks/MiBench/network-patricia")
!8 = !{!9, !11, !17, !19, !21, !22}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "p_key", scope: !6, file: !7, line: 44, baseType: !10, size: 64, align: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "p_m", scope: !6, file: !7, line: 45, baseType: !12, size: 64, align: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptree_mask", file: !7, line: 34, size: 128, align: 64, elements: !14)
!14 = !{!15, !16}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "pm_mask", scope: !13, file: !7, line: 35, baseType: !10, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "pm_data", scope: !13, file: !7, line: 36, baseType: !4, size: 64, align: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "p_mlen", scope: !6, file: !7, line: 46, baseType: !18, size: 8, align: 8, offset: 128)
!18 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "p_b", scope: !6, file: !7, line: 47, baseType: !20, size: 8, align: 8, offset: 136)
!20 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "p_left", scope: !6, file: !7, line: 48, baseType: !5, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "p_right", scope: !6, file: !7, line: 49, baseType: !5, size: 64, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "MyNode", file: !25, line: 51, size: 128, align: 64, elements: !26)
!25 = !DIFile(filename: "/home/gleison/tf/Benchmarks/MiBench/network-patricia/tmp.c", directory: "/home/gleison/tf/Benchmarks/MiBench/network-patricia")
!26 = !{!27, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "foo", scope: !24, file: !25, line: 52, baseType: !28, size: 32, align: 32)
!28 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "bar", scope: !24, file: !25, line: 53, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!33 = !{!34}
!34 = !DISubprogram(name: "main", scope: !25, file: !25, line: 56, type: !35, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !2)
!35 = !DISubroutineType(types: !36)
!36 = !{!28, !28, !37}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!39 = !{i32 2, !"Dwarf Version", i32 4}
!40 = !{i32 2, !"Debug Info Version", i32 3}
!41 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!42 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !34, file: !25, line: 56, type: !28)
!43 = !DIExpression()
!44 = !DILocation(line: 56, column: 14, scope: !34)
!45 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !34, file: !25, line: 56, type: !37)
!46 = !DILocation(line: 56, column: 27, scope: !34)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "phead", scope: !34, file: !25, line: 57, type: !5)
!48 = !DILocation(line: 57, column: 17, scope: !34)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !34, file: !25, line: 58, type: !5)
!50 = !DILocation(line: 58, column: 17, scope: !34)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pfind", scope: !34, file: !25, line: 58, type: !5)
!52 = !DILocation(line: 58, column: 21, scope: !34)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pm", scope: !34, file: !25, line: 59, type: !12)
!54 = !DILocation(line: 59, column: 22, scope: !34)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !34, file: !25, line: 60, type: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !58, line: 48, baseType: !59)
!58 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/tf/Benchmarks/MiBench/network-patricia")
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 241, size: 1728, align: 64, elements: !61)
!60 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/tf/Benchmarks/MiBench/network-patricia")
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !82, !83, !84, !85, !89, !91, !93, !97, !100, !102, !103, !104, !105, !106, !109, !110}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !59, file: !60, line: 242, baseType: !28, size: 32, align: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !59, file: !60, line: 247, baseType: !38, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !59, file: !60, line: 248, baseType: !38, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !59, file: !60, line: 249, baseType: !38, size: 64, align: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !59, file: !60, line: 250, baseType: !38, size: 64, align: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !59, file: !60, line: 251, baseType: !38, size: 64, align: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !59, file: !60, line: 252, baseType: !38, size: 64, align: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !59, file: !60, line: 253, baseType: !38, size: 64, align: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !59, file: !60, line: 254, baseType: !38, size: 64, align: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !59, file: !60, line: 256, baseType: !38, size: 64, align: 64, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !59, file: !60, line: 257, baseType: !38, size: 64, align: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !59, file: !60, line: 258, baseType: !38, size: 64, align: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !59, file: !60, line: 260, baseType: !75, size: 64, align: 64, offset: 768)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !60, line: 156, size: 192, align: 64, elements: !77)
!77 = !{!78, !79, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !76, file: !60, line: 157, baseType: !75, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !76, file: !60, line: 158, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !76, file: !60, line: 162, baseType: !28, size: 32, align: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !59, file: !60, line: 262, baseType: !80, size: 64, align: 64, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !59, file: !60, line: 264, baseType: !28, size: 32, align: 32, offset: 896)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !59, file: !60, line: 268, baseType: !28, size: 32, align: 32, offset: 928)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !59, file: !60, line: 270, baseType: !86, size: 64, align: 64, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !87, line: 131, baseType: !88)
!87 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/tf/Benchmarks/MiBench/network-patricia")
!88 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !59, file: !60, line: 274, baseType: !90, size: 16, align: 16, offset: 1024)
!90 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !59, file: !60, line: 275, baseType: !92, size: 8, align: 8, offset: 1040)
!92 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !59, file: !60, line: 276, baseType: !94, size: 8, align: 8, offset: 1048)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, align: 8, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 1)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !59, file: !60, line: 280, baseType: !98, size: 64, align: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !60, line: 150, baseType: null)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !59, file: !60, line: 289, baseType: !101, size: 64, align: 64, offset: 1152)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !87, line: 132, baseType: !88)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !59, file: !60, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !59, file: !60, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !59, file: !60, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !59, file: !60, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !59, file: !60, line: 302, baseType: !107, size: 64, align: 64, offset: 1472)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 62, baseType: !10)
!108 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/tf/Benchmarks/MiBench/network-patricia")
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !59, file: !60, line: 303, baseType: !28, size: 32, align: 32, offset: 1536)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !59, file: !60, line: 305, baseType: !111, size: 160, align: 8, offset: 1568)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 160, align: 8, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 20)
!114 = !DILocation(line: 60, column: 9, scope: !34)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !34, file: !25, line: 61, type: !116)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1024, align: 8, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 128)
!119 = !DILocation(line: 61, column: 8, scope: !34)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "addr_str", scope: !34, file: !25, line: 62, type: !121)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, align: 8, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 16)
!124 = !DILocation(line: 62, column: 8, scope: !34)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "addr", scope: !34, file: !25, line: 63, type: !126)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !127, line: 31, size: 32, align: 32, elements: !128)
!127 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/gleison/tf/Benchmarks/MiBench/network-patricia")
!128 = !{!129}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !126, file: !127, line: 33, baseType: !130, size: 32, align: 32)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !127, line: 30, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !132, line: 51, baseType: !32)
!132 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/gleison/tf/Benchmarks/MiBench/network-patricia")
!133 = !DILocation(line: 63, column: 18, scope: !34)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mask", scope: !34, file: !25, line: 64, type: !10)
!135 = !DILocation(line: 64, column: 17, scope: !34)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "time", scope: !34, file: !25, line: 65, type: !137)
!137 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!138 = !DILocation(line: 65, column: 9, scope: !34)
!139 = !DILocation(line: 67, column: 7, scope: !140)
!140 = distinct !DILexicalBlock(scope: !34, file: !25, line: 67, column: 7)
!141 = !DILocation(line: 67, column: 12, scope: !140)
!142 = !DILocation(line: 67, column: 7, scope: !34)
!143 = !DILocation(line: 68, column: 40, scope: !144)
!144 = distinct !DILexicalBlock(scope: !140, file: !25, line: 67, column: 17)
!145 = !DILocation(line: 68, column: 5, scope: !144)
!146 = !DILocation(line: 69, column: 5, scope: !144)
!147 = !DILocation(line: 76, column: 19, scope: !148)
!148 = distinct !DILexicalBlock(scope: !34, file: !25, line: 76, column: 7)
!149 = !DILocation(line: 76, column: 13, scope: !148)
!150 = !DILocation(line: 76, column: 11, scope: !148)
!151 = !DILocation(line: 76, column: 34, scope: !148)
!152 = !DILocation(line: 76, column: 7, scope: !34)
!153 = !DILocation(line: 77, column: 47, scope: !154)
!154 = distinct !DILexicalBlock(scope: !148, file: !25, line: 76, column: 43)
!155 = !DILocation(line: 77, column: 5, scope: !154)
!156 = !DILocation(line: 78, column: 5, scope: !154)
!157 = !DILocation(line: 91, column: 27, scope: !34)
!158 = !DILocation(line: 91, column: 11, scope: !34)
!159 = !DILocation(line: 91, column: 9, scope: !34)
!160 = !DILocation(line: 92, column: 8, scope: !161)
!161 = distinct !DILexicalBlock(scope: !34, file: !25, line: 92, column: 7)
!162 = !DILocation(line: 92, column: 7, scope: !34)
!163 = !DILocation(line: 93, column: 5, scope: !164)
!164 = distinct !DILexicalBlock(scope: !161, file: !25, line: 92, column: 15)
!165 = !DILocation(line: 94, column: 5, scope: !164)
!166 = !DILocation(line: 96, column: 9, scope: !34)
!167 = !DILocation(line: 96, column: 3, scope: !34)
!168 = !DILocation(line: 97, column: 37, scope: !34)
!169 = !DILocation(line: 97, column: 16, scope: !34)
