; ModuleID = '/home/gleison/tf/Benchmarks/TSVC/CrossingThresholds-flt/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GlobalData = type { [32000 x float], [3 x i32], [4 x i8], [32000 x float], [5 x i32], [12 x i8], [32000 x float], [7 x i32], [4 x i8], [32000 x float], [11 x i32], [4 x i8], [32000 x float], [13 x i32], [12 x i8], [256 x [256 x float]], [17 x i32], [12 x i8], [256 x [256 x float]], [19 x i32], [4 x i8], [256 x [256 x float]], [23 x i32], [4 x i8], [256 x [256 x float]] }

@global_data = common global %struct.GlobalData zeroinitializer, align 16
@a = constant float* getelementptr inbounds (%struct.GlobalData, %struct.GlobalData* @global_data, i32 0, i32 0, i32 0), align 16
@b = constant float* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 128016) to float*), align 16
@c = constant float* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 256048) to float*), align 16
@d = constant float* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 384080) to float*), align 16
@e = constant float* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 512128) to float*), align 16
@aa = constant [256 x float]* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 640192) to [256 x float]*), align 16

!39 = !DISubprogram(name: "s1281", scope: !10, file: !10, line: 3264, type: !37, isLocal: false, isDefinition: true, scopeLine: 3265, isOptimized: false, function: i32 ()* @s1281, variables: !2)
!40 = !DISubprogram(name: "s291", scope: !10, file: !10, line: 3295, type: !37, isLocal: false, isDefinition: true, scopeLine: 3296, isOptimized: false, function: i32 ()* @s291, variables: !2)
!41 = !DISubprogram(name: "s292", scope: !10, file: !10, line: 3325, type: !37, isLocal: false, isDefinition: true, scopeLine: 3326, isOptimized: false, function: i32 ()* @s292, variables: !2)
!42 = !DISubprogram(name: "s293", scope: !10, file: !10, line: 3358, type: !37, isLocal: false, isDefinition: true, scopeLine: 3359, isOptimized: false, function: i32 ()* @s293, variables: !2)
!43 = !DISubprogram(name: "s2101", scope: !10, file: !10, line: 3384, type: !37, isLocal: false, isDefinition: true, scopeLine: 3385, isOptimized: false, function: i32 ()* @s2101, variables: !2)
!44 = !DISubprogram(name: "s2102", scope: !10, file: !10, line: 3412, type: !37, isLocal: false, isDefinition: true, scopeLine: 3413, isOptimized: false, function: i32 ()* @s2102, variables: !2)
!45 = !DISubprogram(name: "s2111", scope: !10, file: !10, line: 3442, type: !37, isLocal: false, isDefinition: true, scopeLine: 3443, isOptimized: false, function: i32 ()* @s2111, variables: !2)
!46 = !DISubprogram(name: "min", scope: !10, file: !10, line: 4916, type: !47, isLocal: false, isDefinition: true, scopeLine: 4916, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i32)* @min, variables: !2)
!47 = !DISubroutineType(types: !48)
!48 = !{!13, !13, !13}
!49 = !DISubprogram(name: "set", scope: !10, file: !10, line: 5543, type: !50, isLocal: false, isDefinition: true, scopeLine: 5543, flags: DIFlagPrototyped, isOptimized: false, function: void (i32*, float*, float*)* @set, variables: !2)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !52, !14, !14}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!53 = !DISubprogram(name: "main", scope: !10, file: !10, line: 5572, type: !54, isLocal: false, isDefinition: true, scopeLine: 5572, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !2)
!54 = !DISubroutineType(types: !55)
!55 = !{!13, !13, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!57 = !{!58, !60, !61, !62, !63, !64, !66, !67, !68, !69, !73, !74, !75, !76, !77, !81, !82, !83, !84, !130, !132, !134, !135, !136}
!58 = !DIGlobalVariable(name: "a", scope: !0, file: !10, line: 100, type: !59, isLocal: false, isDefinition: true, variable: float** @a)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!60 = !DIGlobalVariable(name: "b", scope: !0, file: !10, line: 101, type: !59, isLocal: false, isDefinition: true, variable: float** @b)
!61 = !DIGlobalVariable(name: "c", scope: !0, file: !10, line: 102, type: !59, isLocal: false, isDefinition: true, variable: float** @c)
!62 = !DIGlobalVariable(name: "d", scope: !0, file: !10, line: 103, type: !59, isLocal: false, isDefinition: true, variable: float** @d)
!63 = !DIGlobalVariable(name: "e", scope: !0, file: !10, line: 104, type: !59, isLocal: false, isDefinition: true, variable: float** @e)
!64 = !DIGlobalVariable(name: "aa", scope: !0, file: !10, line: 105, type: !65, isLocal: false, isDefinition: true, variable: [256 x float]** @aa)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!66 = !DIGlobalVariable(name: "bb", scope: !0, file: !10, line: 106, type: !65, isLocal: false, isDefinition: true, variable: [256 x float]** @bb)
!67 = !DIGlobalVariable(name: "cc", scope: !0, file: !10, line: 107, type: !65, isLocal: false, isDefinition: true, variable: [256 x float]** @cc)
!68 = !DIGlobalVariable(name: "tt", scope: !0, file: !10, line: 108, type: !65, isLocal: false, isDefinition: true, variable: [256 x float]** @tt)
!69 = !DIGlobalVariable(name: "X", scope: !0, file: !10, line: 59, type: !70, isLocal: false, isDefinition: true, variable: [32000 x float]* @X)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024000, align: 32, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 32000)
!73 = !DIGlobalVariable(name: "Y", scope: !0, file: !10, line: 59, type: !70, isLocal: false, isDefinition: true, variable: [32000 x float]* @Y)
!74 = !DIGlobalVariable(name: "Z", scope: !0, file: !10, line: 59, type: !70, isLocal: false, isDefinition: true, variable: [32000 x float]* @Z)
!75 = !DIGlobalVariable(name: "U", scope: !0, file: !10, line: 59, type: !70, isLocal: false, isDefinition: true, variable: [32000 x float]* @U)
!76 = !DIGlobalVariable(name: "V", scope: !0, file: !10, line: 59, type: !70, isLocal: false, isDefinition: true, variable: [32000 x float]* @V)
!77 = !DIGlobalVariable(name: "array", scope: !0, file: !10, line: 63, type: !78, isLocal: false, isDefinition: true, variable: [65536 x float]* @array)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2097152, align: 32, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 65536)
!81 = !DIGlobalVariable(name: "x", scope: !0, file: !10, line: 65, type: !70, isLocal: false, isDefinition: true, variable: [32000 x float]* @x)
!82 = !DIGlobalVariable(name: "temp", scope: !0, file: !10, line: 66, type: !4, isLocal: false, isDefinition: true, variable: float* @temp)
!83 = !DIGlobalVariable(name: "temp_int", scope: !0, file: !10, line: 67, type: !13, isLocal: false, isDefinition: true, variable: i32* @temp_int)
!84 = !DIGlobalVariable(name: "global_data", scope: !0, file: !10, line: 98, type: !85, isLocal: false, isDefinition: true, variable: %struct.GlobalData* @global_data)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalData", file: !10, line: 79, size: 13512192, align: 128, elements: !86)
!86 = !{!87, !88, !92, !93, !97, !98, !102, !103, !107, !108, !112, !115, !119, !120, !124, !125, !129}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !85, file: !10, line: 80, baseType: !70, size: 1024000, align: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !85, file: !10, line: 81, baseType: !89, size: 96, align: 32, offset: 1024000)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 96, align: 32, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 3)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !85, file: !10, line: 82, baseType: !70, size: 1024000, align: 32, offset: 1024128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !85, file: !10, line: 83, baseType: !94, size: 160, align: 32, offset: 2048128)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 160, align: 32, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 5)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !85, file: !10, line: 84, baseType: !70, size: 1024000, align: 32, offset: 2048384)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !85, file: !10, line: 85, baseType: !99, size: 224, align: 32, offset: 3072384)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 224, align: 32, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 7)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !85, file: !10, line: 86, baseType: !70, size: 1024000, align: 32, offset: 3072640)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !85, file: !10, line: 87, baseType: !104, size: 352, align: 32, offset: 4096640)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 352, align: 32, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 11)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !85, file: !10, line: 88, baseType: !70, size: 1024000, align: 32, offset: 4097024)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !85, file: !10, line: 90, baseType: !109, size: 416, align: 32, offset: 5121024)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 416, align: 32, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 13)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !85, file: !10, line: 91, baseType: !113, size: 2097152, align: 32, offset: 5121536)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2097152, align: 32, elements: !114)
!114 = !{!24, !24}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "pad6", scope: !85, file: !10, line: 92, baseType: !116, size: 544, align: 32, offset: 7218688)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 544, align: 32, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 17)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !85, file: !10, line: 93, baseType: !113, size: 2097152, align: 32, offset: 7219328)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "pad7", scope: !85, file: !10, line: 94, baseType: !121, size: 608, align: 32, offset: 9316480)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 608, align: 32, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 19)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "cc", scope: !85, file: !10, line: 95, baseType: !113, size: 2097152, align: 32, offset: 9317120)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pad8", scope: !85, file: !10, line: 96, baseType: !126, size: 736, align: 32, offset: 11414272)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 736, align: 32, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 23)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !85, file: !10, line: 97, baseType: !113, size: 2097152, align: 32, offset: 11415040)
!130 = !DIGlobalVariable(name: "indx", scope: !0, file: !10, line: 110, type: !131, isLocal: false, isDefinition: true, variable: [32000 x i32]* @indx)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 1024000, align: 32, elements: !71)
!132 = !DIGlobalVariable(name: "xx", scope: !0, file: !10, line: 113, type: !133, isLocal: false, isDefinition: true, variable: float** @xx)
!133 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !14)
!134 = !DIGlobalVariable(name: "yy", scope: !0, file: !10, line: 114, type: !14, isLocal: false, isDefinition: true, variable: float** @yy)
!135 = !DIGlobalVariable(name: "digits", scope: !0, file: !10, line: 40, type: !13, isLocal: true, isDefinition: true, variable: i32* @digits)
!136 = !DIGlobalVariable(name: "ntimes", scope: !0, file: !10, line: 39, type: !13, isLocal: true, isDefinition: true, variable: i32* @ntimes)
!137 = !{i32 2, !"Dwarf Version", i32 4}
!138 = !{i32 2, !"Debug Info Version", i32 3}
!139 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arr", arg: 1, scope: !9, file: !10, line: 120, type: !14)
!141 = !DIExpression()
!142 = !DILocation(line: 120, column: 16, scope: !9)
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !9, file: !10, line: 120, type: !4)
!144 = !DILocation(line: 120, column: 31, scope: !9)
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stride", arg: 3, scope: !9, file: !10, line: 120, type: !13)
!146 = !DILocation(line: 120, column: 42, scope: !9)
!147 = !DILocation(line: 122, column: 6, scope: !148)
!148 = distinct !DILexicalBlock(scope: !9, file: !10, line: 122, column: 6)
!149 = !DILocation(line: 122, column: 13, scope: !148)
!150 = !DILocation(line: 122, column: 6, scope: !9)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !152, file: !10, line: 123, type: !13)
!152 = distinct !DILexicalBlock(scope: !153, file: !10, line: 123, column: 3)
!153 = distinct !DILexicalBlock(scope: !148, file: !10, line: 122, column: 20)
!154 = !DILocation(line: 123, column: 12, scope: !152)
!155 = !DILocation(line: 123, column: 8, scope: !152)
!156 = !DILocation(line: 123, column: 19, scope: !157)
!157 = !DILexicalBlockFile(scope: !158, file: !10, discriminator: 2)
!158 = !DILexicalBlockFile(scope: !159, file: !10, discriminator: 1)
!159 = distinct !DILexicalBlock(scope: !152, file: !10, line: 123, column: 3)
!160 = !DILocation(line: 123, column: 21, scope: !159)
!161 = !DILocation(line: 123, column: 3, scope: !152)
!162 = !DILocation(line: 124, column: 26, scope: !163)
!163 = distinct !DILexicalBlock(scope: !159, file: !10, line: 123, column: 33)
!164 = !DILocation(line: 124, column: 27, scope: !163)
!165 = !DILocation(line: 124, column: 18, scope: !163)
!166 = !DILocation(line: 124, column: 16, scope: !163)
!167 = !DILocation(line: 124, column: 13, scope: !163)
!168 = !DILocation(line: 124, column: 8, scope: !163)
!169 = !DILocation(line: 124, column: 4, scope: !163)
!170 = !DILocation(line: 124, column: 11, scope: !163)
!171 = !DILocation(line: 125, column: 3, scope: !163)
!172 = !DILocation(line: 123, column: 29, scope: !159)
!173 = !DILocation(line: 123, column: 3, scope: !159)
!174 = !DILocation(line: 126, column: 2, scope: !153)
!175 = !DILocation(line: 126, column: 13, scope: !176)
!176 = distinct !DILexicalBlock(scope: !148, file: !10, line: 126, column: 13)
!177 = !DILocation(line: 126, column: 20, scope: !176)
!178 = !DILocation(line: 126, column: 13, scope: !148)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !180, file: !10, line: 127, type: !13)
!180 = distinct !DILexicalBlock(scope: !181, file: !10, line: 127, column: 3)
!181 = distinct !DILexicalBlock(scope: !176, file: !10, line: 126, column: 27)
!182 = !DILocation(line: 127, column: 12, scope: !180)
