; ModuleID = 'result.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Table = type { float*, float, float, i32 }
%struct.Input = type { i32, i32, i32, i32, i32, float, float, i32, i32, i32, i8, i32, i64, float, float, float, float, i64, i64, i32, i64, i32, i32, i64, i64, i8, i8*, i64 }

; Function Attrs: nounwind uwtable
define float @urand() #0 {
entry:
  %call = call i32 @glibc_compat_rand(), !dbg !84
  %conv = sitofp i32 %call to float, !dbg !85
  %div = fdiv float %conv, 0x41E0000000000000, !dbg !86
  ret float %div, !dbg !87
}

declare i32 @glibc_compat_rand() #1

; Function Attrs: nounwind uwtable
define float @nrand(float %mean, float %sigma) #0 {
entry:
  call void @llvm.dbg.value(metadata float %mean, i64 0, metadata !88, metadata !89), !dbg !90
  call void @llvm.dbg.value(metadata float %sigma, i64 0, metadata !91, metadata !89), !dbg !92
  %call = call float @urand(), !dbg !93
  call void @llvm.dbg.value(metadata float %call, i64 0, metadata !94, metadata !89), !dbg !95
  %call1 = call float @urand(), !dbg !96
  call void @llvm.dbg.value(metadata float %call1, i64 0, metadata !97, metadata !89), !dbg !98
  %conv = fpext float %call to double, !dbg !99
  %call2 = call double @log(double %conv) #4, !dbg !100
  %mul = fmul double -2.000000e+00, %call2, !dbg !101
  %call3 = call double @sqrt(double %mul) #4, !dbg !102
  %conv4 = fpext float %call1 to double, !dbg !103

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !12)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/SimpleMOC")
!2 = !{}
!3 = !{!4, !5, !6, !7}
!4 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_t", file: !8, line: 59, baseType: !9)
!8 = !DIFile(filename: "/usr/include/time.h", directory: "/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/SimpleMOC")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !10, line: 135, baseType: !11)
!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/SimpleMOC")
!11 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!12 = !{!13, !17, !20, !24, !35, !38, !78}
!13 = !DISubprogram(name: "urand", scope: !14, file: !14, line: 4, type: !15, isLocal: false, isDefinition: true, scopeLine: 4, flags: DIFlagPrototyped, isOptimized: false, function: float ()* @urand, variables: !2)
!14 = !DIFile(filename: "/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/SimpleMOC/tmp.c", directory: "/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/SimpleMOC")
!15 = !DISubroutineType(types: !16)
!16 = !{!4}
!17 = !DISubprogram(name: "nrand", scope: !14, file: !14, line: 10, type: !18, isLocal: false, isDefinition: true, scopeLine: 10, flags: DIFlagPrototyped, isOptimized: false, function: float (float, float)* @nrand, variables: !2)
!18 = !DISubroutineType(types: !19)
!19 = !{!4, !4, !4}
!20 = !DISubprogram(name: "pairwise_sum", scope: !14, file: !14, line: 27, type: !21, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false, function: float (float*, i64)* @pairwise_sum, variables: !2)
!21 = !DISubroutineType(types: !22)
!22 = !{!4, !23, !11}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!24 = !DISubprogram(name: "buildExponentialTable", scope: !14, file: !14, line: 45, type: !25, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Table*, float, float)* @buildExponentialTable, variables: !2)
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !4, !4}
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "Table", file: !28, line: 136, baseType: !29)
!28 = !DIFile(filename: "./SimpleMOC_header.h", directory: "/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/SimpleMOC")
!29 = !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 131, size: 192, align: 64, elements: !30)
!30 = !{!31, !32, !33, !34}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !29, file: !28, line: 132, baseType: !23, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !29, file: !28, line: 133, baseType: !4, size: 32, align: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "maxVal", scope: !29, file: !28, line: 134, baseType: !4, size: 32, align: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !29, file: !28, line: 135, baseType: !5, size: 32, align: 32, offset: 128)
!35 = !DISubprogram(name: "get_time", scope: !14, file: !14, line: 76, type: !36, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false, function: double ()* @get_time, variables: !2)
!36 = !DISubroutineType(types: !37)
!37 = !{!6}
!38 = !DISubprogram(name: "est_mem_usage", scope: !14, file: !14, line: 92, type: !39, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false, function: i64 (%struct.Input*)* @est_mem_usage, variables: !2)
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !44}
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !42, line: 62, baseType: !43)
!42 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/tf/Benchmarks/DOE_ProxyApps_C/SimpleMOC")
!43 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "Input", file: !28, line: 84, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 36, size: 1216, align: 64, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !77}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "x_assemblies", scope: !45, file: !28, line: 37, baseType: !5, size: 32, align: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "y_assemblies", scope: !45, file: !28, line: 39, baseType: !5, size: 32, align: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "cai", scope: !45, file: !28, line: 41, baseType: !5, size: 32, align: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "fai", scope: !45, file: !28, line: 42, baseType: !5, size: 32, align: 32, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "axial_exp", scope: !45, file: !28, line: 44, baseType: !5, size: 32, align: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "radial_ray_sep", scope: !45, file: !28, line: 45, baseType: !4, size: 32, align: 32, offset: 160)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "axial_z_sep", scope: !45, file: !28, line: 46, baseType: !4, size: 32, align: 32, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "n_azimuthal", scope: !45, file: !28, line: 47, baseType: !5, size: 32, align: 32, offset: 224)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "n_polar_angles", scope: !45, file: !28, line: 48, baseType: !5, size: 32, align: 32, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "n_egroups", scope: !45, file: !28, line: 49, baseType: !5, size: 32, align: 32, offset: 288)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "decompose", scope: !45, file: !28, line: 50, baseType: !58, size: 8, align: 8, offset: 320)
!58 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "decomp_assemblies_ax", scope: !45, file: !28, line: 51, baseType: !5, size: 32, align: 32, offset: 352)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "segments_per_track", scope: !45, file: !28, line: 52, baseType: !11, size: 64, align: 64, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "assembly_width", scope: !45, file: !28, line: 53, baseType: !4, size: 32, align: 32, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !45, file: !28, line: 54, baseType: !4, size: 32, align: 32, offset: 480)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "domain_height", scope: !45, file: !28, line: 55, baseType: !4, size: 32, align: 32, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !45, file: !28, line: 56, baseType: !4, size: 32, align: 32, offset: 544)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "mype", scope: !45, file: !28, line: 57, baseType: !11, size: 64, align: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ntracks_2D", scope: !45, file: !28, line: 58, baseType: !11, size: 64, align: 64, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "z_stacked", scope: !45, file: !28, line: 59, baseType: !5, size: 32, align: 32, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ntracks", scope: !45, file: !28, line: 60, baseType: !11, size: 64, align: 64, offset: 768)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !45, file: !28, line: 62, baseType: !5, size: 32, align: 32, offset: 832)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "papi_event_set", scope: !45, file: !28, line: 63, baseType: !5, size: 32, align: 32, offset: 864)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "n_2D_source_regions_per_assembly", scope: !45, file: !28, line: 67, baseType: !11, size: 64, align: 64, offset: 896)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "n_source_regions_per_node", scope: !45, file: !28, line: 70, baseType: !11, size: 64, align: 64, offset: 960)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "load_tracks", scope: !45, file: !28, line: 79, baseType: !58, size: 8, align: 8, offset: 1024)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !45, file: !28, line: 80, baseType: !75, size: 64, align: 64, offset: 1088)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "segments_processed", scope: !45, file: !28, line: 82, baseType: !11, size: 64, align: 64, offset: 1152)
!78 = !DISubprogram(name: "time_per_intersection", scope: !14, file: !14, line: 136, type: !79, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, function: double (%struct.Input*, double)* @time_per_intersection, variables: !2)
!79 = !DISubroutineType(types: !80)
!80 = !{!6, !44, !6}
!81 = !{i32 2, !"Dwarf Version", i32 4}
!82 = !{i32 2, !"Debug Info Version", i32 3}
!83 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!84 = !DILocation(line: 5, column: 17, scope: !13)
!85 = !DILocation(line: 5, column: 10, scope: !13)
!86 = !DILocation(line: 5, column: 24, scope: !13)
!87 = !DILocation(line: 5, column: 3, scope: !13)
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mean", arg: 1, scope: !17, file: !14, line: 10, type: !4)
!89 = !DIExpression()
!90 = !DILocation(line: 10, column: 19, scope: !17)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sigma", arg: 2, scope: !17, file: !14, line: 10, type: !4)
!92 = !DILocation(line: 10, column: 31, scope: !17)
!93 = !DILocation(line: 12, column: 17, scope: !17)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rand1", scope: !17, file: !14, line: 12, type: !4)
!95 = !DILocation(line: 12, column: 9, scope: !17)
!96 = !DILocation(line: 13, column: 17, scope: !17)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rand2", scope: !17, file: !14, line: 13, type: !4)
!98 = !DILocation(line: 13, column: 9, scope: !17)
!99 = !DILocation(line: 17, column: 27, scope: !17)
!100 = !DILocation(line: 17, column: 23, scope: !17)
!101 = !DILocation(line: 17, column: 21, scope: !17)
!102 = !DILocation(line: 17, column: 13, scope: !17)
!103 = !DILocation(line: 17, column: 52, scope: !17)
!104 = !DILocation(line: 17, column: 50, scope: !17)
!105 = !DILocation(line: 17, column: 37, scope: !17)
!106 = !DILocation(line: 17, column: 35, scope: !17)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !17, file: !14, line: 17, type: !4)
!108 = !DILocation(line: 17, column: 9, scope: !17)
!109 = !DILocation(line: 23, column: 12, scope: !17)
!110 = !DILocation(line: 23, column: 20, scope: !17)
!111 = !DILocation(line: 23, column: 3, scope: !17)
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vector", arg: 1, scope: !20, file: !14, line: 27, type: !23)
!113 = !DILocation(line: 27, column: 27, scope: !20)
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !20, file: !14, line: 27, type: !11)
!115 = !DILocation(line: 27, column: 40, scope: !20)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum", scope: !20, file: !14, line: 28, type: !4)
!117 = !DILocation(line: 28, column: 9, scope: !20)
!118 = !DILocation(line: 31, column: 12, scope: !119)
!119 = distinct !DILexicalBlock(scope: !20, file: !14, line: 31, column: 7)
!120 = !DILocation(line: 31, column: 7, scope: !20)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !122, file: !14, line: 32, type: !5)
!122 = distinct !DILexicalBlock(scope: !119, file: !14, line: 32, column: 5)
!123 = !DILocation(line: 32, column: 14, scope: !122)
!124 = !DILocation(line: 32, column: 5, scope: !122)
!125 = !DILocation(line: 32, column: 10, scope: !122)
!126 = !DILocation(line: 32, column: 21, scope: !127)
!127 = !DILexicalBlockFile(scope: !128, file: !14, discriminator: 2)
!128 = !DILexicalBlockFile(scope: !129, file: !14, discriminator: 1)
!129 = distinct !DILexicalBlock(scope: !122, file: !14, line: 32, column: 5)
!130 = !DILocation(line: 32, column: 23, scope: !129)
!131 = !DILocation(line: 33, column: 14, scope: !129)
!132 = !DILocation(line: 33, column: 11, scope: !129)
!133 = !DILocation(line: 33, column: 7, scope: !129)
!134 = !DILocation(line: 32, column: 32, scope: !129)
!135 = !DILocation(line: 32, column: 5, scope: !129)
!136 = !DILocation(line: 33, column: 22, scope: !122)
