; ModuleID = 'result.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@cle = common global [32 x i8] zeroinitializer, align 16
@x1a0 = common global [16 x i16] zeroinitializer, align 16
@res = common global i16 0, align 2
@inter = common global i16 0, align 2
@i = common global i16 0, align 2
@x1a2 = common global i16 0, align 2
@dx = common global i16 0, align 2
@ax = common global i16 0, align 2
@cx = common global i16 0, align 2
@bx = common global i16 0, align 2
@tmp = common global i16 0, align 2
@si = common global i16 0, align 2
@.str = private unnamed_addr constant [33 x i8] c"abcdefghijklmnopqrstuvwxyz012345\00", align 1
@.str.1 = private unnamed_addr constant [53 x i8] c"PC1 Cipher 256 bits \0AENCRYPT file IN.BIN to OUT.BIN\0A\00", align 1
@buff = common global [32 x i8] zeroinitializer, align 16
@count = common global i32 0, align 4
@c1 = common global i32 0, align 4
@c = common global i16 0, align 2
@cfc = common global i16 0, align 2
@cfd = common global i16 0, align 2
@compte = common global i16 0, align 2
@d = common global i16 0, align 2
@e = common global i16 0, align 2

!4 = !DISubprogram(name: "assemble", scope: !5, file: !5, line: 36, type: !6, isLocal: false, isDefinition: true, scopeLine: 36, isOptimized: false, function: i32 ()* @assemble, variables: !2)
!5 = !DIFile(filename: "/home/gleison/tf/Benchmarks/Trimaran/enc-pc1/tmp.c", directory: "/home/gleison/tf/Benchmarks/Trimaran/enc-pc1")
!6 = !DISubroutineType(types: !7)
!7 = !{!8}
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DISubprogram(name: "code", scope: !5, file: !5, line: 139, type: !6, isLocal: false, isDefinition: true, scopeLine: 139, isOptimized: false, function: i32 ()* @code, variables: !2)
!10 = !DISubprogram(name: "my_rand_r", scope: !5, file: !5, line: 207, type: !11, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32*)* @my_rand_r, variables: !2)
!11 = !DISubroutineType(types: !12)
!12 = !{!8, !13}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!14 = !DISubprogram(name: "main", scope: !5, file: !5, line: 214, type: !15, isLocal: false, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !2)
!15 = !DISubroutineType(types: !16)
!16 = !{!8, !8, !17}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!21 = !{!22, !24, !25, !26, !27, !28, !29, !30, !34, !35, !36, !37, !38, !39, !40, !45, !46, !48, !49, !50, !51, !52}
!22 = !DIGlobalVariable(name: "ax", scope: !0, file: !5, line: 18, type: !23, isLocal: false, isDefinition: true, variable: i16* @ax)
!23 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!24 = !DIGlobalVariable(name: "bx", scope: !0, file: !5, line: 18, type: !23, isLocal: false, isDefinition: true, variable: i16* @bx)
!25 = !DIGlobalVariable(name: "cx", scope: !0, file: !5, line: 18, type: !23, isLocal: false, isDefinition: true, variable: i16* @cx)
!26 = !DIGlobalVariable(name: "dx", scope: !0, file: !5, line: 18, type: !23, isLocal: false, isDefinition: true, variable: i16* @dx)
!27 = !DIGlobalVariable(name: "si", scope: !0, file: !5, line: 18, type: !23, isLocal: false, isDefinition: true, variable: i16* @si)
!28 = !DIGlobalVariable(name: "tmp", scope: !0, file: !5, line: 18, type: !23, isLocal: false, isDefinition: true, variable: i16* @tmp)
!29 = !DIGlobalVariable(name: "x1a2", scope: !0, file: !5, line: 18, type: !23, isLocal: false, isDefinition: true, variable: i16* @x1a2)
!30 = !DIGlobalVariable(name: "x1a0", scope: !0, file: !5, line: 18, type: !31, isLocal: false, isDefinition: true, variable: [16 x i16]* @x1a0)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 256, align: 16, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 16)
!34 = !DIGlobalVariable(name: "res", scope: !0, file: !5, line: 18, type: !23, isLocal: false, isDefinition: true, variable: i16* @res)
!35 = !DIGlobalVariable(name: "i", scope: !0, file: !5, line: 18, type: !23, isLocal: false, isDefinition: true, variable: i16* @i)
!36 = !DIGlobalVariable(name: "inter", scope: !0, file: !5, line: 19, type: !23, isLocal: false, isDefinition: true, variable: i16* @inter)
!37 = !DIGlobalVariable(name: "cfc", scope: !0, file: !5, line: 19, type: !23, isLocal: false, isDefinition: true, variable: i16* @cfc)
!38 = !DIGlobalVariable(name: "cfd", scope: !0, file: !5, line: 19, type: !23, isLocal: false, isDefinition: true, variable: i16* @cfd)
!39 = !DIGlobalVariable(name: "compte", scope: !0, file: !5, line: 19, type: !23, isLocal: false, isDefinition: true, variable: i16* @compte)
!40 = !DIGlobalVariable(name: "cle", scope: !0, file: !5, line: 21, type: !41, isLocal: false, isDefinition: true, variable: [32 x i8]* @cle)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 256, align: 8, elements: !43)
!42 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!43 = !{!44}
!44 = !DISubrange(count: 32)
!45 = !DIGlobalVariable(name: "buff", scope: !0, file: !5, line: 24, type: !41, isLocal: false, isDefinition: true, variable: [32 x i8]* @buff)
!46 = !DIGlobalVariable(name: "c", scope: !0, file: !5, line: 26, type: !47, isLocal: false, isDefinition: true, variable: i16* @c)
!47 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!48 = !DIGlobalVariable(name: "c1", scope: !0, file: !5, line: 28, type: !8, isLocal: false, isDefinition: true, variable: i32* @c1)
!49 = !DIGlobalVariable(name: "count", scope: !0, file: !5, line: 28, type: !8, isLocal: false, isDefinition: true, variable: i32* @count)
!50 = !DIGlobalVariable(name: "d", scope: !0, file: !5, line: 30, type: !47, isLocal: false, isDefinition: true, variable: i16* @d)
!51 = !DIGlobalVariable(name: "e", scope: !0, file: !5, line: 30, type: !47, isLocal: false, isDefinition: true, variable: i16* @e)
!52 = !DIGlobalVariable(name: "in", scope: !0, file: !5, line: 32, type: !53, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @in)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !55, line: 48, baseType: !56)
!55 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/tf/Benchmarks/Trimaran/enc-pc1")
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 241, size: 1728, align: 64, elements: !58)
!57 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/tf/Benchmarks/Trimaran/enc-pc1")
!58 = !{!59, !60, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !80, !81, !82, !83, !87, !88, !90, !94, !97, !99, !101, !102, !103, !104, !108, !109}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !56, file: !57, line: 242, baseType: !8, size: 32, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !56, file: !57, line: 247, baseType: !61, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !56, file: !57, line: 248, baseType: !61, size: 64, align: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !56, file: !57, line: 249, baseType: !61, size: 64, align: 64, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !56, file: !57, line: 250, baseType: !61, size: 64, align: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !56, file: !57, line: 251, baseType: !61, size: 64, align: 64, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !56, file: !57, line: 252, baseType: !61, size: 64, align: 64, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !56, file: !57, line: 253, baseType: !61, size: 64, align: 64, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !56, file: !57, line: 254, baseType: !61, size: 64, align: 64, offset: 512)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !56, file: !57, line: 256, baseType: !61, size: 64, align: 64, offset: 576)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !56, file: !57, line: 257, baseType: !61, size: 64, align: 64, offset: 640)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !56, file: !57, line: 258, baseType: !61, size: 64, align: 64, offset: 704)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !56, file: !57, line: 260, baseType: !73, size: 64, align: 64, offset: 768)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !57, line: 156, size: 192, align: 64, elements: !75)
!75 = !{!76, !77, !79}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !74, file: !57, line: 157, baseType: !73, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !74, file: !57, line: 158, baseType: !78, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !74, file: !57, line: 162, baseType: !8, size: 32, align: 32, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !56, file: !57, line: 262, baseType: !78, size: 64, align: 64, offset: 832)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !56, file: !57, line: 264, baseType: !8, size: 32, align: 32, offset: 896)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !56, file: !57, line: 268, baseType: !8, size: 32, align: 32, offset: 928)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !56, file: !57, line: 270, baseType: !84, size: 64, align: 64, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 131, baseType: !86)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/tf/Benchmarks/Trimaran/enc-pc1")
!86 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !56, file: !57, line: 274, baseType: !23, size: 16, align: 16, offset: 1024)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !56, file: !57, line: 275, baseType: !89, size: 8, align: 8, offset: 1040)
!89 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !56, file: !57, line: 276, baseType: !91, size: 8, align: 8, offset: 1048)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, align: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 1)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !56, file: !57, line: 280, baseType: !95, size: 64, align: 64, offset: 1088)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !57, line: 150, baseType: null)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !56, file: !57, line: 289, baseType: !98, size: 64, align: 64, offset: 1152)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 132, baseType: !86)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !56, file: !57, line: 297, baseType: !100, size: 64, align: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !56, file: !57, line: 298, baseType: !100, size: 64, align: 64, offset: 1280)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !56, file: !57, line: 299, baseType: !100, size: 64, align: 64, offset: 1344)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !56, file: !57, line: 300, baseType: !100, size: 64, align: 64, offset: 1408)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !56, file: !57, line: 302, baseType: !105, size: 64, align: 64, offset: 1472)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !106, line: 62, baseType: !107)
!106 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/tf/Benchmarks/Trimaran/enc-pc1")
!107 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !56, file: !57, line: 303, baseType: !8, size: 32, align: 32, offset: 1536)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !56, file: !57, line: 305, baseType: !110, size: 160, align: 8, offset: 1568)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 160, align: 8, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 20)
!113 = !{i32 2, !"Dwarf Version", i32 4}
!114 = !{i32 2, !"Debug Info Version", i32 3}
!115 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!116 = !DILocation(line: 38, column: 14, scope: !4)
!117 = !DILocation(line: 38, column: 21, scope: !4)
!118 = !DILocation(line: 38, column: 30, scope: !4)
!119 = !DILocation(line: 38, column: 28, scope: !4)
!120 = !DILocation(line: 38, column: 13, scope: !4)
!121 = !DILocation(line: 38, column: 11, scope: !4)
!122 = !DILocation(line: 40, column: 3, scope: !4)
!123 = !DILocation(line: 42, column: 11, scope: !4)
!124 = !DILocation(line: 42, column: 9, scope: !4)
!125 = !DILocation(line: 44, column: 13, scope: !4)
!126 = !DILocation(line: 44, column: 25, scope: !4)
!127 = !DILocation(line: 44, column: 32, scope: !4)
!128 = !DILocation(line: 44, column: 41, scope: !4)
!129 = !DILocation(line: 44, column: 39, scope: !4)
!130 = !DILocation(line: 44, column: 21, scope: !4)
!131 = !DILocation(line: 44, column: 11, scope: !4)
!132 = !DILocation(line: 46, column: 3, scope: !4)
!133 = !DILocation(line: 48, column: 11, scope: !4)
!134 = !DILocation(line: 48, column: 19, scope: !4)
!135 = !DILocation(line: 48, column: 17, scope: !4)
!136 = !DILocation(line: 48, column: 9, scope: !4)
!137 = !DILocation(line: 50, column: 13, scope: !4)
!138 = !DILocation(line: 50, column: 25, scope: !4)
!139 = !DILocation(line: 50, column: 32, scope: !4)
!140 = !DILocation(line: 50, column: 41, scope: !4)
!141 = !DILocation(line: 50, column: 39, scope: !4)
!142 = !DILocation(line: 50, column: 21, scope: !4)
!143 = !DILocation(line: 50, column: 11, scope: !4)
!144 = !DILocation(line: 52, column: 3, scope: !4)
!145 = !DILocation(line: 54, column: 11, scope: !4)
!146 = !DILocation(line: 54, column: 19, scope: !4)
!147 = !DILocation(line: 54, column: 17, scope: !4)
!148 = !DILocation(line: 54, column: 9, scope: !4)
!149 = !DILocation(line: 56, column: 13, scope: !4)
!150 = !DILocation(line: 56, column: 25, scope: !4)
!151 = !DILocation(line: 56, column: 32, scope: !4)
!152 = !DILocation(line: 56, column: 41, scope: !4)
!153 = !DILocation(line: 56, column: 39, scope: !4)
!154 = !DILocation(line: 56, column: 21, scope: !4)
!155 = !DILocation(line: 56, column: 11, scope: !4)
!156 = !DILocation(line: 58, column: 3, scope: !4)
!157 = !DILocation(line: 60, column: 11, scope: !4)
!158 = !DILocation(line: 60, column: 19, scope: !4)
!159 = !DILocation(line: 60, column: 17, scope: !4)
!160 = !DILocation(line: 60, column: 9, scope: !4)
!161 = !DILocation(line: 62, column: 13, scope: !4)
!162 = !DILocation(line: 62, column: 25, scope: !4)
!163 = !DILocation(line: 62, column: 32, scope: !4)
!164 = !DILocation(line: 62, column: 41, scope: !4)
!165 = !DILocation(line: 62, column: 39, scope: !4)
!166 = !DILocation(line: 62, column: 21, scope: !4)
!167 = !DILocation(line: 62, column: 11, scope: !4)
!168 = !DILocation(line: 64, column: 3, scope: !4)
!169 = !DILocation(line: 66, column: 11, scope: !4)
!170 = !DILocation(line: 66, column: 19, scope: !4)
!171 = !DILocation(line: 66, column: 17, scope: !4)
!172 = !DILocation(line: 66, column: 9, scope: !4)
!173 = !DILocation(line: 68, column: 13, scope: !4)
!174 = !DILocation(line: 68, column: 25, scope: !4)
!175 = !DILocation(line: 68, column: 33, scope: !4)
!176 = !DILocation(line: 68, column: 42, scope: !4)
!177 = !DILocation(line: 68, column: 40, scope: !4)
!178 = !DILocation(line: 68, column: 21, scope: !4)
!179 = !DILocation(line: 68, column: 11, scope: !4)
!180 = !DILocation(line: 70, column: 3, scope: !4)
!181 = !DILocation(line: 72, column: 11, scope: !4)
!182 = !DILocation(line: 72, column: 19, scope: !4)
!183 = !DILocation(line: 72, column: 17, scope: !4)
!184 = !DILocation(line: 72, column: 9, scope: !4)
