; ModuleID = '/home/gleison/tf/Benchmarks/TSVC/ControlFlow-flt/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GlobalData = type { [32000 x float], [3 x i32], [4 x i8], [32000 x float], [5 x i32], [12 x i8], [32000 x float], [7 x i32], [4 x i8], [32000 x float], [11 x i32], [4 x i8], [32000 x float], [13 x i32], [12 x i8], [256 x [256 x float]], [17 x i32], [12 x i8], [256 x [256 x float]], [19 x i32], [4 x i8], [256 x [256 x float]], [23 x i32], [4 x i8], [256 x [256 x float]] }

@global_data = common global %struct.GlobalData zeroinitializer, align 16
@a = constant float* getelementptr inbounds (%struct.GlobalData, %struct.GlobalData* @global_data, i32 0, i32 0, i32 0), align 16
@b = constant float* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 128016) to float*), align 16
@c = constant float* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 256048) to float*), align 16
@d = constant float* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 384080) to float*), align 16
@e = constant float* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 512128) to float*), align 16
@aa = constant [256 x float]* bitcast (i8* getelementptr (i8, i8* bitcast (%struct.GlobalData* @global_data to i8*), i64 640192) to [256 x float]*), align 16

!57 = !DISubprogram(name: "s2711", scope: !10, file: !10, line: 3174, type: !37, isLocal: false, isDefinition: true, scopeLine: 3175, isOptimized: false, function: i32 ()* @s2711, variables: !2)
!58 = !DISubprogram(name: "s2712", scope: !10, file: !10, line: 3202, type: !37, isLocal: false, isDefinition: true, scopeLine: 3203, isOptimized: false, function: i32 ()* @s2712, variables: !2)
!59 = !DISubprogram(name: "s441", scope: !10, file: !10, line: 4604, type: !37, isLocal: false, isDefinition: true, scopeLine: 4605, isOptimized: false, function: i32 ()* @s441, variables: !2)
!60 = !DISubprogram(name: "s442", scope: !10, file: !10, line: 4637, type: !37, isLocal: false, isDefinition: true, scopeLine: 4638, isOptimized: false, function: i32 ()* @s442, variables: !2)
!61 = !DISubprogram(name: "s443", scope: !10, file: !10, line: 4682, type: !37, isLocal: false, isDefinition: true, scopeLine: 4683, isOptimized: false, function: i32 ()* @s443, variables: !2)
!62 = !DISubprogram(name: "s481", scope: !10, file: !10, line: 4856, type: !37, isLocal: false, isDefinition: true, scopeLine: 4857, isOptimized: false, function: i32 ()* @s481, variables: !2)
!63 = !DISubprogram(name: "s482", scope: !10, file: !10, line: 4887, type: !37, isLocal: false, isDefinition: true, scopeLine: 4888, isOptimized: false, function: i32 ()* @s482, variables: !2)
!64 = !DISubprogram(name: "min", scope: !10, file: !10, line: 4916, type: !65, isLocal: false, isDefinition: true, scopeLine: 4916, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i32)* @min, variables: !2)
!65 = !DISubroutineType(types: !66)
!66 = !{!13, !13, !13}
!67 = !DISubprogram(name: "set", scope: !10, file: !10, line: 5543, type: !68, isLocal: false, isDefinition: true, scopeLine: 5543, flags: DIFlagPrototyped, isOptimized: false, function: void (i32*, float*, float*)* @set, variables: !2)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !70, !14, !14}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!71 = !DISubprogram(name: "main", scope: !10, file: !10, line: 5572, type: !72, isLocal: false, isDefinition: true, scopeLine: 5572, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !2)
!72 = !DISubroutineType(types: !73)
!73 = !{!13, !13, !74}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!75 = !{!76, !78, !79, !80, !81, !82, !84, !85, !86, !87, !91, !92, !93, !94, !95, !99, !100, !101, !102, !148, !150, !152, !153, !154}
!76 = !DIGlobalVariable(name: "a", scope: !0, file: !10, line: 100, type: !77, isLocal: false, isDefinition: true, variable: float** @a)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!78 = !DIGlobalVariable(name: "b", scope: !0, file: !10, line: 101, type: !77, isLocal: false, isDefinition: true, variable: float** @b)
!79 = !DIGlobalVariable(name: "c", scope: !0, file: !10, line: 102, type: !77, isLocal: false, isDefinition: true, variable: float** @c)
!80 = !DIGlobalVariable(name: "d", scope: !0, file: !10, line: 103, type: !77, isLocal: false, isDefinition: true, variable: float** @d)
!81 = !DIGlobalVariable(name: "e", scope: !0, file: !10, line: 104, type: !77, isLocal: false, isDefinition: true, variable: float** @e)
!82 = !DIGlobalVariable(name: "aa", scope: !0, file: !10, line: 105, type: !83, isLocal: false, isDefinition: true, variable: [256 x float]** @aa)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!84 = !DIGlobalVariable(name: "bb", scope: !0, file: !10, line: 106, type: !83, isLocal: false, isDefinition: true, variable: [256 x float]** @bb)
!85 = !DIGlobalVariable(name: "cc", scope: !0, file: !10, line: 107, type: !83, isLocal: false, isDefinition: true, variable: [256 x float]** @cc)
!86 = !DIGlobalVariable(name: "tt", scope: !0, file: !10, line: 108, type: !83, isLocal: false, isDefinition: true, variable: [256 x float]** @tt)
!87 = !DIGlobalVariable(name: "X", scope: !0, file: !10, line: 59, type: !88, isLocal: false, isDefinition: true, variable: [32000 x float]* @X)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024000, align: 32, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 32000)
!91 = !DIGlobalVariable(name: "Y", scope: !0, file: !10, line: 59, type: !88, isLocal: false, isDefinition: true, variable: [32000 x float]* @Y)
!92 = !DIGlobalVariable(name: "Z", scope: !0, file: !10, line: 59, type: !88, isLocal: false, isDefinition: true, variable: [32000 x float]* @Z)
!93 = !DIGlobalVariable(name: "U", scope: !0, file: !10, line: 59, type: !88, isLocal: false, isDefinition: true, variable: [32000 x float]* @U)
!94 = !DIGlobalVariable(name: "V", scope: !0, file: !10, line: 59, type: !88, isLocal: false, isDefinition: true, variable: [32000 x float]* @V)
!95 = !DIGlobalVariable(name: "array", scope: !0, file: !10, line: 63, type: !96, isLocal: false, isDefinition: true, variable: [65536 x float]* @array)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2097152, align: 32, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 65536)
!99 = !DIGlobalVariable(name: "x", scope: !0, file: !10, line: 65, type: !88, isLocal: false, isDefinition: true, variable: [32000 x float]* @x)
!100 = !DIGlobalVariable(name: "temp", scope: !0, file: !10, line: 66, type: !4, isLocal: false, isDefinition: true, variable: float* @temp)
!101 = !DIGlobalVariable(name: "temp_int", scope: !0, file: !10, line: 67, type: !13, isLocal: false, isDefinition: true, variable: i32* @temp_int)
!102 = !DIGlobalVariable(name: "global_data", scope: !0, file: !10, line: 98, type: !103, isLocal: false, isDefinition: true, variable: %struct.GlobalData* @global_data)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalData", file: !10, line: 79, size: 13512192, align: 128, elements: !104)
!104 = !{!105, !106, !110, !111, !115, !116, !120, !121, !125, !126, !130, !133, !137, !138, !142, !143, !147}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !103, file: !10, line: 80, baseType: !88, size: 1024000, align: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !103, file: !10, line: 81, baseType: !107, size: 96, align: 32, offset: 1024000)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 96, align: 32, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 3)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !103, file: !10, line: 82, baseType: !88, size: 1024000, align: 32, offset: 1024128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !103, file: !10, line: 83, baseType: !112, size: 160, align: 32, offset: 2048128)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 160, align: 32, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 5)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !103, file: !10, line: 84, baseType: !88, size: 1024000, align: 32, offset: 2048384)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !103, file: !10, line: 85, baseType: !117, size: 224, align: 32, offset: 3072384)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 224, align: 32, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 7)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !103, file: !10, line: 86, baseType: !88, size: 1024000, align: 32, offset: 3072640)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !103, file: !10, line: 87, baseType: !122, size: 352, align: 32, offset: 4096640)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 352, align: 32, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 11)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !103, file: !10, line: 88, baseType: !88, size: 1024000, align: 32, offset: 4097024)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !103, file: !10, line: 90, baseType: !127, size: 416, align: 32, offset: 5121024)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 416, align: 32, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 13)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !103, file: !10, line: 91, baseType: !131, size: 2097152, align: 32, offset: 5121536)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2097152, align: 32, elements: !132)
!132 = !{!24, !24}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pad6", scope: !103, file: !10, line: 92, baseType: !134, size: 544, align: 32, offset: 7218688)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 544, align: 32, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 17)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !103, file: !10, line: 93, baseType: !131, size: 2097152, align: 32, offset: 7219328)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pad7", scope: !103, file: !10, line: 94, baseType: !139, size: 608, align: 32, offset: 9316480)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 608, align: 32, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 19)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "cc", scope: !103, file: !10, line: 95, baseType: !131, size: 2097152, align: 32, offset: 9317120)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "pad8", scope: !103, file: !10, line: 96, baseType: !144, size: 736, align: 32, offset: 11414272)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 736, align: 32, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 23)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !103, file: !10, line: 97, baseType: !131, size: 2097152, align: 32, offset: 11415040)
!148 = !DIGlobalVariable(name: "indx", scope: !0, file: !10, line: 110, type: !149, isLocal: false, isDefinition: true, variable: [32000 x i32]* @indx)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 1024000, align: 32, elements: !89)
!150 = !DIGlobalVariable(name: "xx", scope: !0, file: !10, line: 113, type: !151, isLocal: false, isDefinition: true, variable: float** @xx)
!151 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !14)
!152 = !DIGlobalVariable(name: "yy", scope: !0, file: !10, line: 114, type: !14, isLocal: false, isDefinition: true, variable: float** @yy)
!153 = !DIGlobalVariable(name: "digits", scope: !0, file: !10, line: 40, type: !13, isLocal: true, isDefinition: true, variable: i32* @digits)
!154 = !DIGlobalVariable(name: "ntimes", scope: !0, file: !10, line: 39, type: !13, isLocal: true, isDefinition: true, variable: i32* @ntimes)
!155 = !{i32 2, !"Dwarf Version", i32 4}
!156 = !{i32 2, !"Debug Info Version", i32 3}
!157 = !{!"clang version 3.7.0 (tags/RELEASE_370/rc3)"}
!158 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arr", arg: 1, scope: !9, file: !10, line: 120, type: !14)
!159 = !DIExpression()
!160 = !DILocation(line: 120, column: 16, scope: !9)
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !9, file: !10, line: 120, type: !4)
!162 = !DILocation(line: 120, column: 31, scope: !9)
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stride", arg: 3, scope: !9, file: !10, line: 120, type: !13)
!164 = !DILocation(line: 120, column: 42, scope: !9)
!165 = !DILocation(line: 122, column: 6, scope: !166)
!166 = distinct !DILexicalBlock(scope: !9, file: !10, line: 122, column: 6)
!167 = !DILocation(line: 122, column: 13, scope: !166)
!168 = !DILocation(line: 122, column: 6, scope: !9)
!169 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !170, file: !10, line: 123, type: !13)
!170 = distinct !DILexicalBlock(scope: !171, file: !10, line: 123, column: 3)
!171 = distinct !DILexicalBlock(scope: !166, file: !10, line: 122, column: 20)
!172 = !DILocation(line: 123, column: 12, scope: !170)
!173 = !DILocation(line: 123, column: 8, scope: !170)
!174 = !DILocation(line: 123, column: 19, scope: !175)
!175 = !DILexicalBlockFile(scope: !176, file: !10, discriminator: 2)
!176 = !DILexicalBlockFile(scope: !177, file: !10, discriminator: 1)
!177 = distinct !DILexicalBlock(scope: !170, file: !10, line: 123, column: 3)
!178 = !DILocation(line: 123, column: 21, scope: !177)
!179 = !DILocation(line: 123, column: 3, scope: !170)
!180 = !DILocation(line: 124, column: 26, scope: !181)
!181 = distinct !DILexicalBlock(scope: !177, file: !10, line: 123, column: 33)
!182 = !DILocation(line: 124, column: 27, scope: !181)
!183 = !DILocation(line: 124, column: 18, scope: !181)
!184 = !DILocation(line: 124, column: 16, scope: !181)
!185 = !DILocation(line: 124, column: 13, scope: !181)
!186 = !DILocation(line: 124, column: 8, scope: !181)
!187 = !DILocation(line: 124, column: 4, scope: !181)
!188 = !DILocation(line: 124, column: 11, scope: !181)
!189 = !DILocation(line: 125, column: 3, scope: !181)
!190 = !DILocation(line: 123, column: 29, scope: !177)
!191 = !DILocation(line: 123, column: 3, scope: !177)
!192 = !DILocation(line: 126, column: 2, scope: !171)
!193 = !DILocation(line: 126, column: 13, scope: !194)
!194 = distinct !DILexicalBlock(scope: !166, file: !10, line: 126, column: 13)
!195 = !DILocation(line: 126, column: 20, scope: !194)
!196 = !DILocation(line: 126, column: 13, scope: !166)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !198, file: !10, line: 127, type: !13)
!198 = distinct !DILexicalBlock(scope: !199, file: !10, line: 127, column: 3)
!199 = distinct !DILexicalBlock(scope: !194, file: !10, line: 126, column: 27)
!200 = !DILocation(line: 127, column: 12, scope: !198)
