; ModuleID = '/home/gleison/tf/Benchmarks/sim/tmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.NODE = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.ONE = type { i32, %struct.ONE* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [15 x i8] c"Output/sim.res\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"a+\00", align 1
@.str.2 = private unnamed_addr constant [30 x i8] c"Can not open Output/sim.res\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [2 x i8] c"8\00", align 1
@.str.4 = private unnamed_addr constant [10 x i8] c"tob.38-44\00", align 1
@.str.5 = private unnamed_addr constant [10 x i8] c"liv.42-48\00", align 1
@.str.6 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.7 = private unnamed_addr constant [23 x i8] c"specified 0 alignments\00", align 1
@.str.8 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@name1 = internal global i8* null, align 8
@name2 = internal global i8* null, align 8
@.str.9 = private unnamed_addr constant [30 x i8] c"argument %d has improper form\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/rc3)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !138)
!1 = !DIFile(filename: "tmp.c", directory: "/home/gleison/tf/Benchmarks/sim")
!2 = !{}
!3 = !{!4, !5, !7, !9, !10, !8, !17, !18}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "pairptr", file: !11, line: 273, baseType: !12)
!11 = !DIFile(filename: "/home/gleison/tf/Benchmarks/sim/tmp.c", directory: "/home/gleison/tf/Benchmarks/sim")
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "ONE", file: !11, line: 270, size: 128, align: 64, elements: !14)
!14 = !{!15, !16}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "COL", scope: !13, file: !11, line: 271, baseType: !8, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "NEXT", scope: !13, file: !11, line: 272, baseType: !12, size: 64, align: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "vertexptr", file: !11, line: 287, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "NODE", file: !11, line: 277, size: 288, align: 32, elements: !21)
!21 = !{!22, !23, !24, !25, !26, !27, !28, !29, !30}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "SCORE", scope: !20, file: !11, line: 278, baseType: !8, size: 32, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "STARI", scope: !20, file: !11, line: 279, baseType: !8, size: 32, align: 32, offset: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "STARJ", scope: !20, file: !11, line: 280, baseType: !8, size: 32, align: 32, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ENDI", scope: !20, file: !11, line: 281, baseType: !8, size: 32, align: 32, offset: 96)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ENDJ", scope: !20, file: !11, line: 282, baseType: !8, size: 32, align: 32, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "TOP", scope: !20, file: !11, line: 283, baseType: !8, size: 32, align: 32, offset: 160)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "BOT", scope: !20, file: !11, line: 284, baseType: !8, size: 32, align: 32, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "LEFT", scope: !20, file: !11, line: 285, baseType: !8, size: 32, align: 32, offset: 224)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "RIGHT", scope: !20, file: !11, line: 286, baseType: !8, size: 32, align: 32, offset: 256)
!31 = !{!32, !36, !43, !46, !49, !52, !55, !58, !61, !62, !65, !68, !71, !133}
!32 = !DISubprogram(name: "main", scope: !11, file: !11, line: 133, type: !33, isLocal: false, isDefinition: true, scopeLine: 135, isOptimized: false, function: i32 (i32, i8**)* @main, variables: !2)
!33 = !DISubroutineType(types: !34)
!34 = !{!8, !8, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!36 = !DISubprogram(name: "SIM", scope: !11, file: !11, line: 379, type: !37, isLocal: false, isDefinition: true, scopeLine: 382, isOptimized: false, function: i32 (i8*, i8*, i32, i32, i32, [256 x i32]*, i32, i32, i32)* @SIM, variables: !2)
!37 = !DISubroutineType(types: !38)
!38 = !{!8, !5, !5, !8, !8, !8, !39, !8, !8, !8}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8192, align: 32, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 256)
!43 = !DISubprogram(name: "big_pass", scope: !11, file: !11, line: 488, type: !44, isLocal: false, isDefinition: true, scopeLine: 490, isOptimized: false, function: i32 (i8*, i8*, i32, i32, i32, i32)* @big_pass, variables: !2)
!44 = !DISubroutineType(types: !45)
!45 = !{!8, !5, !5, !8, !8, !8, !8}
!46 = !DISubprogram(name: "locate", scope: !11, file: !11, line: 572, type: !47, isLocal: false, isDefinition: true, scopeLine: 574, isOptimized: false, function: i32 (i8*, i8*, i32)* @locate, variables: !2)
!47 = !DISubroutineType(types: !48)
!48 = !{!8, !5, !5, !8}
!49 = !DISubprogram(name: "small_pass", scope: !11, file: !11, line: 805, type: !50, isLocal: false, isDefinition: true, scopeLine: 807, isOptimized: false, function: i32 (i8*, i8*, i32, i32)* @small_pass, variables: !2)
!50 = !DISubroutineType(types: !51)
!51 = !{!8, !5, !5, !8, !8}
!52 = !DISubprogram(name: "addnode", scope: !11, file: !11, line: 886, type: !53, isLocal: false, isDefinition: true, scopeLine: 887, isOptimized: false, function: i32 (i32, i32, i32, i32, i32, i32, i32)* @addnode, variables: !2)
!53 = !DISubroutineType(types: !54)
!54 = !{!8, !8, !8, !8, !8, !8, !8, !8}
!55 = !DISubprogram(name: "findmax", scope: !11, file: !11, line: 942, type: !56, isLocal: false, isDefinition: true, scopeLine: 942, isOptimized: false, function: %struct.NODE* ()* @findmax, variables: !2)
!56 = !DISubroutineType(types: !57)
!57 = !{!18}
!58 = !DISubprogram(name: "no_cross", scope: !11, file: !11, line: 962, type: !59, isLocal: false, isDefinition: true, scopeLine: 962, isOptimized: false, function: i32 ()* @no_cross, variables: !2)
!59 = !DISubroutineType(types: !60)
!60 = !{!8}
!61 = !DISubprogram(name: "diff", scope: !11, file: !11, line: 988, type: !44, isLocal: false, isDefinition: true, scopeLine: 992, isOptimized: false, function: i32 (i8*, i8*, i32, i32, i32, i32)* @diff, variables: !2)
!62 = !DISubprogram(name: "display", scope: !11, file: !11, line: 1149, type: !63, isLocal: false, isDefinition: true, scopeLine: 1152, isOptimized: false, function: i32 (i8*, i8*, i32, i32, i32*, i32, i32)* @display, variables: !2)
!63 = !DISubroutineType(types: !64)
!64 = !{!8, !5, !5, !8, !8, !7, !8, !8}
!65 = !DISubprogram(name: "fatal", scope: !11, file: !11, line: 1215, type: !66, isLocal: false, isDefinition: true, scopeLine: 1216, isOptimized: false, function: i32 (i8*)* @fatal, variables: !2)
!66 = !DISubroutineType(types: !67)
!67 = !{!8, !5}
!68 = !DISubprogram(name: "fatalf", scope: !11, file: !11, line: 1222, type: !69, isLocal: false, isDefinition: true, scopeLine: 1223, isOptimized: false, function: i32 (i8*, i8*)* @fatalf, variables: !2)
!69 = !DISubroutineType(types: !70)
!70 = !{!8, !5, !5}
!71 = !DISubprogram(name: "ckopen", scope: !11, file: !11, line: 1230, type: !72, isLocal: false, isDefinition: true, scopeLine: 1231, isOptimized: false, function: %struct._IO_FILE* (i8*, i8*)* @ckopen, variables: !2)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !5, !5}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !76, line: 48, baseType: !77)
!76 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/gleison/tf/Benchmarks/sim")
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !78, line: 241, size: 1728, align: 64, elements: !79)
!78 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/gleison/tf/Benchmarks/sim")
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !100, !101, !102, !103, !107, !109, !111, !115, !118, !120, !121, !122, !123, !124, !128, !129}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !77, file: !78, line: 242, baseType: !8, size: 32, align: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !77, file: !78, line: 247, baseType: !5, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !77, file: !78, line: 248, baseType: !5, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !77, file: !78, line: 249, baseType: !5, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !77, file: !78, line: 250, baseType: !5, size: 64, align: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !77, file: !78, line: 251, baseType: !5, size: 64, align: 64, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !77, file: !78, line: 252, baseType: !5, size: 64, align: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !77, file: !78, line: 253, baseType: !5, size: 64, align: 64, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !77, file: !78, line: 254, baseType: !5, size: 64, align: 64, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !77, file: !78, line: 256, baseType: !5, size: 64, align: 64, offset: 576)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !77, file: !78, line: 257, baseType: !5, size: 64, align: 64, offset: 640)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !77, file: !78, line: 258, baseType: !5, size: 64, align: 64, offset: 704)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !77, file: !78, line: 260, baseType: !93, size: 64, align: 64, offset: 768)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !78, line: 156, size: 192, align: 64, elements: !95)
!95 = !{!96, !97, !99}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !94, file: !78, line: 157, baseType: !93, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !94, file: !78, line: 158, baseType: !98, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !94, file: !78, line: 162, baseType: !8, size: 32, align: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !77, file: !78, line: 262, baseType: !98, size: 64, align: 64, offset: 832)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !77, file: !78, line: 264, baseType: !8, size: 32, align: 32, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !77, file: !78, line: 268, baseType: !8, size: 32, align: 32, offset: 928)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !77, file: !78, line: 270, baseType: !104, size: 64, align: 64, offset: 960)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !105, line: 131, baseType: !106)
!105 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/gleison/tf/Benchmarks/sim")
!106 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !77, file: !78, line: 274, baseType: !108, size: 16, align: 16, offset: 1024)
!108 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !77, file: !78, line: 275, baseType: !110, size: 8, align: 8, offset: 1040)
!110 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !77, file: !78, line: 276, baseType: !112, size: 8, align: 8, offset: 1048)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 8, align: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 1)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !77, file: !78, line: 280, baseType: !116, size: 64, align: 64, offset: 1088)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !78, line: 150, baseType: null)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !77, file: !78, line: 289, baseType: !119, size: 64, align: 64, offset: 1152)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !105, line: 132, baseType: !106)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !77, file: !78, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !77, file: !78, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !77, file: !78, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !77, file: !78, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !77, file: !78, line: 302, baseType: !125, size: 64, align: 64, offset: 1472)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !126, line: 62, baseType: !127)
!126 = !DIFile(filename: "/home/gleison/lge/llvm-3.7-src/build-debug/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/gleison/tf/Benchmarks/sim")
!127 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !77, file: !78, line: 303, baseType: !8, size: 32, align: 32, offset: 1536)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !77, file: !78, line: 305, baseType: !130, size: 160, align: 8, offset: 1568)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 160, align: 8, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 20)
!133 = !DISubprogram(name: "mybasename", scope: !11, file: !11, line: 109, type: !134, isLocal: true, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false, function: i8* (i8*)* @mybasename, variables: !2)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!138 = !{!139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !184, !185, !186}
!139 = !DIGlobalVariable(name: "low", scope: !0, file: !11, line: 290, type: !18, isLocal: false, isDefinition: true, variable: %struct.NODE** @low)
!140 = !DIGlobalVariable(name: "most", scope: !0, file: !11, line: 291, type: !18, isLocal: false, isDefinition: true, variable: %struct.NODE** @most)
!141 = !DIGlobalVariable(name: "name1", scope: !0, file: !11, line: 127, type: !5, isLocal: true, isDefinition: true, variable: i8** @name1)
!142 = !DIGlobalVariable(name: "name2", scope: !0, file: !11, line: 127, type: !5, isLocal: true, isDefinition: true, variable: i8** @name2)
!143 = !DIGlobalVariable(name: "v", scope: !0, file: !11, line: 266, type: !39, isLocal: true, isDefinition: true, variable: [256 x i32]** @v)
!144 = !DIGlobalVariable(name: "q", scope: !0, file: !11, line: 267, type: !8, isLocal: true, isDefinition: true, variable: i32* @q)
!145 = !DIGlobalVariable(name: "r", scope: !0, file: !11, line: 267, type: !8, isLocal: true, isDefinition: true, variable: i32* @r)
!146 = !DIGlobalVariable(name: "qr", scope: !0, file: !11, line: 268, type: !8, isLocal: true, isDefinition: true, variable: i32* @qr)
!147 = !DIGlobalVariable(name: "row", scope: !0, file: !11, line: 274, type: !9, isLocal: false, isDefinition: true, variable: %struct.ONE*** @row)
!148 = !DIGlobalVariable(name: "z", scope: !0, file: !11, line: 274, type: !10, isLocal: false, isDefinition: true, variable: %struct.ONE** @z)
!149 = !DIGlobalVariable(name: "tt", scope: !0, file: !11, line: 275, type: !150, isLocal: true, isDefinition: true, variable: i16* @tt)
!150 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!151 = !DIGlobalVariable(name: "LIST", scope: !0, file: !11, line: 289, type: !17, isLocal: false, isDefinition: true, variable: %struct.NODE*** @LIST)
!152 = !DIGlobalVariable(name: "numnode", scope: !0, file: !11, line: 292, type: !8, isLocal: true, isDefinition: true, variable: i32* @numnode)
!153 = !DIGlobalVariable(name: "CC", scope: !0, file: !11, line: 294, type: !7, isLocal: true, isDefinition: true, variable: i32** @CC)
!154 = !DIGlobalVariable(name: "DD", scope: !0, file: !11, line: 294, type: !7, isLocal: true, isDefinition: true, variable: i32** @DD)
!155 = !DIGlobalVariable(name: "RR", scope: !0, file: !11, line: 295, type: !7, isLocal: true, isDefinition: true, variable: i32** @RR)
!156 = !DIGlobalVariable(name: "SS", scope: !0, file: !11, line: 295, type: !7, isLocal: true, isDefinition: true, variable: i32** @SS)
!157 = !DIGlobalVariable(name: "EE", scope: !0, file: !11, line: 295, type: !7, isLocal: true, isDefinition: true, variable: i32** @EE)
!158 = !DIGlobalVariable(name: "FF", scope: !0, file: !11, line: 295, type: !7, isLocal: true, isDefinition: true, variable: i32** @FF)
!159 = !DIGlobalVariable(name: "HH", scope: !0, file: !11, line: 296, type: !7, isLocal: true, isDefinition: true, variable: i32** @HH)
!160 = !DIGlobalVariable(name: "WW", scope: !0, file: !11, line: 296, type: !7, isLocal: true, isDefinition: true, variable: i32** @WW)
